{"thread_id": "thread_1302286423875920", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1302286423875920/", "createdAt_iso": "2023-08-19T14:36:03Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 18}, "post_text": "Dry needling experts.... What is the research/your clinical experience on dry needling and knee pain in runners? Assuming that all the other bases are being covered as far as mobility, strengthening, running technique etc, is there value to doing dry needling in this population? I would love to hear more as I have no dry needling experience, ty! I'm editing this for clarification. I'm NOT interested in doing this on a patient...I AM the patient in this case. I am training for the New York City marathon and I've been having some knee issues lately. So I wanted to learn more about the effectiveness of it for myself and I would go to someone who does it if it is worth my time.", "comments_text": ["It depends on where the pain is. I’ve done guided needling for a while and you can pretty much cure symptoms and pathology if done correctly. Working on producing the research to support this. To answer the question, patellar issues, quadriceps tendon issues, capsular issues around the patellofemoral joint - all very amenable to dry needling. Can stiffen up partially torn ligaments as well (superficial ones). Try it, you should find some benefits.", "I have found it very helpful, especially some areas that are hard to get to manually. Recently had someone with strained post tib and ran half marathon with no pain after one session of dry needling with estim. Obviously results aren’t always that quick, but I would also argue it would be harder for me to address manually and his race was 5 days after treatment. But also depends on state as NY doesn’t allow PTs to dry needle."], "why_selected": "Matched keywords: dry, needling, dry needling; High engagement (36); Relevance score: 35.8"}
{"thread_id": "thread_1005858580185374", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1005858580185374/", "createdAt_iso": "2022-07-08T23:50:01Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 6}, "post_text": "Hi guys. I'm wondering who gives the BEST Dry Needling Courses/Certs especially for the Pelvic region (my main reason for going)? Apparently, it looks like I need 40hrs of academic and 40hrs of hands on instruction in order to practice DN in my state. So it looks like getting the certification is the way to go. Any thoughts on this would be helpful? Thanks in advance.", "comments_text": ["I’m certified through Myopain Seminars…. I thought they did a fantastic job! To get certified it was 3 3day weekend courses. To learn the pelvic floor would be additional on top of that.", "I did mine through Evidence in Motion, used to be Kinetacore. They have Functional Dry Needling level 1(2-3 days)you then have to do 100 sessions before you can do level 2(2-3 days). They have a pelvic floor dry needling course but it requires level 1 and 200+ sessions I believe. I’m a huge fan, I think it’s a safer approach than others I’ve seen but I kind of boils down to this: if you want a faster more condensed course, go with another company. If you don’t mind taking the time to learn it all, 100% do this one."], "why_selected": "Matched keywords: courses, dry, needling, pelvic, dry needling; High engagement (12); Relevance score: 32.3"}
{"thread_id": "thread_1523119075125986", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1523119075125986/", "createdAt_iso": "2024-08-02T14:43:02Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 18}, "post_text": "Next summer I plan to get certified in Dry Needling. I am in Central Wisconsin and am cash/ non-insurance based PT and wellness. Does anyone have any recommendations on pricing for dry needling services ? I’m in the preliminary phases obviously but I am a planner at heart and want to get an eyeball on things if and when possible. Any help is appreciated! Also, if anyone has suggestions on which dry needling training y’all used, that would also be appreciated. I am a GCS and LSVT-BIG certified as well.", "comments_text": ["I like Rachel Garrett’s thoughts. I also have had sessions where the only thing performed was dry needling, and I charged my full rate. What’s important, Christian Biegel, is that (all of us) must get away from “a CPT code value” for a service (yes, I know. Dry needling isn’t covered, but the concept of “this thing is worth this amount”). Instead, we should recognize that people are paying for our knowledge, skill, experience, etc. Scott Dixon has a phenomenal course. There are several others out there also.", "I have a cash pay practice in Oshkosh and regularly utilize DN with my patients. I do not charge an additional fee if DN is used as a part of a full PT session. I do offer a mini-session for clients with an established POC who just need DN or manual therapy. After a full evaluation session, I offer appropriate clients the mini session for $75"], "why_selected": "Matched keywords: dry, needling, dry needling, course, manual therapy; High engagement (38); Relevance score: 30.8"}
{"thread_id": "thread_1772995006805057", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1772995006805057/", "createdAt_iso": "2025-06-24T03:58:20Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 7}, "post_text": "Is anyone here in Nevada and dry needling certified? Moving from Alaska to Vegas and trying to figure out their 150hr didactic requirement. Someone said I could use relevant classes from my DPT program to fulfill this, but I don't know how to translate them to hours. This is frustrating hitting a wall with a tool I've been utilizing already and feeling like I'm having to spend a small fortune on further con ed. 😩", "comments_text": ["The 150 hours is fulfilled by your PT school. The 25 hours is fulfilled via your dry needling con Ed as I understand/remember. There is a form to fill out and you submit the proof of the dry needling con ed and you should be good to go", "I am! From what I remember is that you just fill out a form online. I think the 150 hours is just from your degree? And 25 from like con-Ed from a dry needling course. And submit your certificate from the dry needling course."], "why_selected": "Matched keywords: dry, needling, dry needling, course, certified; High engagement (15); Relevance score: 30.4"}
{"thread_id": "thread_1044765672961331", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1044765672961331/", "createdAt_iso": "2022-09-01T03:00:25Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 14}, "post_text": "Dry needling question - I’m located in California and I know the law prohibits PTs from performing dry needling; however, I am also a certified ATC in which dry needling is allowed in CA. I’ve heard “it’s based on your highest level of education” but I also have colleagues that perform dry needling as ATC. Any insight would be helpful. Thanks!!!", "comments_text": ["Sorry, I have no input, but that scenario is insane. Mind blown.", "So ATCs are not regulated in CA, no governing body to dictate what can and cannot be done within the state. As far as dry needling, my understanding was that in CA it can only be performed by acupuncturists and MDs. Weird loophole it seems. I would think reaching out to the PT board might be the safest legally, although they will likely tell you that you can’t perform it. If you do, absolutely take coursework/get certified before performing the intervention! Interested to hear what the outcome is."], "why_selected": "Matched keywords: dry, needling, dry needling, course, certified; High engagement (33); Relevance score: 29.8"}
{"thread_id": "thread_1630599504377942", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1630599504377942/", "createdAt_iso": "2024-12-26T18:49:18Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 14}, "post_text": "Does anyone do cupping? IASTM? Dry needling? I have been thinking about getting certifications but not sure where to start? Best courses, etc How is reimbursement/cash pay?", "comments_text": ["Integrative Dry Needling is amazing. I use it ALL the time and their courses are 100% worth it. I also use cupping and IASTM a lot, but you definitely don’t need to pay for a course on those techniques."], "why_selected": "Matched keywords: courses, certifications, dry, needling, cupping; High engagement (29); Relevance score: 27.7"}
{"thread_id": "thread_1257734644997765", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1257734644997765/", "createdAt_iso": "2023-06-08T16:58:13Z", "metrics": {"reactionCount": 8, "shareCount": 0, "commentCount": 57}, "post_text": "What certifications and extra training has resulted in the biggest ROI for all you cash based peeps?", "comments_text": ["Short answer: Dry Needling & any Pelvic Floor knowledge. Long answer: Learning about whatever I’m most passionate about — in formal and informal ways. Me being excited & having solutions for my clients is more important than any single certification. Mentorships — informal from colleagues & formal online programs. Getting treatment from a wide variety of other providers. Even a bad massage has lessons to be learned. Manual therapy — if people like the quality of your touch, you’re gold. I only dry needle ~50% of the people who specifically book asking for DN. Often they are relieved it’s optional. But yes, I do think DN is a good skill for cash PT — unless you can adequately compensate with other strengths. The more I learn about Pelvic Floor the more effective my sessions are. Much more powerful than DN. I only do external PF and it’s still been a game changer. (Well PF Dry needling is great too!)", "manual therapy cert.....the skills, not the extra letters.......and its not even close"], "why_selected": "Matched keywords: certifications, dry, needling, pelvic, dry needling; High engagement (122); Relevance score: 27.4"}
{"thread_id": "thread_1875711826533374", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1875711826533374/", "createdAt_iso": "2025-10-20T19:03:24Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 2}, "post_text": "Any CEU's for sport/ortho that yall really enjoyed? Also interested in MMA/fighter specific, pelvic health (particularly pregnant/post partum), hormones, or business development courses I have already completed a manual therapy course and dry needling in the past. Feeling a little stale with programming, needing to complete for this renewal period but also just want to feel refreshed Florida PT.", "comments_text": ["Institute of Clinical Excellence has orthopedic, sports related, and pelvic floor courses. Would highly recommend any (or all) of them. I've done their tracks for all three certs and they fundamentally changed how I treat my clients.", "All courses ICE"], "why_selected": "Matched keywords: ceu, courses, dry, needling, pelvic; Relevance score: 26.9"}
{"thread_id": "thread_1244292386341991", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1244292386341991/", "createdAt_iso": "2023-05-19T00:06:09Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 17}, "post_text": "What is ur rate for just dry needling? Where are u purchasing needles from?", "comments_text": ["Dry needling is included in my plan of care and I never do it without exercise or neuro re-ed to follow up. It’s a disservice to patients to needle them without following that up with retraining the muscle. They will feel good for a bit then have to come back for more needling since the underlying issue isn’t being addressed. My visits are getting ready to go up to $180 this summer. I pretty much use only Serins from Lhasa since I can use them for try trigger point dry needling as well as with STIM or for fascial/scar needling. They are the most versatile needles I’ve found for all the ways I utilize it in my practice", "PT is not a drive-through or ala carte service. Dry needling should be part of an overall plan of care."], "why_selected": "Matched keywords: dry, needling, dry needling, trigger point; High engagement (38); Relevance score: 26.8"}
{"thread_id": "thread_1906943853410171", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1906943853410171/", "createdAt_iso": "2025-11-28T15:58:47Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 0}, "post_text": "Hello everyone, hope all is well! I just wanted to post this out here on our alumni page. If there is candidate who may be interested please email us at **info@pinnaclemp.com**: Job Opportunity: Physical Therapist – Outpatient setting in a privately owned gym Pay: $90,000-$105,000/annual salary depending on experience Location: 2855 S Congress Ave STE C. Delray Beach, FL. 33445 – Our HQ Move Better. Feel Better. Live Better. At Pinnacle Movement and Performance, we’re redefining outpatient physical therapy. We’re looking for a passionate and skilled Physical Therapist who thrives on providing one-on-one, patient-centered care in a relaxed, exclusive setting—far from the chaos of a high-volume clinic. This is your chance to work in a non-traditional, boutique-style environment where quality comes first, autonomy is encouraged, and your voice matters. What We Offer: * A daily caseload is 8 patients a day * Opportunity for mentorship with OCS and FAAOMPT practitioners * No PT mills, no 30-patient days * A chance to work with a fun, supportive team in a truly patient-first model * Flexible scheduling and involvement in community wellness events What You Bring: * Passion for helping people move better and feel better through movement * Strong interpersonal skills and a collaborative mindset * Excitement to be part of a growing hybrid practice offering a unique blend of clinical excellence and lifestyle integration Responsibilities: * Evaluate and treat patients with orthopedic, neuromuscular, and neurological conditions * Develop customized Plans of Care (POC) * Educate clients and families on therapy techniques and equipment use * Complete timely and accurate clinical documentation * Promote wellness and support community events/workshops * Adhere to safety and infection control guidelines (OSHA standards) Qualifications: * Doctorate in Physical Therapy (from an APTA-accredited program) * Current Florida PT license (in good standing) * CPR certification * Ideal Candidate will have 2 years of outpatient/private practice experience * Valid driver’s license and reliable transportation Bonus Points If You Have: * ATC, SCS, or OCS certification * Dry Needling, BFR, Spinal Manipulation, or Graston certification Perks & Benefits: * Continuing education credit opportunities * Flexible schedule tailored to your lifestyle * Career growth, mentorship, and leadership pathways Schedule: * Day shift (Monday–Friday) * Occasional weekends as needed Ready to make an impact where your work is valued and your patients come first? Email us with your resume to join a team that’s raising the bar for outpatient care in South Florida.", "comments_text": [], "why_selected": "Matched keywords: ocs, scs, faaompt, dry, needling; Relevance score: 24.3"}
{"thread_id": "thread_1492410138196880", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1492410138196880/", "createdAt_iso": "2024-06-17T10:56:57Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 41}, "post_text": "Hey guyys, i've seen some people talk about this, but honestly I don't know how I feel about it. I have a PT I work with that's COMT certified and his treatment methods are very different to McKenzie methods. Ive seen posts where is has been mostly COMT PT's bashing MDT PT's but honestly I'm trying to see where they find Maitland methods to be better. A lot of the good McKenzie therapists, does not see this as \"everyone does extension, they get better.\" They see it as a diagnostic tool. There has been several patients in my career that have been not extension responders but have been even flexion or rotational movements. We over flex as a society given that functional activities are in some form of flexion mostly. That's why I think most people respond best to extension because we over flex which cause changes in the spine/discs. For those who have had both Mckenzie training and Maitland training what do you feel is a more ideal method to diagnose and treat patients? Also, do you find one method or the other to be better for different pathologies?", "comments_text": ["No one should be bashing any one style. The reality is, they all help for the right patients. Some patients will respond better to Maitland, others to Mckenzie, others to [insert other style]. Your job as a PT is to have as many tools in the toolbox as possible so that when you come across a patient, you can not only fit them into the right style but the right technique in that style. Not everyone is a Mckenzie patient. And that's ok. I do a lot of counterstrain- and not everyone is a counterstrain patient, and that's ok.", "I’m Maitland certified and I think it’s appalling that any PT is bashing another technique. I think the best PTs are the ones with lots of varying tools available to them. At its core, Maitland is an assessment approach (not a treatment technique). The accessory mobility assessment does often lead to treatment (ie. Mobilizations) but in actuality I find the treatment often aligns with preferential directional treatment (which I believe falls under the McKenzie theories). I’m not McKenzie trained, but I have worked with McKenzie therapists… and I think the two approaches actually blend quite well together."], "why_selected": "Matched keywords: scs, maitland, certified, mckenzie, mdt; High engagement (87); Relevance score: 24.2"}
{"thread_id": "thread_1899964337441456", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1899964337441456/", "createdAt_iso": "2025-11-16T13:54:42Z", "metrics": {"reactionCount": 7, "shareCount": 0, "commentCount": 26}, "post_text": "Drop your favorite and most useful physical therapy continuing education courses, seminars, etc you’ve taken (outpatient ortho, sports med, and/or pelvic floor related). I’m already certified in advanced dry needling, ASTYM, and have done some upledger craniosacral courses. Bonus if the courses are somewhere warm in the winter months 😜", "comments_text": ["Clinical running essentials by Chris Johnson", "To clarify— for AFTER January 2026. I’m good through then but want to pay for the course and travel expenses by the end of this year for tax purposes"], "why_selected": "Matched keywords: courses, dry, needling, continuing education, pelvic; High engagement (59); Relevance score: 24.0"}
{"thread_id": "thread_1156838375087393", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1156838375087393/", "createdAt_iso": "2023-01-11T23:46:32Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 16}, "post_text": "Dry needling certification courses for PTAs in states other than TX OK and KY?? (For state practice acts that allow)", "comments_text": ["Spinal Manipulation Institute. Publishes consistently on the subject. All instructors are FAAOMPTs", "Master Dry Needling is where I got my cert, it was a great course, and have had great results practicing it. I'm in Texas. They have Courses Nationwide. I'm a PTA."], "why_selected": "Matched keywords: courses, dry, needling, faaompt, dry needling; High engagement (35); Relevance score: 23.8"}
{"thread_id": "thread_1521316488639578", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1521316488639578/", "createdAt_iso": "2024-07-30T20:00:16Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 8}, "post_text": "I have someone interested in Dry Needling for their knee but does not want to do formal physical therapy. She has Medicare. Medicare doesn’t cover dry needling for knees so can I charge cash and only charge for dry needling? Does there need to be a formal plan of care to legally dry needle?", "comments_text": ["I don’t see why it would matter. I’d have them still fill out some paperwork but don’t think it should be an issue", "FYI check the language on dry needling for MC for back pain. PT is not listed as an approved provider for it from what I understand. Specifically for that scenario is what I mean."], "why_selected": "Matched keywords: dry, needling, dry needling; High engagement (18); Relevance score: 23.5"}
{"thread_id": "thread_1483751585729402", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1483751585729402/", "createdAt_iso": "2024-06-03T19:08:43Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 8}, "post_text": "Hello, I am seeking information from anyone in this group that has experience creating state board approved continuing education courses. Which states have you had the best luck getting approval in? Are there any states which meet and evaluate courses seeking certification more often than others? TYIA", "comments_text": ["Ive been teaching ceu classes. Easier one are TN and IL.", "No pre-approved courses in Colorado. The course needs objectives, a test and course/instructor eval to meet Level 1 CEU’s."], "why_selected": "Matched keywords: ceu, courses, continuing education, course, certification; High engagement (18); Relevance score: 23.5"}
{"thread_id": "thread_1362463054524923", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1362463054524923/", "createdAt_iso": "2023-11-27T04:17:40Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 7}, "post_text": "I’m looking for some really good beginners dry needling courses in NC or around. Any recommendations?", "comments_text": ["AAMT dry needling courses are the best. They are usually in Charlotte.", "Thank you Sara Roberts Erin Melcer Young I’m looking at the courses and just wanted to check if you’ll have a specific instructor recommendation that I should consider I’m flexible with surrounding locations."], "why_selected": "Matched keywords: courses, dry, needling, dry needling, course; High engagement (14); Relevance score: 23.4"}
{"thread_id": "thread_1851125685658655", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1851125685658655/", "createdAt_iso": "2025-09-24T14:32:40Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 4}, "post_text": "What happens when your best skills meet the *right* patients? 💡 In our latest episode of **The Uncaged Clinician Podcast**, host David Bayliff sits down with Dr. Scott Dixon — founder of Athletic Dry Needling & Spinal Manipulation — to share how he transformed his expertise into a thriving educational business that’s making waves nationwide. 🌊 From hilarious banter about hairstyles & tequila 🥂 to powerful insights on business and leadership, this episode is packed with value: ✨ Why Scott chose to specialize in dry needling ✨ How patient outcomes shaped his career path ✨ Moving from clinician ➡️ educator ✨ Delegating tasks & raising leaders ✨ Choosing the right dry needling course ✨ What’s next for Athletic Dry Needling 🎧 *Listen now to discover how leaning into your strengths can unlock your potential and transform your business! ***[links in comments below]** 🔥 **EARLY BIRD ALERT!** 🔥 Our Uncaged University Early Bird Discount ends soon — save **$1,000 off** when you schedule your application call today! 👉 **[link below]** Your success is our success — let’s build it together! 💪 #UncagedClinician #PodcastRelease #PhysicalTherapyBusiness #DryNeedling #ClinicianToEntrepreneur #UncagedUniversity", "comments_text": [], "why_selected": "Matched keywords: dry, needling, dry needling, course, manipulation; High engagement (11); Relevance score: 23.2"}
{"thread_id": "thread_1043790593058839", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1043790593058839/", "createdAt_iso": "2022-08-30T21:05:19Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 5}, "post_text": "For those whose clients pay cash do you get an order from the MD for dry needling? For those who go through insurance and already have a script, do you get an additional script for dry needling?", "comments_text": ["I’m in montana. No specific dry needling referral. You are the expert- if PT is indicated then you get to make your best clinical judgement if it’s indicated. The only possible exception may be to touch base with surgeon if it is post op to make sure you maintain a good working relationship (if he sends you tons of referrals but hates or doesn’t understand needling, for instance)", "I believe insurance doesn't cover dry needling anyway? And in Colorado, I don't ask for a referral for anything. Ever. I'm cash pay. It's probably different in other states"], "why_selected": "Matched keywords: dry, needling, dry needling; Relevance score: 23.2"}
{"thread_id": "thread_1417643395673555", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1417643395673555/", "createdAt_iso": "2024-02-22T12:00:49Z", "metrics": {"reactionCount": 15, "shareCount": 0, "commentCount": 91}, "post_text": "What extra certifications do you all have that you have found compliments your traditional PT services? Personal training? Yoga? Meditation? Aging in place certifications? Others....? I am wondering if I should add something to my services...", "comments_text": ["Only add what will educate you to care for your patients the way you want. There’s no best certification. I have very few certifications and I rarely talk about them. If you’re “wondering” then I’d say you don’t need anything. If you see to learn a skill to help your clients better do that and don’t worry about if it’s certified or not. Certified just means you completed the program to the organizer’s standard. It attracts clients who gravitate toward name brands.", "Certified Manual therapist. Certified Pilates Instructor. Two great adjuncts to Orthopedic PT practice."], "why_selected": "Matched keywords: certifications, orthopedic, certification, certified; High engagement (197); Relevance score: 22.6"}
{"thread_id": "thread_1887718881999335", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1887718881999335/", "createdAt_iso": "2025-11-03T02:24:11Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 6}, "post_text": "Any advice on starting a mobile, cash based dry-needling service? Thinking of primarily marketing to ENT and Dentist in small town for TMJ and Headache cases first and then branching out based off word-of-mouth. Also wanting to avoid conflict of interest with my current employer.", "comments_text": ["Whatever you do, please do not market it as a dry needling practice. You are either a PT, an OT, a chiropractor, etc. Dry needling is one tool in your overall toolbox and should only be used as part of a holistic plan of care, regardless of the diagnosis or patient in front of you. We are fighting for multiple professions to be able to dry needle in multiple states and using dry needling as a standalone intervention is putting many of us at risk for losing the privilege. Thanks in advance.", "I would suggest you join the formal Uncaged Clinician coaching group. Not only would it give you the exact steps that you need, but also specific ongoing support. David Bayliff is incredible."], "why_selected": "Matched keywords: dry, needling, dry needling; High engagement (14); Relevance score: 22.4"}
{"thread_id": "thread_1455004768604084", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1455004768604084/", "createdAt_iso": "2024-04-21T14:35:09Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 2}, "post_text": "Hello everyone, I would love to get some idea ideas on how to structure commission for an employee who does dry needling. The employee is paid $65 an hour. Dry needling charge is $45 for up to 3 body parts. It takes about 5-10 mins to do DN and usually is done within the hour of the patient treatment. All material cost is covered by the clinic. How much is a fair amount to give the employee as commission per dry needling encounter. Any suggestions/ other ideas are welcome Thank you!", "comments_text": ["Dry needling certification is expensive and an asset to the clinic. I think it depends on how many patients are being needled by this employee as supplies are not cheap either. I would run some numbers and see how many patients would be needed to cover the cost of the supplies and maybe offer incentives to the employee based on the patients needled. If that’s too much to track then maybe split the charge.", "$65 an hour sounds inclusive to me :)"], "why_selected": "Matched keywords: dry, needling, dry needling, certification; Relevance score: 21.8"}
{"thread_id": "thread_1210223223082241", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1210223223082241/", "createdAt_iso": "2023-03-26T16:56:50Z", "metrics": {"reactionCount": 51, "shareCount": 0, "commentCount": 78}, "post_text": "Hey guys! I have been growing an online running coaching business and I have athletes all over the US. The focus is on a lot of distance running so clearly aches and pains often pop up. I'd love to start a referral list for PTs in different areas and thought it would be great to ask this group! I am looking for PTs that are proficient in outpatient ortho/sports med. Experience working with runners is a big plus but also I'd like clinicians with strong manual therapy skills. Please DM me if you are interested in developing a connection! And give me details on what you offer (dry needling, insurance vs cash pay, etc). Thank you so much!", "comments_text": ["Thanks everyone!! Keep them coming. I'll be in touch and share the list too once I compile all the info 🙂 (as long as that is allowed!!)", "Hello Brianne Vannucci, I am in Ohio between Cleveland and Columbus. I have 8 years of experience in outpatient ortho! My manual skills include but are not limited to Dry needling, IASTM, Muscle activation techniques, muscle energy techniques and I believe that using manual therapy and help get my clients better-faster! I'd love to connect. We actually have a lot of runners in the area and I would love to see how your coaching could help them be successful as well 🙂 looking forward to talking with you! PS, I couldn't DM you but wanted to message you!"], "why_selected": "Matched keywords: dry, needling, sports, dry needling, manual therapy; High engagement (207); Relevance score: 21.7"}
{"thread_id": "thread_1765654434205781", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1765654434205781/", "createdAt_iso": "2025-06-15T02:31:30Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 40}, "post_text": "How often are your patients having adverse reactions to dry needling? I try to warn them that they may be sore for 1-2 days following our session but I feel like with upper traps specifically, my patients often have an increase in their pain for a few days. Is there something I’m missing with upper trap techniques for dry needling specifically?", "comments_text": ["Describe your treatment approach - not enough information for anyone to accurately answer. I first learned dry needling from a more aggressive, piston-until-it-stops-twitching, treatment philosophy. I was so excited to use it in clinic the following Monday, and on the first patient I could - a pretty irritable glute tendinopathy. They did come back for a second session, thankfully, but asked that I never dry needle them again! What I’ve found over the years is that certain body parts are more sensitive to it, that certain people are more sensitive to it, that I had eventually gravitated to “piston less, stim more” before Paul Killoren coined it as a phrase, and that we always need to appreciate the symptom irritability of the patient before us. I would treat that “first patient” so much differently now than I had that day.", "Soreness after needling for 24-48 hours isn’t uncommon but it shouldn’t be excessive, otherwise it’s an indicator that your techniques were likely too aggressive. The upper traps have an emergent point and motor point in the same ballpark so they tend to get extra ‘twitchy’ - those local twitch responses from pistoning can definitely make someone pretty sore and achey, so have to feel out your clientele to judge whether or not you think they can handle it (and if it’s even appropriate)"], "why_selected": "Matched keywords: dry, needling, dry needling; High engagement (82); Relevance score: 21.2"}
{"thread_id": "thread_1019082352196330", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1019082352196330/", "createdAt_iso": "2022-07-27T03:32:44Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 28}, "post_text": "Looking for some billing advice.... I currently work at a hospital based outpatient clinic. I usually feel that their ethics are good, but I’ve recently started dry needling and was educated to bill it as manual therapy. I don’t feel comfortable with this, but they haven’t been willing to set up a cash pay system for dry needling. Do I continue to dry needle and not bill for it? Or just tell them I will no longer be providing dry needling services?", "comments_text": ["The answer is actually really simple. The Insurnace companies tell you. I can’t answer for you as it depends on where you are but all Insurnace companies very specifically tell you what to bill and if covered In their medical guidelines. Just a quick google search…. Hope that helps", "I'm not sure why you feel it isn't manual therapy? Imo, with PT services, our time should be reimbursed the maximum amount, because it shouldn't matter what we choose to do in our tx session; it should all be up to us. Why would we not get the best reimbursement for our time?"], "why_selected": "Matched keywords: dry, needling, dry needling, manual therapy; High engagement (56); Relevance score: 21.0"}
{"thread_id": "thread_1401776953926866", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1401776953926866/", "createdAt_iso": "2024-01-28T17:23:58Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 20}, "post_text": "This company near me offers Pelvic Floor Therapy. They are Naturopathic Doctors, all fine, but I noticed this on their website - are they able to bill this under PT??? That doesn't seem right.", "comments_text": ["They can see the patient for pelvic therapyas a cash patient. but it would be fraud to bill under Physical therapy and use the patients insurance benefits under PT if they are not a licensed PT", "I do not know the answer to your question. I’m learning this too. But I do know that we as a physical therapy profession do not “own” CPT codes, they are universally used in the medical field and selected by a provider and should only be utilized within a scope of practice. So therapeutic exercise can be used for different professions than just physical therapist. So physicians can bill 97110 and they would put their modifier instead of ours(GP). Also, the Herman and Wallace Institute allows a wide array of providers to take their courses, including Naturopathic Doctors. Many other pelvic floor courses can be taken by others. I know a personal trainer that calls her self a pelvic floor therapy specialist and states she has multiple pelvic floor certifications. So if it is the scope of treatment for Natropathic Doctors to perform and they have the skill set then I suspect they could bill. I see many different professions calling themselves pelvic floor specialists from holistic doctors to nurse midwives to personal trainers. Also, they are typically skillful with the wording calling it pelvic floor therapy instead of pelvic floor physical therapy."], "why_selected": "Matched keywords: courses, certifications, pelvic, course, certification; High engagement (41); Relevance score: 20.9"}
{"thread_id": "thread_1596147437823149", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1596147437823149/", "createdAt_iso": "2024-11-09T12:28:58Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 14}, "post_text": "Does anyone have a great running biomechanics course they recommend? I'd like to get more up to date on shoe options, biomechanics, speed work etc. I'm looking for live courses only.", "comments_text": ["Definitely recommend RunDNA! I’ve taken their level 1 & level 2 CRGA courses. I’ve also purchased the endurance run coach and walking gait analysis courses. They have a special right now to get both CRGA courses & the CWGA course all for $599!!", "Depending on where you live but I think UCSF has a once a year course."], "why_selected": "Matched keywords: courses, course; High engagement (33); Relevance score: 20.8"}
{"thread_id": "thread_1285279182243311", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1285279182243311/", "createdAt_iso": "2023-07-21T14:14:55Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 12}, "post_text": "For those who dry needle, what are your thoughts? Just bang for your buck? Worth it? In NJ it took a while for PTs to be able to do this, but seems like it also requires 40 hours of hands on- which I am okay doing. But just wondering for those in a hybrid practice (cash, medicare and OON benefits) is this worth it of would you recommand spending the moeny on other courses? I love to learn - and being hands on is something I actually enjoy and feel it connects me to my patients and helps with their recovery so looking into where I should allocate some CEU money. I specialize in pelvic PT if that helps! Thanks!", "comments_text": ["It's a game changer in my opinion! NJ requirements are 80 hours total...40 hands on/40 academic. You will need them to ask be live webinars. Consider myopain which has a third course for pelvic floor! I'm sure there are other ones as well. I liked IDN bc it covered most of NJ requirements with the least amount of money .... Of course that just means I get to take more DN courses with the money saved lol. As reference, it cost me like 4-5k to get certified and I made my money back with packages", "Do it tulsi"], "why_selected": "Matched keywords: ceu, courses, dry, idn, pelvic; High engagement (25); Relevance score: 20.6"}
{"thread_id": "thread_1676245086480050", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1676245086480050/", "createdAt_iso": "2025-02-26T14:36:36Z", "metrics": {"reactionCount": 10, "shareCount": 0, "commentCount": 48}, "post_text": "To recertify a board-specialty…or not? I would love some discussion from the hive mind to help me mentally work through this. I have a board specialty, and am proud of the hard work that went into obtaining it years ago, but beyond the initial boost in knowledge in my specialty area, I can’t say that I see it continue to pay off. I can think of LESS than a handful of clients in those years who said they found me because of the specialty or because someone recommended them to me because of the specialty. I can think of no referral sources who place it above location, reputation and relationship. The costs are kind of outrageous. Over a 10 year MOSC cycle, $760 in MOSC fees. $470 each time for an every-3-yr required course, and an extra $200 in supplies if you don’t have them. $180 for an application review at the 10 yr mark, and $810 to sit for the recertification exam at the 10 yr mark (provided you’re an APTA member). That works out to $3300 over 10 years. Just to have it! This is having shades of a “sunk cost” fallacy. New grads come out, have a good argument about their schooling costing more and inflation and salaries doing what they do, and can start not far from where an established clinician with a board specialty costs. The board specialty becomes a non-factor as a bargaining chip for salary and pay discussions. Has anybody had similar thoughts or experiences? Has anybody decided, for themselves, to recertify? Why? Has anybody here decided NOT to recertify? Why? Any help and discussion as I mentally work through it would be so welcomed!", "comments_text": ["Thank you all so much for your input on this. Seems like many of you have reached the same conclusion I’m feeling but not ready to fully accept yet. This is unfortunate, and more unfortunate that board specialties are still promoted like they are as a gateway to career advancement, increased pay, etc.", "All these are namesake nomenclature with zero financial benefits.... if you are a employee or employer in our field of practice ... the bottom for reimbursement is license to practice... Any PT can be equally knowledgeable academically without getting this certificates and still treat patients.... All these certificate BS is created by our lovely APTA to make money for themselves and those CEU companies .... as I was taught All this manual certification courses at my university while pursuing my masters and it is listed on the course syllabus... As they say Doctors \"Practice\".... and everyone knows \"practice make man perfect\"."], "why_selected": "Matched keywords: ceu, courses, course, certification, certificate; High engagement (106); Relevance score: 20.3"}
{"thread_id": "thread_1348131765958052", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1348131765958052/", "createdAt_iso": "2023-11-02T19:12:15Z", "metrics": {"reactionCount": 9, "shareCount": 0, "commentCount": 25}, "post_text": "Has anyone taken any online courses from Institute of Clinical Excellence? I’m considering taking a course for CEUs and don’t want to waste my time if you didn’t feel like it helped your clinical knowledge. Thanks!", "comments_text": ["I just took the Clincal Management of the Fitness Athlete foundations course and I thought it was really insightful. Each week featured: a lecture video with some drills, a weekly homework assignment, a zoom meeting to breakdown some videos submitted for homework and Q&A. The instructors are clinic owners that still treat patients and coach CrossFit and are active fitness athletes themselves. Bonus you get lifetime access to the material so you can always refer back.", "I havent, but if its CEUs and strength training youre looking for, I can vouch for my course, the 6 week Clinical Coach Challenge, which affords 30 CEUs and is within the same niche as ICE's courses :)"], "why_selected": "Matched keywords: courses, idn, ceu, course, ceus; High engagement (59); Relevance score: 20.0"}
{"thread_id": "thread_1346564169448145", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1346564169448145/", "createdAt_iso": "2023-10-31T02:41:55Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 15}, "post_text": "Anyone focus only on dry needling in their practice? Any thoughts on the best certification?", "comments_text": ["AAMT is the best. I have been dry needling for 8 of my 16 years as a PT. I don’t recommend that you only dry needle. It’s a tool, to be used as part of your PT treatment.", "I loved integrated dry needling. They focus on using the needles as a tool. Not the end all be all for every injury. It has really helped me and my practice"], "why_selected": "Matched keywords: dry, needling, dry needling, certification; High engagement (32); Relevance score: 19.7"}
{"thread_id": "thread_1205758546862042", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1205758546862042/", "createdAt_iso": "2023-03-19T16:23:16Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 11}, "post_text": "Are we as PT's able to utilize something like ethyl chloride or any other numbing spray prior to Dry Needling? If so, what do you use? I have had a few patients ask me if I had any sort of numbing spray.", "comments_text": ["Not sure if we are allowed to use it or not or not, but a big part of the mechanism behind dry needling is the gate control theory of pain. Without the painful stimulus from the needle, you lose that potential neuropathic mechanism of healing. Still get the increased blood flow from micro trauma and twitch response but I think that’s an important piece of the healing process.", "I don't think a numbing spray would be of much help as the initial price of the skin is minimal in my experience. It wouldn't help with the deep ache people experience or stronger twitches. As some said earlier, there are alternative treatment options. I frequently use SCS for patients who are needle phobic or just don't want dry needling. I personally don't find it quite as effective but try to accommodate people as much as much as possible"], "why_selected": "Matched keywords: scs, dry, needling, dry needling; High engagement (22); Relevance score: 19.6"}
{"thread_id": "thread_1485203768917517", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1485203768917517/", "createdAt_iso": "2024-06-06T01:12:26Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 5}, "post_text": "Update on lawyer post: So originally the kawyer had reduced our amount to $2500 and $1500 for husband and wife. Which we emailed back saying we accepted those amounts. Then the husband came to our office and asked for reduction in our fee. I spoke with the husband and told him there’s nothing we could do and it would be fraud if we reduced our amount for him to get more money back. Well a few days later the lawyers office send us a check for $500 for the husband and $900 for the wife….. I emailed the lawyer and asked what happened to our original amount. Here’s what they said: After speaking with my clients looking at the medical billing, you billed Medicare for all of Mr (husband) visits and some of Ms. (Wife’s) visits. Under Medicare rules, providers are not allowed to balance bill patients. The payment of $500 represents Mr. (Husbands) copays. There should have been a separate check for Ms. (Wife’s) in the amount of $900 for the visits that were not willed to Medicare.” I have no idea what to even say. I’m so pissed. We charged the wife our self pay rate because she was not on Medicare. So I don’t understand how the lawyers office can reimburse us Medicare rate…. And for the husband, they only covered his copay and NONE of the dry needling…. “ Here’s the old post for people to read: “I saw a husband/wife post MVA, and I treated them for a few weeks. We just received payment for their settlement. And it’s a good amount. Now the husband came into our office today and asked to lower our amount. The lawyer showed them what we were getting from the settlement and the husband came to us and asked to lower so they can get more from the settlement. Kind of sucks. And I’m not sure what to even say or do. I don’t mind lowering the amount. And I did treat them together and not separately because that’s how they would want it. Wife was very sensitive so wasn’t able to do much as for treatment. But husband I did a lot of dry needling and manual on. Husband was saying we didn’t do much on his wife so we Shouldnt charge much. Etc etc. This is also ironic because I know them to be very well off. Any advice?”", "comments_text": ["Balance Billing does not apply to 3rd party payers like auto/personal Injury. Once the case is settled, MC or private pay is supposed to be reimbursed, but u are do your full fee. I would get your own attorney or take these patients to small claims court. From now on, for these auto/P.I., I strongly recommend collecting your fee upfront and let the patient and attorney deal with all of the above mentioned B.S. This will effectively weed out those clients who are just gunning for a settlement.", "Also, I’m only billing for my dry needling which is not a covered service. I’m not billing our self pay rate or anything like that for the husband. And the wife didn’t even have insurance. So we billed our self pay rates. She got on Medicare towards the end of treatment so we didn’t charge our self pay rate for that."], "why_selected": "Matched keywords: dry, needling, idn, dry needling; High engagement (12); Relevance score: 19.3"}
{"thread_id": "thread_1827723254665565", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1827723254665565/", "createdAt_iso": "2025-08-28T09:31:53Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 3}, "post_text": "I recently took a dry needling class in atlanta and I practice in Florida. Can i start adding DN in my treatments or do i have to be supervised every time I dry needle until I get certified or take additional courses ?", "comments_text": ["In FL you have to be certified and then have 25 supervised sessions.", "Certification first before you can needle as a treatment. Both UE/ LE courses will get the contact hour requirements. THEN it’s 25 treatments under supervision. Then you can submit for the DN tie to your license number. Once you get the confirmation that your license is updated, then you can needle independently."], "why_selected": "Matched keywords: courses, dry, needling, dry needling, course; Relevance score: 19.0"}
{"thread_id": "thread_1461295407975020", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1461295407975020/", "createdAt_iso": "2024-05-01T03:22:25Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 2}, "post_text": "I've been thinking about branching out recently as I've noticed a need for mobile Parkinson's style programming like RockSteady or LSVT in my area. What would be first steps for this outside of gaining the certification/clearance to use the programming systems? Also, if it's the programming/groups that's being provided would it HAVE to be called OT and require an order/be billed as OT? Or is there a way around the referral process to make it more accessible? I live in Illinois and am fairly certain it's a direct access state per the state practice act but I could have misread. Ideally, I imagine running it like a gym model - offering groups and 1:1 at a specific \"class rate\" or \"membership rate.\" Thanks for any and all insight!!", "comments_text": ["Honestly I’d look into PWR instead of LSVT- it’s more adaptable and modifiable to patients. I know a lot of personal trainers teach PWR classes…community word of mouth, no formal referrals", "In order to officially offer PWR, LSVT BIG, or Rock Steady, you would need to take the respective courses to get certified. To offer PWR as a non-therapist, you could get certified as an instructor. That track is geared toward the various fitness instructor roles, and can of course also be taken by clinicians. Rock Steady is by default a wellness/exercise based certification. You can get certified as a therapist and could use the ideas in your practice, but you would not be providing the skills of your discipline. It would be a Rock Steady class. As far as I know, there are only clinician certifications for LSVT BIG. There is BIG for Life, though, which may be something other fitness instructors qualify to get certified in. I frankly haven't seen many of those classes, and there's a prerequisite for the patient/client to have already gone through and graduated from a full round of LSVT BIG. ... I am certified in both PWR and LSVT BIG as a clinician. I have a mobile therapy model and rarely use LSVT BIG because it's exhausting to me personally, and because most of my clients would struggle with the intensity due to age, anxiety, orthopedic concerns, etc. I plan to get certified as a PWR Moves Instructor, which is way more focused on building an exercise class. As a therapist, I highly value both PWR certification tracks. (I might also get a personal training cert.) Keep in mind that if you do mobile THERAPY visits, most of these folks have Medicare or a Medicare replacement plan with out of network benefits. Unless you only want to work with YOPD or only want to do exercise classes, I strongly recommend you examine the rules for Medicare billing. The Medicare Billing for (Mostly) Cash Based PT, OT, SLP Providers Group can help with that area."], "why_selected": "Matched keywords: courses, certifications, orthopedic, course, certification; Relevance score: 18.9"}
{"thread_id": "thread_1061600087944556", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1061600087944556/", "createdAt_iso": "2022-09-22T20:13:24Z", "metrics": {"reactionCount": 87, "shareCount": 0, "commentCount": 85}, "post_text": "c'mon APTA!! step up and protect our profession from this false advertising!!", "comments_text": ["I hate it to break it to ya, but the APTA doesn’t care. Vision 2020 was an absolute joke. They lied to an entire generation of PTs. Almost NOTHING was achieved. Lies and absolute deceit. I would love for all of us with DPT degrees to join forces and file a class action lawsuit against the APTA. These people should pay for the destruction they have done to an entire profession and the financial ruin they’ve left thousands of people in. I wouldn’t give two rusty nickels to the APTA. And before anyone tries to “school” me on the good the APTA does, just know this, there are thousands of DPTs who feel like me. Heck, there are thousands of PTs from all education levels that feel similar. Absolutely useless. I can’t even work in wound care anymore. Why? Because the APTA, once again, gave something within our scope to nurses. NOW, LPNs and RNs get ALL of the wound care jobs. Incredible. Save your gaslighting, virtue signaling, and “feel good” lecture for someone else. I’ve heard it all over the last 10 years. “Feel good” stories and fighting dry needling laws doesn’t pay bills and feed families. You want to actually DO something, here’s a start: 1. Fight for wound care. 2. Fight for increased reimbursements. 3. Fight to expand our scope. And NO, I’m not talking about stupid dry needling. I want MEANINGFUL scope expansion - we should be granted roles similar to NP or PA. I would give anything to go back in time. Now, at my age, and with the absurd debt I have from the useless DPT degree, I can’t afford in money or time, to pursue PA or NP. Join forces with the AMA and the national nursing associations to create a bridge program for DPT to NP or PA. We should be able to pursue other areas and fields within medicine. We should NOT be chained to rehab and orthopedics. 🤮 I am SO sick of being put in a box!! We should be able to do a 1-2 year residency alongside a PA or NP, in addition to minimal didactic work to fill in any gaps, to be qualified to sit for PA or NP boards. We NEED options! I believe in the power of movement as a first line of treatment for many conditions, but that is NOT the model for the American healthcare system. We need to figure out a way to work WITH and not against physicians, PAs, and nurses, or we will continue to be pushed aside until the profession folds. I’ve had this gripe for a decade and a lot of what I predicted is happening (sadly). For years I’ve talked about continuous decline in reimbursements. For years I’ve talked about decreasing scope of practice. It’s happening every day. Wake up!", "This is a private group so the APTA cannot view this"], "why_selected": "Matched keywords: dry, needling, orthopedic, dry needling; High engagement (257); Relevance score: 18.8"}
{"thread_id": "thread_1744878756283349", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1744878756283349/", "createdAt_iso": "2025-05-20T00:25:43Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 6}, "post_text": "What are some reputable courses for sports physical therapy?", "comments_text": ["I know TPI is well known in the golf community. I got my certification with the ITPA for tennis performance. I think most sports has some extra certifications you can use as continuing education credit. They accepted my CEUs from the ITPA. I would like to know more about sports specific ceus", "Institute of Clinical Excellence CMFA course"], "why_selected": "Matched keywords: courses, certifications, continuing education, sports, ceu; High engagement (12); Relevance score: 18.3"}
{"thread_id": "thread_1155104801927417", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1155104801927417/", "createdAt_iso": "2023-01-09T14:54:03Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 5}, "post_text": "HELP! I'm in Ohio for reference. I am going thru the practice act, but it is so unclear to me. I am a certified manual therapist and that is a big part of the way I practice. I'm still a bit confused as to my place in this therapy / wellness world. I have a fully cash practice, no insurance. If I see somebody and do any sort of manual therapy corrections of the spine or pelvis or anything like that does it automatically make it physical therapy instead of wellness? If so, do I need to have a plan of care in place in their chart? For wellness, I just do it \"as needed\". People seem to really like the flexibility of coming when they want and are using me effectively. However, I want to be in compliance with our state practice act, and have my malpractice insurance cover me. Generally, many of my wellness patients are one-time monthly. Since that is the case, doing a progress note every 30 days does not make sense. I'm doing more \"maintenance\" work. However, during those sessions, I often use manual therapy ( manipulation, joint mobs, soft tissue work, dry needling, etc.) to get them aligned so that they're exercises are more effective. Can someone speak to these things? Can I do whatever they need if they are paying for a service, or am I operating outside our practice act? If all I need is a plan of care, I can add that easily. If I have to send to Dr, I think it's a bigger deal just because I don't see individual patients with a high frequency. I'm more of a maintenance program.", "comments_text": ["If fully cash, why would you need notes at all or any sort of plan of care except as a reminder for you for the next session? No electronic record, no HIPPA. Assuming your malpractice is as a PT.", "I prefer to think of wellness as “could a personal trainer legally do this?” So I would not dry needle or manipulate a patient that I’m seeing for wellness. A massage therapist, those places that stretch people, etc. - those don’t require an MD Rx, providing exercise plan doesn’t require an Rx. So I would look more into what your practice act specifically puts under the term personal trainer and also what it says specifically about dry needling and manipulation."], "why_selected": "Matched keywords: dry, needling, dry needling, manual therapy, certified; High engagement (12); Relevance score: 18.3"}
{"thread_id": "thread_970320587072507", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/970320587072507/", "createdAt_iso": "2022-05-19T09:52:59Z", "metrics": {"reactionCount": 12, "shareCount": 0, "commentCount": 31}, "post_text": "For those who have started their own mobile and/or cash based business. Do you feel that there is a need for years of experience before doing so or is it more about just doing it? Sometimes I feel that if I am going to charge cash rates that I need to have a couple of extra skills like dry needling and/or manipulations so that I provide more than just the average PT. Or is it just providing that amazing customer service. What really is the thing?…", "comments_text": ["I remember a therapist telling me exactly this. “Work for 5 years. Develop your skills and make connections. Then go on your own.” Total BS. You can hire experience instead of waiting to gain it. In a cash model people aren’t buying the commodity of PT. They are buying “The Experience” not YOUR experience. Every year you spend not doing things that move you toward your goal is a year driving in the wrong direction.", "This is a great question 🙂 and I’m going to say what I think you need to hear, maybe not what you want to hear. I’ve got 3 thoughts that I think will be helpful: Most people will consider clinical skill, personal growth and finances, so let’s tackle them. 1. You need clinical mentorship, always. In a busy clinic sometimes you can’t actually get that anyway….sometimes you can. Just be honest about what you specialize in. The problem comes when I see someone say “I’m a chronic pain specialist “ or “I’m the ankle guy” When they haven’t taken any CEUs in that content. There is a difference between interest and mastery. With that said, I have 3 clinical mentors, 2 business mentors and my own business with a speciality in pelvic floor concerns and sexual wellness. I also offer mentorship in this arena. With either option, make your circle full of people that inspire you, it’s worth every penny. My meetings with my clinical mentors are by far my favorite day of the week. Truly understanding your clients and knowing how to help them is wayyy more valuable than any manipulation or dry needling course. People buy from you because you can give them a result, that’s the important stuff. 👏👏Again because this topic gets me fired up: People invest thousands of dollars and their time in life altering results , not any single modality. That’s where our gold is. 🙂 Your question made me pause because this ☝️is really important for everyone 🙂 I can sum up all my advice in that one sentence and will forever stand by it. Being able to say “I love helping this person get this result and I’m really fucking good at it” is a prerequisite to be successful imo. I’m curious, do you feel this way about a specific population? If you’re choosing between a first year job that offers clinical mentorship with someone you admire and your own business, I’d choose the mentorship. If you’re choosing a shitty factory job and your own business, I’d choose your business. 2. The other problem here is if you don’t know who you are clinically yet. Some people finish school thinking “I love acute care” and end up working in and loving pediatrics. It’s never a rush and I think giving yourself time to explore and try many jobs for a few years can be helpful if you aren’t sure about who your ideal client is. The beauty of having your own business is being able to help the people that you best serve and enjoy helping. I think it’s helpful to have an idea of who that is first and jumping around in this way is harder as a business owner. It’s helpful for you so that you love your business and life in the future. 🙂 3. Financial. Let’s not discredit this elephant in the room. My first few years working for someone else, I was miserable, thought about quitting daily and made $30-$35 an hour. Now I’m a business of 1, today I have 4 dream clients and I make $20-30k a month. Hearing those numbers, sounds super tempting especially if you owe massive amounts of student debt, as I did. My advice here is that, if you already know you are entrepreneurial. You will be successful and you will earn that income. It’s a matter of timing. It will happen, so it doesn’t have to happen today. Someone that says it does, might be trying to sell you something 🙂 Starting a business is a huge emotional investment, at least it has been for me. You will suprise yourself and be so much more successful than you ever dreamed. Give yourself the gift of the process. It’s a lot more fun when you have an idea of who you are clinically, what you LOVE to do and support in place. It will happen, so it doesn’t have to happen yesterday. 🙂 Hope this helps"], "why_selected": "Matched keywords: dry, needling, pelvic, ceu, dry needling; High engagement (74); Relevance score: 18.2"}
{"thread_id": "thread_1662333344537891", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1662333344537891/", "createdAt_iso": "2025-02-08T17:22:16Z", "metrics": {"reactionCount": 16, "shareCount": 0, "commentCount": 181}, "post_text": "Hi there! Are you a member of APTA? Why or why not? Thanks! (Full disclosure, I am on the MN APTA board and talking to national APTA to learn why people are not members and how APTA can support the independent PTs. I have always said APTA doesn’t bring value to people like us but I wanted to hear from you). Thanks!", "comments_text": ["Not any more. I had payed APTA dues and multiple section dues every year since I started PT school in 1997. I budgeted to pay over $1000 a year to APTA to cover state and national dues, Ortho section, Sports Section, Private Practice section, and Women’s Health section when my employers didn’t cover it. I attended numerous APTA annual conferences and CSM and paid for employees to attend those conferences too. I donated $$ to the Political Action Committee. I volunteered my time to serve on the House of Delegates in my state and assisted with State Chapter Task Force initiatives to fight to protect our ability to perform joint manipulation and dry needling. When I opened my own private practice in 2012 I paid in full for all my clinicians to have an APTA and state PT association membership and 1 section membership. This year I made the decision for the first time in 25+ years to cancel my APTA membership - their ongoing lack of support for those of us who are independent private practice clinicians and the true issues we are facing daily is utterly disappointing and I don’t feel hopeful it will improve. Over my career I have only seen and experienced; *increasing administrative & documentation burdens *Inadequate & declining reimbursement rates *flat lining of salaries for experienced clinicians not commiserate to their skill, training, advanced certification * reduced PT insurance benefits for beneficiaries *increasing productivity demands due to falling reimbursement and rising operational costs * plummeting morale from those of us that have been in our profession for any time working thru these challenges and burdens *lack of action from APTA to do anything about these PT mill clinics that unethically schedule/bill in clear violation of payer contracts", "There’s not much value…the “advocacy” has not been a priority. And because it has not been a priority,PT is becoming an unsustainable profession. How do you keep serving your community when business costs keep rising and reimbursements keep dropping? The amount of education, continuing education, time and volume needed to succeed are not reflected in the what you bring home at the end of the day and it’s almost like the APTA has never fully addressed this growing concern. And this is why so many of us have turned to cash based services which quite honestly makes the APTA largely irrelevant."], "why_selected": "Matched keywords: dry, needling, continuing education, idn, sports; High engagement (378); Relevance score: 18.0"}
{"thread_id": "thread_1252770732160823", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1252770732160823/", "createdAt_iso": "2023-06-01T01:25:57Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 2}, "post_text": "Are there any other continuing education providers in this group? *I'm an NCBTMB approved provider for LMTs. I have course outlines for 4 different approved courses, all more lecture and discussion style and not hands-on. *I'm reaching out to learn what others' experiences are with promoting CE courses or best ways to go about setting this up. All my classes are approved for in-person and LIVE virtual training.", "comments_text": ["I do the same for OTs. I am also LMT", "I do. Amanda Painter Diver and I also help folks get their courses CEU approved"], "why_selected": "Matched keywords: ceu, courses, continuing education, course; Relevance score: 17.8"}
{"thread_id": "thread_1594615154643044", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1594615154643044/", "createdAt_iso": "2024-11-07T13:03:09Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 11}, "post_text": "Just started my own cash based practice in Richmond, VA but still trying to figure out my niche as I find clients. I have a personal training background before becoming a PT and I work outpatient and SNF currently (both per diem). I’ve been thinking of taking some courses to specialize in something to set me apart. My two thoughts have been pelvic floor and TMJ. Anyone work specifically in these areas and have recommendations or input on con ed to get started?", "comments_text": ["My advice would be to only enter a specialty if you're passionate about it, not because you think it will get you clients. As a pelvic floor therapist, you have to be knowledgeable about pregnancy/postpartum/reproductive care, gastroenterology, urogynecology, menopause, etc. so one or two courses is not going to cut it, it's a lifetime of learning! That being said, we were all beginners at one point so if you are truly passionate, you'll want to start with Pelvic Health Level 1 through either the APTA or Herman & Wallace. But just know that it doesn't stop there and you will need to continue to take many, many courses to truly excel as a pelvic floor therapist as there's so much about this specialty we don't learn in school.", "Hi Jazlyn! Your personal training background can be a great way to set you apart! I agree with Rachel's recommendation to only enter a specialty if you're passionate about it."], "why_selected": "Matched keywords: courses, pelvic, course; High engagement (26); Relevance score: 17.6"}
{"thread_id": "thread_970529530384946", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/970529530384946/", "createdAt_iso": "2022-05-19T15:52:15Z", "metrics": {"reactionCount": 87, "shareCount": 0, "commentCount": 27}, "post_text": "2012. Review time. We all dread those meetings with our superiors. We are required to fill out forms answering questions about how WE think we have been performing. Then, we are asked about our goals over the next 6 months and 1 year. After 18 years of showing up to this rodeo, I knew that MY goals didn’t matter - unless they were to attend certain CEU courses, increase my units/visit charged, and to see more patients. How did I think I did? Well, I think I got a lot of people better, back to living their lives, and happy that they had me as a therapist. However, you tell me, Mr. Director. This review was probably like ones you have been through. And not unlike most others I had experienced. There was the discussion that if I added just three more exercises to the patient’s (ther-ex) program at least every other day, how it would positively impact my yearly bonus. Speaking of adding exercises, this would also help to get my average units/visit up. This would get me out of “last place” for the entire company. My director then requested that I start documenting each week as to why a patient did not attend treatments 3x/wk for that week. If a patient was discharged, give justification because everyone needed to be seen at a minimum of 15 visits. As far as documentation went, I needed to get my discharges done sooner. The response to my goals: “Well, I think those are some good goals.” Period. The final outcome: I wasn’t going to get my full 2% raise because of my shortcomings on the metrics. You know, the ones that had ZERO to do with patients improving, meeting THEIR goals (which they did). The goals which they expected us (me) to help them to achieve. No 2% raise because I focused too much on the patients. There were many straws during my last 5-6 years with the Establishment. This was the last one. However, what was I to do? I was done with the long hours. I was done with the endless paperwork. I was certainly done dealing with the insurance companies. But, what else was there for me as a therapist? Being a PT was all I knew. That was when a patient asked me if I would like to take over for a person who worked with residents in her community. This individual was moving out of state. She felt that I was the perfect fit. Without hesitation I said: “Heck YEAH!” Scared, nervous, anxious, worried, excited? Yep. All of the above. I didn’t know what I was doing. No one else was doing this sort of thing. But I did know one thing: I believed in me. Where did that decision take me? I was able to move out of a one bedroom apartment and into a house. This meant that my kids would now have their own bedrooms. (BTW, the demands of corporate healthcare were the catalyst to my divorce.) I was now able to save a little money each month. I took time off when I wanted. My clients didn’t mind. They supported my taking time to myself. I attended my kids’ school events. And I got to focus on what mattered the most about being a therapist - helping people to achieve THEIR goals. Now, I am blessed to work alongside my friends, Josh and Kevin, to help other clinicians break free from the corporate world, and to become uncaged in their own lives - personally and professionally. I know that making such a decision is probably the hardest one you will ever make; more so than choosing a partner or spouse. That is why at UNCAGED we walk with you step-by-step. We are the safety net beneath you until your wings are strong enough to carry you. Summer is around the corner. It’s a great time to learn how to spread those wings. The nerves are understandable. Let us help you sort those out. Click on the link in the comments below to schedule a chat with us and see if the UNCAGED PATHWAY is right for you!", "comments_text": ["This actually made me tear up a bit as it brings up so many emotions I can relate to when I was in the establishment… and now tears of joy in the freedom I feel working for myself! For anyone on the fence about the benefits of the uncaged program don’t hesitate! They have been fantastic for me and my journey! I can’t thank them enough for all the help and encouragement they have provided me!", "Love this SO much!!! ❤️ We will be forever grateful for your knowledge, support and guidance!!! So glad to see you have a coaching program now so more and more therapists experience this freedom!"], "why_selected": "Matched keywords: ceu, courses, idn, course; High engagement (141); Relevance score: 17.5"}
{"thread_id": "thread_1255149195256310", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1255149195256310/", "createdAt_iso": "2023-06-04T19:25:49Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 7}, "post_text": "How are you setting up your fees for dry needling sessions?", "comments_text": ["I am curious on this as well. I’m also curious what a decent dry needling fee is for most clinicians? I was thinking of having it as part of my normal session, but also offering as a separate “a la carte” offering for those that just want dry needling.", "As a cash based provider it’s just included in my session rate. I don’t charge extra the way I don’t charge extra for cupping gua Sha, visceral etc."], "why_selected": "Matched keywords: dry, needling, cupping, dry needling; High engagement (16); Relevance score: 17.4"}
{"thread_id": "thread_1811873819583842", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1811873819583842/", "createdAt_iso": "2025-08-09T21:48:56Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 6}, "post_text": "I was asked to be on the sideline for a local football team, during their games. I haven't the faintest Idea on what all I need to know or be able to do? Alongside would be an ortho surgeon who is the official \"Team Doc\" but he apparently sucks and isn't that great to work with. I know the head coach very well and he has been an old patient of mine who I helped avoid a surgery. He sends me a lot of his football guys. But I just want to know what all I need to know or be able to do? I just rcently started doing a lot of ultrasound and I'm in the process of getting my RMSK. So I showed him a lot of the ultrasound that we do and also a lot of the manual muscle testing/force plate eval's we can do and of course dry needling. My main goal was to establish communication with the athletic trainer and directly with the coaches as well in case they ever need to send me someone urgently, etc etc", "comments_text": ["I see this topic brought up a lot. In short - don't do it. I'm a DPT, OCS, SCS, and a host of other certs. Part of getting and maintaining the SCS involves venue coverage and an Emergency Response for Athletes cert. It takes training and preparation to be ready and qualified for venue coverage. If you haven't done the prep work, dont try to provide the venue coverage.", "Even if you have an idea of what to do, if you don't have the appropriate training, do not do it. You can be held liable in the event of an unfortunate incident. Message this fact to the coach and offer your urgent orthopedic care only and not on the sideline."], "why_selected": "Matched keywords: ocs, scs, dry, needling, orthopedic; High engagement (13); Relevance score: 17.3"}
{"thread_id": "thread_1367615204009708", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1367615204009708/", "createdAt_iso": "2023-12-05T16:05:51Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 4}, "post_text": "How would someone become a provider to offer continuing education credits to participants/students for a private company?", "comments_text": ["If you’re providing continuing education to therapists, you need to look up the requirements for each discipline on their state board website. There can be a lot of specific requirements to meet and paperwork on your background and they usually want your CV and often a sample certificate that you plan to issue to your students. You’ll also need a detailed itinerary of your course to submit. Each state and each board within a state have different requirements and fees to pay to become an approved provider for a course. Another option is to become an AOTA approved provider, which is more intensive a process, but then you wouldn’t have to apply through each state to provide your course to OTs, for example.", "It’s state by state dependent, and once you are initially credentialed for the one course, some states have further credentialing where all of your courses can be pre-approved (as a CEU provider) but there are generally a few more steps including all educator’s CVs and research that is used to teach etc"], "why_selected": "Matched keywords: ceu, courses, continuing education, course, certificate; Relevance score: 17.2"}
{"thread_id": "thread_1070536027050962", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1070536027050962/", "createdAt_iso": "2022-10-02T21:12:28Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 26}, "post_text": "Which accredited training programs deliver top notch Dry Needling education? I live in Appleton, Wi. Willing to travel for the best education.", "comments_text": ["AAMT. They provide Cochrane reviews of Cochrane reviews for their research. Great explanations of the physiology and their new books from the courses are awesome. I feel like I've had great outcomes the majority of the time.", "I’m interested in Integrative Dry Needling’s course but am interested in what responses you get."], "why_selected": "Matched keywords: courses, dry, needling, dry needling, course; High engagement (53); Relevance score: 17.0"}
{"thread_id": "thread_1225791681525395", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1225791681525395/", "createdAt_iso": "2023-04-20T15:13:26Z", "metrics": {"reactionCount": 106, "shareCount": 0, "commentCount": 120}, "post_text": "PSA - Something to think about when you are wanting to hire a therapist. I'm going to share this comment I made on a job posting on this page. I am not looking for a job, but I was reading the description thinking how it sounded like a great opportunity for someone. And then the last line. Masters or Doctorate degree required. My comment to him and something for you to think about if you are looking to hire a therapist: ------- \"This makes me sad to that you are looking only for Masters or Doctorate therapists. I saw a job posting for a company recently that was looking for a Masters \"or better.\" How extremely offensive to older therapists who went to school before PTs were required to be Masters/Doctorate level and so they have a \"just have a BS.\" You could have someone with years of experience with various certifications who could meet all of those other requirements and you aren't willing to even consider them? You think they aren't smart enough? Are you being \"ageist\" and thinking they are \"old\" and you assume they won't match your \"vibe.\" Actually, it doesn't make me sad. It makes me mad. How rude. And, yes, I \"just have a B.S.\" ------- This mindset is alienating to people who could maybe be the best employees you have ever had. I know some amazing therapists who only have a B.S. If you require a MPT or DPT, you have indicated a BSPT is not good enough for you. In that case, hopefully you have an abundance of Masters/Doctorate level therapists in your area and you won't have to end up settling for a BSPT (who is a Physical Therapist who graduated from an accredited school and passed a licensure exam just like you) as you apparently don't respect them. And who wants to be on a team when they are looked down upon as inferior because they are defined by their degree and not the experience they have to bring to the table? Yes, a nerve was touched this morning.", "comments_text": ["I graduated with BSPT 1999. Had to go back to tDPT for several reasons, one is for immigration purposes, second to keep up with newer graduates. Third, I needed the CEU and it counts towards your CEU requirements anyway. Why would a company hire a foreign trained short Filipino good looking guy versus a new younger US trained DPT. I had to compete, I had to be at par with the new graduates. They aren't just going to hire me because of my looks and physically fit body. Just kidding. 😁😁😁 Kidding aside, US immigration itself discriminates, they won't let us practice without having DPT degree now (or at least a master's level). So it's not just employers who do this. Immigration, even patients looks for the letter DR when they looks us up. With that being said, I prefer experienced therapists over new graduates, but we also have to give a chance to the younger up and coming new generation. They will be the future of this profession and need to be supported too. And as a clinic owner who hires DPTs, RPT, MsPT, PTA, OTR etc. I have a 60 something year old PT and a 26 year old new grad PTA. As long as you have the necessary license and appropriate fair salary expectations and know how to take care and treat my patients. Why not. Let's get you onboard. 😃😃😃 Good luck! And I am going to find the Michael Jackson meme with popcorn now. 😁😁😁", "I agree with your point. Let the interview tease out desired skill sets for the position. I know BSPT's that are very progressive, have stayed current with research and are some of the best in our field. I know some old tired lazy therapists too. I got my tDPT in 2013 because I knew agism and marginalization of BSPT's would happen. This MS or DPT only is in most job postings these day. Ageist for sure. What they miss is that people in our generation have an unparalleled work ethic!"], "why_selected": "Matched keywords: ceu, certifications, certification; High engagement (346); Relevance score: 16.9"}
{"thread_id": "thread_1171120380325859", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1171120380325859/", "createdAt_iso": "2023-01-30T19:09:36Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 21}, "post_text": "Any recommendations for CEUs you loved? I am transitioning into more sports rehab, but anything outpatient orthopedic that you loved would be appreciated!", "comments_text": ["If you are transitioning into the sports world I would recommend Champion Performance Specialist by Mike Reinold.", "Has anyone done the myofascial decompression courses? I have been looking at attending one and wanted to hear some feedback. I already do dry needling so would love to have more education and training with cupping"], "why_selected": "Matched keywords: courses, dry, needling, sports, ceu; High engagement (45); Relevance score: 16.9"}
{"thread_id": "thread_1308189553285607", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1308189553285607/", "createdAt_iso": "2023-08-29T19:57:36Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 8}, "post_text": "I have a patient with commercial BCBS, he just got evaluated by a PT somewhere else in town. But they don’t offer dry needling. He wanted to come see me and be evaluated and do dry needling. Is it simple where he can just come and start here? He wants to see if it helps and he may go back to the other place. So I wasn’t sure about him flip flopping. Is it same as Medicare where he can’t be going to 2 different places at the same time?", "comments_text": ["Good question..It's my understanding they can have multiple evals but not go back and forth . But dry needling isn't covered . So can he come back to you, pay cash for DN only ??", "As long as services are performed on different days, he can go to multiple clinics. We have several patients who go to us for neuro and other places for ortho or aquatic--hasn't been an issue"], "why_selected": "Matched keywords: dry, needling, dry needling; High engagement (19); Relevance score: 16.5"}
{"thread_id": "thread_1831179554319935", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1831179554319935/", "createdAt_iso": "2025-09-01T14:09:49Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 6}, "post_text": "I'm just starting up a mobile cash pay practice with dry needling and I have a connection for a tent at a local event. There will be over 40 vendors and none of them will be PT or health and wellness related. It's a pirate festival and I've been thinking a lot about swag, decorations, services offered at the event, and how to get people to want to come to my table and stand out. There will probably be some alcohol samples involved at some of the other tables. Any ideas would be very appreciated. It's a fun way to get my name out there in the community so looking to tap into the creative hive here! Thanks in advance!", "comments_text": ["Can you use a safer needle to pop balloons to win prizes? Like inside the balloon is a card that says what they win? (It will make noise and people will come over to see what’s going on, then they use needles which gets the conversation started….and take home a prize ideally with your branding on it!) 4imprint does things like reusable ice packs that you can out your branding on. They’re tiny and not the best but they aren’t super expensive and they look cool. (For prizes) or little hand sanitizers and out stickers with your branding on them….or lip balms And pirate eye patches with a sticker with your branding….if you did in fact mean that this is a pirate themed event and that wasn’t a typo! maybe a silly poster or two that says to use a needle to fight pain rather than a cannon….or after a day of sword fights pirates come to you for dry needling (or when on water they use cannons but on land they do dry needling for a play on words….) I don’t know, just have fun with it!", "Stand in front of your table, not behind it to get more interaction. Put your swag/give aways in a “pirate chest”. Wear an eye patch? Parrot (stuffed animal) on your shoulder? “DN can help fix the pain in your booty… and shoulder, back, neck”"], "why_selected": "Matched keywords: dry, needling, dry needling; High engagement (14); Relevance score: 16.4"}
{"thread_id": "thread_1787165112054713", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1787165112054713/", "createdAt_iso": "2025-07-11T10:19:49Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 6}, "post_text": "Seeking recommendations for a physical therapist in the Murfreesboro, TN area. A client of mine is moving to the 37129 zip code in a few weeks and is looking to continue his care with a provider who has a specific skill set. He is looking for a practice that specializes in: * A whole-body / holistic approach to care * Advanced manual therapy * Dry needling Any personal or professional recommendations would be greatly appreciated. Thank you!", "comments_text": ["I have a cash practice in Murfreesboro - Reform Physical Therapy and Wellness. I do dry needling and have my OCS, CSCS and take a whole body approach with all of my clients. I would be happy to send any more information if interested!", "Bump"], "why_selected": "Matched keywords: ocs, dry, needling, scs, dry needling; High engagement (12); Relevance score: 16.3"}
{"thread_id": "thread_1058522978252267", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1058522978252267/", "createdAt_iso": "2022-09-19T03:46:33Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 5}, "post_text": "I recently had a NP approach me about doing dry needling using a room in her building. It would be cash pay, strictly dry needling. What all do I need to get started?? Do I need an EMR, I already carry Insurance but it’s just basic HPSO (do I need anything else), consents (can I just make these myself)? Any direction/advice would be greatly appreciated!", "comments_text": ["Check your state practice act for what's needed to do dry needling. My state requires a form with specific wording/info."], "why_selected": "Matched keywords: dry, needling, dry needling; High engagement (12); Relevance score: 16.3"}
{"thread_id": "thread_1708921053212453", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1708921053212453/", "createdAt_iso": "2025-04-05T19:49:05Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 3}, "post_text": "Does anyone have any advice on continuing ed courses or ways to practice hearing a list of symptoms/performing special tests to give PT diagnosis? Been practicing in peds with developmental delays for 5 years and looking to transition back to ortho and am rusty. I’ve been reviewing all of my old notes from school, but am looking for something more skills based/functional movement analysis practice. Ideally I’d like to open my own practice working with gymnasts. Any advice would be appreciated", "comments_text": ["Institute of Clinical excellence is fantastic. Also Medbridge has good convenient courses online", "Join Medbridge and they have a ton of ortho online CEU courses."], "why_selected": "Matched keywords: ceu, courses, course; Relevance score: 16.2"}
{"thread_id": "thread_1411826449588583", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1411826449588583/", "createdAt_iso": "2024-02-13T00:03:45Z", "metrics": {"reactionCount": 7, "shareCount": 0, "commentCount": 30}, "post_text": "Hi, I am not currently working as a PT (focusing on growing my mountain bike coaching business with a side of strength and conditioning.) I'm worried about CON ED and maintaining my PT license- what do y'all suggest I do to make sure I am keeping up with the requirements? I do have a Medbridge subscription and was going to try to find some courses related to athletes. Any other ideas? Thanks!", "comments_text": ["HIGHLY RECOMMEND Joe's course!!!! It won't be a waste of time for you like other CEUs would be", "How many hours do I need and in which categories? Having a hard time finding this on the APTA CO website- I need 20 hours from educational coursework- so this can be 20 CEUs from something like Medbridge or Summit? Then what about the other 10 hours? If I remember correctly, we also need an ethics course? CPR counts for a certain number of CEUs? Thanks, never had to worry about this before when I worked in corporate clinics and was working towards a certification as well as mentoring students."], "why_selected": "Matched keywords: courses, ceu, course, certification, ceus; High engagement (67); Relevance score: 16.1"}
{"thread_id": "thread_1837944260310131", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1837944260310131/", "createdAt_iso": "2025-09-09T13:20:59Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 3}, "post_text": "The VA covered dry needling but they barely paid anything. Enough to barely cover the needles we used. We are in network with the VA so do we have to bill them the dry needling? Or can we just tell the patient we will not submit that and it will be self pay for the dry needling?", "comments_text": ["You have to check your contract. I’ve read in the past that if you are contracted with an insurance it is against the contract to make someone pay cash for covered services", "Yes, you have to bill the VA. You cannot charge them cash for covered services if you are in network with the VA."], "why_selected": "Matched keywords: dry, needling, dry needling; Relevance score: 16.1"}
{"thread_id": "thread_1664352997669259", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1664352997669259/", "createdAt_iso": "2025-02-11T14:33:05Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 4}, "post_text": "Good morning! I have a new patient who is with MC, but would like to come to my clinic for Dry Needling. None of the in-network clinics in our area offer this service, and I believe either way it is a non-covered service by MC. Any advice for how to go about providing her with this treatment, or any phrases that you use to CYA? I am assuming phrasing it as wellness and Dry Needling? So far I have no experience with \"wellness,\" but just calling things physical therapy. I know it's a fuzzy line that has been discussed here a lot. Thank you so much in advance!", "comments_text": ["For a while MC was covering acupuncture not sure if they are again/still are. I know it's not considered the same, but if they are on a budget. Some states DN is still grey or not covered with insurances. So the pt would be charged a fee for DN after a consent form was presented. More if they weren't already a patient. $30 vs $60. Adds up when they want multiples visits for the desired effect.", "Google an abn form. Fill it out with section d. Dry needling. Should be good to go."], "why_selected": "Matched keywords: dry, needling, dry needling; Relevance score: 16.1"}
{"thread_id": "thread_1488113558626538", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1488113558626538/", "createdAt_iso": "2024-06-10T13:21:19Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 4}, "post_text": "Has anyone’s anthem insurance covered dry needling? Not sure what to say when patients say their “insurance covers dry needling” We have yet to get reimbursed by anyone when I tried submitting in the past. And I just want to be like “that’s our self pay out of pocket price for dry needling. We do not submit insurance” They just don’t understand and keep annoying us about it.", "comments_text": ["Have them pay up front and state if their insurance ends up covering it, their payment will count towards their other sessions or be reimbursed", "You can tell them that you haven't seen that, but can try and bill their insurance, but if it isn't covered, then you will send them a bill."], "why_selected": "Matched keywords: dry, needling, dry needling; Relevance score: 16.1"}
{"thread_id": "thread_1816804619090762", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1816804619090762/", "createdAt_iso": "2025-08-15T15:12:28Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 18}, "post_text": "Hi! I’m no longer practicing as a physical therapist, but want to make sure I’m staying current with my CEU’s to keep my licensure active in case I ever need to fall back on PT. What’s the best source of CEU’s to stay fresh ? I used to do Medbridge.", "comments_text": ["Medbridge is still pretty good. They offer a variety of courses and now have live webinars. I've only done one webinar so far and it was really good. I've also done Summit, but they don't have enough courses in my specialty so I dropped it."], "why_selected": "Matched keywords: ceu, courses, course; High engagement (38); Relevance score: 15.8"}
{"thread_id": "thread_1120972365340661", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1120972365340661/", "createdAt_iso": "2022-11-30T15:34:44Z", "metrics": {"reactionCount": 19, "shareCount": 0, "commentCount": 26}, "post_text": "Alright all you Pilates peeps. I’ve always been a big yoga person but today I took my first Pilates class and WOW! Such important pieces of strengthening. And I was so so happy to see this class was mostly seniors which is my niche. I’m wondering if you all have ideas of where to find more info, YouTube channels, best certifications to look into for the future, etc! Central Texas if that makes a difference. This instructor told me about STOTT certification in Houston if it’s something I wanted to look into in the future, but I doubt I’ll end up wanting to be certified. Just looking to incorporate pieces into my PT sessions as I learn more.", "comments_text": ["I love the principles of Pilates and often incorporate certain pieces with my patients. My friend who is a PT is Polestar certified. I recall it being a pretty big time commitment for her and she had to go travel for a few weekends as part of her certification for the practical portion. I don't know if this helps much but there is a PT on IG Jill Koshak Johnson who has great content. She really speaks to the perimenopausal and menopausal female population but you can apply a lot of principles to everyone. I did reach out to her to ask about her certification she is Power Pilates trained, said they are more old school/classical pilates. She said Stott is also pretty popular but there are many options out there. One of the best courses I have taken is by APPI Pilates. It was geared toward Health Care practitioners and took 12 or 15 of the most basic Pilates moves and showed you how to modify them for a lower level population. Hope that helps a bit!", "For personal preference reasons, I am not overjoyed about it, but I am in the process of becoming Polestar certified, and I have to say if you're interested in Pilates for rehab, Polestar is the way to do it. Let me know if you've got questions."], "why_selected": "Matched keywords: courses, certifications, course, certification, certified; High engagement (71); Relevance score: 15.1"}
{"thread_id": "thread_1322428311861731", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1322428311861731/", "createdAt_iso": "2023-09-22T13:49:12Z", "metrics": {"reactionCount": 8, "shareCount": 0, "commentCount": 0}, "post_text": "We’re hiring for a Neuro PT in St. Petersburg/Tampa area if anyone has any info 🙂 Neubility Rehabilitation & Wellness is a non-traditional physical therapy and occupational therapy practice that aims to take neuro rehab to the next level through high intensity and innovative training. We provide both in home and in clinic sessions depending on the client’s needs and goals . 🧠Qualifications: - Compassionate, respectful, adaptable and dependable with excellent communication skills. - Hard-working with desire to further your skills to achieve clinical excellence. - Desire to treat in an evidence-based practice manner. - Experience working with neurological populations. - Licensed Physical Therapist in Florida. - CPR/BLS. 🧠 Preferred but not required One or more of these certifications: - Board-certified Specialist in Neurologic Physical Therapy. - Certified Vestibular Rehab Specialist. - Certified Stroke Rehab Specialist. - Parkinson's Wellness Recovery (PWR!) Specialist. - Certified Brain Injury Specialist 🧠 Benefits: - New Grads: We provide a structured formal mentorship program to be on track for taking the NCS exam! Partial reimbursement of the exam fee. - Annual Medbridge subscription for CEUs and partial to full reimbursement for other courses upon approval. - Flexible, set your own schedule to prioritize work/life balance. - PRN/part time with goal to grow into a full time management position upon performance. Send resume to: han@neubilityrehab.com", "comments_text": [], "why_selected": "Matched keywords: courses, certifications, vestibular, ceu, course; Relevance score: 15.1"}
