{"thread_id": "thread_1585115772259649", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1585115772259649/", "createdAt_iso": "2024-10-25T17:32:34Z", "metrics": {"reactionCount": 7, "shareCount": 0, "commentCount": 10}, "post_text": "I'm starting to think about a small price increase at the beginning of the year. I hate to do this because I know inflation is hitting everyone hard. January 2025 will be 2 years since I had my first price increase which was drastic because I set my initial prices too low. Now I really just need to account for inflation so I'm thinking $10-15/session. In 2023, I allowed all current clients to stay under the current pricing which was kind of a pain but worked itself out by March or so. My current eval price is $60 higher than my follow up rate. Hindsight I wouldn't have done this but it made more sense when I was selling packages and offered longer eval times. However, now that all sessions are 1 hour across the board, I'd like to go to one rate. My questions are: How do you determine by how much to increase? How would you narrow the gap between the follow up rate and eval? The extra money when I have more evals on my schedule is nice but from a financial planning and goal setting point, it makes more sense to me to have 1 price across the board. Would love to hear anyone else's thoughts/experiences.", "comments_text": ["I actually want to increase my eval prices so that they're more expensive than my sessions even though both are one hour long!", "I kind decided how much to increase by how horribly uncomfortable it made me to say it out loud, And then said Know your worth Queen And carried on"], "why_selected": "Matched keywords: pricing, packages, eval, follow, price; High engagement (27); Relevance score: 38.7"}
{"thread_id": "thread_1535403107230916", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1535403107230916/", "createdAt_iso": "2024-08-20T17:26:41Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 9}, "post_text": "I'm considering to raise my prices in a few weeks. I found most OON clinics near me providing pelvic floor PT are charging $225 for evaluations and follow ups vary based on packages. However the trend ice seen us $150 for a follow up. These are brick and mortar clinics. I'm a mobile PT and I charge significantly less and I'm embarrassed to say what it is 😂. Less than these follow up prices😭. I'm not completely sold on having packages as I feel it's hard to always give a number of treatments needed for one to get better. I'm wondering for those who raised prices after starting what did you charge before and after. What are some things to take into account? Was it hard to get patients in after the change in pricing?", "comments_text": ["I went from $150 to $250 for self pay mobile visits around Nashville. It’s been so much better. I have less financial stress, which leaves me able to give more emotional energy to my patients. Plus, the brick and mortar insurance-based PT practices around me charge around $500/session.", "Rather than packages, I offer a small “consistency discount.” If someone commits to seeing me 1x/week for 6 weeks minimum, I give them a 5% discount. It incentivizes people by having a small discount and it fills my schedule with more reliability than selling packages. 5% isn’t much of a discount but it always makes people happy 😃 and it’s not a burden to me financially."], "why_selected": "Matched keywords: pricing, packages, follow, charge, price; High engagement (20); Relevance score: 38.5"}
{"thread_id": "thread_1470953210342573", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1470953210342573/", "createdAt_iso": "2024-05-15T16:27:30Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 1}, "post_text": "Hi! I wanted to hear what others have done in this situation or suggestions on how to go about it. I’m increasing my follow up rates but just for all my new patients moving forward. I’m cash based but provide superbills with an itemized breakdown of each code to most of my patients. I currently use Jane so I have my follow ups set to a certain rate - and then add codes to equal the “total.” If I’m only increasing rates for new people, do I set all follow ups to the new rate including the billing codes, and add a $5 deduction to my old clients? Or do I have two different sets of billing code prices and use the “correct ones” for each patient to add up to my different rates? I just wanted to make it simple changing it slowly and not impacting my current clients but just wanted to hear how people have done this on Jane or with billing codes. I only expect it to be an 8 to 10 week transition due to my current plan of care times. Thanks!!", "comments_text": ["Things to keep in mind: - all patients must be billed equally, you only have 1 charge sheet. This does not change depending on how someone can pay (insurance vs non-insurance) - in general, all charges and possible discounts must be available to all patients equally, providing they meet the guidelines (my assumption here is that \"former patient\" status would be considered an arbitrary guideline based on legal aspects, but IANAL) - discounts after the fact can be applied depending on circumstances, as long as legal guidelines are followed (such as a documented financial hardship form) - if someone pre-paid for services before the price change went into effect, those would be grandfathered in (to the best of my knowledge, again, IANAL, just very interested in safeguarding my own practice). There are patient safeguards and license requirements that disallow the charge for a service to be different for patients based on arbitrary guidelines (like old vs new patients). Grandfathering may be nice, but you'd want to consult actual legal advice based on your local laws in conjunction with national laws to make sure you're not putting yourself in a legally compromised position. In reality, when I raised my cash pay rates $25 for an hour of service I gave my current patients 2 months notice and let them know that in trying to balance a reasonable cost vs service vs keeping the doors open, that's where the numbers ended up. I had zero cancellations from those conversations because I let them know in advance and discussed the legal restrictions I have in regards to having a single charge master."], "why_selected": "Matched keywords: follow, charge, price, rate, cash based; Relevance score: 31.8"}
{"thread_id": "thread_1355967938507768", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1355967938507768/", "createdAt_iso": "2023-11-16T00:30:42Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 12}, "post_text": "Hello everyone, I have a few questions where I am stuck currently. Sorry for the long post. I started my business as a side hustle and planning to go all in next year. I started with my price being below average according to other practitioners. I am cash based/out of network concierge PT. 1. I want to increase my pricing starting January, with travel time, one on one hour, I do not think it is sustainable long term with the current pricing I have. Does any one have a letter format or any templates they use to send it to the clients? If I have new clients, do I tell them the new price from January, how to go forward with this? 2. I have started offering pelvic floor PT services and added that as a specialty. I have different pricing for pelvic floor patients as compared to non pelvic floor clients. I am not very sure if I should keep the pricing different or same for pelvic floor clients, if it’s higher, should I increase the time that I treat the pelvic floor patients for? Do any of you have different pricing for things you treat or do you keep it all the same. Any guidance or help here would be greatly appreciated. Thank you !", "comments_text": ["I charge the same rate for everything that I do from physical therapy to a wellness visit. This was good advice given to me a while back. The reasoning is that if you start seeing someone for wellness and charging them one rate and then they tweak their knee and they need you to take care of that, then it’s difficult to adjust the rate. So i suggest you just stick to one rate for your time…Period. As for your current clients, you could grandfather them in at their current rate, or slightly increased rate, if you’d like. However, if they take a hiatus from you for any reason, then I would suggest that they return at the current rate.", "You also have the option of grandfathering in current clients. If it's only a side hustle and you don't have a full caseload but want to honor and keep current loyal clients, you can raise your price point for new patients but keep your price point for current patients. Some of our clinicians have done this. I did it for a couple long standing patients that I had been seeing for a long time."], "why_selected": "Matched keywords: pricing, charge, price, rate, cash based; High engagement (26); Relevance score: 29.6"}
{"thread_id": "thread_1466144294156798", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1466144294156798/", "createdAt_iso": "2024-05-08T11:42:26Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 10}, "post_text": "I've been seeing a lot about personalized POC vs Packages. I've done packages in the past and honestly don't really like them. Would someone explain what they're including in a Personal POC beyond 2x6 or something. Thx", "comments_text": ["I always suggest a program versus packages — and it’s not just semantics. Packages are a bunch of sessions bundled together. A program has a start and finish, like an Eval +5 expanded treatment sessions. The client pays in full or possibly splits payments into two but the incentive for buying the program is not to save money Instead it’s because that’s the way they will receive the best care and clinical outcome. ￼", "I felt the same and looked back at what I had done with clients in a personalized POC before. I tend to see people 4-12 times so I made packages for 4, 8 and 12 sessions and recommend which package they get at eval. If they pay in full then they get a discount."], "why_selected": "Matched keywords: packages, eval, package; High engagement (23); Relevance score: 28.6"}
{"thread_id": "thread_1461217894649438", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1461217894649438/", "createdAt_iso": "2024-05-01T00:30:43Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 0}, "post_text": "Question about super bills and travel fee: I have a cash pay client that has switched to an insurance where he’ll likely be able to get out of network reimbursement. My super bills have always reflected my cash cash pay rate… however, I normally charge him a travel fee. My assumption is that this won’t be reimbursed if I keep my same pricing and list a travel fee. Do I… 1. Increase my per unit pricing so the total is the same as I would regularly receive? As I write this it seems unethical to change? However, the per unit amount is significantly lower than what would be billed at an outpatient clinic and as clinics have different negotiated rates this seems acceptable? 2. Keep pricing on my super bill the same and charge him the travel fee separately 3. Increase my pricing in general and offer those close by a discount. The only reason I bring up option 3 is if pricing changes draw any flags if another client has the same insurance and their super bill reflects cheaper per unit costs. Most my clients are wellness based so I generally offer them or have as much experience with it. Thank you in advance!", "comments_text": [], "why_selected": "Matched keywords: pricing, charge, rate, fee, cost; Relevance score: 28.3"}
{"thread_id": "thread_1924779388293284", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1924779388293284/", "createdAt_iso": "2025-12-17T19:36:31Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 30}, "post_text": "Has anyone gone from cash-based to in-network? I love my clinic and what we do… but since I hired another therapist I can’t get enough clientele to make overhead. But then if I switch I feel like I’m going to end up like every other mill in my town and I refuse to do that. But I know others in here do insurance…. I saw my bosses in my old jobs rolling in dough while I was barely make ends meet…. How does insurance reimburse these days? I have someone trying to convince me to be a multi-specialty clinic because it reimburses more… is that true? Has anyone done this?", "comments_text": ["I see this a lot, so I’ll be direct but hopefully helpful. Most of the time the issue isn’t cash vs insurance. It’s that cash practices expect being cash + good clinical care to magically solve hiring and filling schedules. That works when you’re solo. It breaks the second you hire. When you were alone, you had low overhead and lots of time. You could network, run workshops, meet people, hustle. Your hire is not going to do that at the same level, and they shouldn’t be expected to. At that point, you need real systems. Cash pay clinics that scale well all have a few things in place: • Strong sales skills from the first phone call through the eval • Clear package presentation (you have to sell packages) • Continuity options so people don’t disappear once pain improves • An intentional marketing channel that doesn’t rely on the owner’s time On the insurance side, one thing I saw in the comments stood out. If BCBS reimburses better than your cash rates, that’s a pricing issue. Your cash rates are too low. I totally get wanting to help more people, but once you charge anything above $0, you’re already excluding someone. So you might as well price in a way that lets you run a sustainable business, pay staff well, and not burn out. Don’t pick prices everyone can afford. Pick prices that support the business and the life you want. Multi-specialty can reimburse more, but it also adds complexity and doesn’t fix weak sales or marketing. Plenty of multi-specialty clinics still struggle for the same reasons. Before jumping in-network, I’d fix sales, marketing, packaging, and pricing first. Cash pay can work very well, but only when it’s run intentionally.", "in what part of the country are you located? In network benefits (BCBS) vary a lot depending on location."], "why_selected": "Matched keywords: pricing, packages, eval, charge, price; High engagement (64); Relevance score: 27.1"}
{"thread_id": "thread_1769584730479418", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1769584730479418/", "createdAt_iso": "2025-06-19T21:32:52Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 18}, "post_text": "Is anyone willing to share their single visit rate vs package rate and how they went about deciding if packages were a good idea? Currently I don’t offer packages but considering it as a way to offer a more affordable option to those who need it. Thank you!", "comments_text": ["I did primarily packages for about a year and now have switched to $150/session. Honestly has just been better all around with everyone paying the same rate and losing less in discounts all over the place. I do offer paid in full options for anyone who wants nothing to do with Superbills/insurance and just wants to pay in full for 12 sessions. Those are 10% off but I rarely use those now", "The rates people are sharing will fluctuate depending on location, specialty, and if mobile/concierge. Consider a sales tactic called price anchoring where you have a significantly higher single session rate and packages that seem like a great discount. This pushes people to get the package, which leads to more money upfront and commitment from the patient's end to complete the POC. Individual sessions can lead to drop off/no show when the patient stops seeing the value or if there isnt an immediate change"], "why_selected": "Matched keywords: packages, price, package, rate, rates; High engagement (39); Relevance score: 26.8"}
{"thread_id": "thread_990879208349978", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/990879208349978/", "createdAt_iso": "2022-06-17T19:19:48Z", "metrics": {"reactionCount": 172, "shareCount": 0, "commentCount": 22}, "post_text": "Getting the practice going has been extremely stressful, but I just got one hell of a motivator from my first reimbursement from BCBS-UT. They paid me $241 for 1 eval of 5 units, 1 untimed eval code + 4 timed codes of about 10 min each. They are one of the highest payors in UT so I understand all insurances won’t be like that and evals pay a lot more, but even at the SNF I only make $47/hr or $35/hr OP Ortho PP. Even after taxes, overhead costs, and paying out 6% to a billing company that is substantially more per hour, and I get to treat in the setting I want to be in with the types of patients I want to treat. I’m also going to be pushing the cash pay side hard as well which doesn’t require me to pay out to a billing company so my per hour reimbursement will be higher there. If I needed a sign that I’m making the right decision to go out on my own I just got one. That got me fired up! 🔥 #LetsGo #DreamBig", "comments_text": ["Brian Collins, how do you learn which insurance companies use CMS 8 minute rule vs. SPM rule of 8's? I've spent hours on BCBS & CIGNAs website trying to find out their policy.", "That’s awesome but just for everyone to be aware that Blue Cross Blue Shield has different reimbursement rates in the different states. For us Blue Cross Blue Shield has awesome reimbursement rates in one state we are in and horrible in the next.￼"], "why_selected": "Matched keywords: eval, /hr, per hour, rate, billing; High engagement (216); Relevance score: 26.7"}
{"thread_id": "thread_1109843166453581", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1109843166453581/", "createdAt_iso": "2022-11-16T15:29:16Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 10}, "post_text": "I’m trying to get an idea of pricing structures for my cash-based mobile business. Mostly I will be offering services out of my jiu jitsu gym for our athletes. The gym owner is requiring a 30% cut which is not ideal but it’s what he is already charging other professionals to use the facilities so I can’t negotiate it. I train at a “bougie gym” in a relatively affluent area (Cary, NC). I am dry needling certified and considering offering DN only packages in addition to traditional PT POC. In looking at other cash-based practices in our region I could charge anywhere from $75-225 for an eval and given that 60% of that will go to the gym owner and taxes, I’m probably going to have to go toward the higher end of that to make it worth my while. But I am unsure how to price follow ups and DN/manual therapy only packages. Someone has mentioned to me charging by the minute or by CPT code but again, not sure how to price that and make it viable for me. This is a side gig for now but I’m hoping to grow it. Any suggestions? What has worked for you all?", "comments_text": ["I believe, depending on various state practice acts, you are protected against giving away a percentage of your income. For instance, when creating a rental agreement, you may be able to negotiate a fixed price (per hour, treatment session, whatever) rather than a percentage so if you change your rates based on demand, experience, etc the person renting to you is not further “profiting” off your degree & license. I would highly reconsider… I was in a similar situation with someone renting to me for a percentage but have switched locations where I now pay an hourly rent for the space and it’s a much smoother deal.", "I would find a different place. If you are training at the gym and you already have rapport with people they will definitely come see you whether you are in the gym or not. 30-40% is not sustainable."], "why_selected": "Matched keywords: pricing, packages, eval, follow, per hour; High engagement (20); Relevance score: 26.5"}
{"thread_id": "thread_1258533348251228", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1258533348251228/", "createdAt_iso": "2023-06-09T19:00:32Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 3}, "post_text": "Trying to understand simple logistics. If you're an OON provider- do you come up with your price (ie for eval). If the patient agrees, they pay you the eval price up front (ie: $100). After treatment, you provide a superbill which the patient provides to his/her insurance. Depending on their plan coverage the insurance company then reimburses them. This could be nothing or what ever we charged via super bill? Also, the superbill amount can be more or less than what you charged the patient (ie: $100)? Next as an OON provider- credentialing you or your business isn't needed? Also checks of benefits? Do any of you guys do that or leave it up to your patients? Lastly, what kind of notes do you keep on hand as an OON? Similar to those as in network? Thanks for reading and answering my questions. Trying to understand the game a lil better 🤣", "comments_text": ["the superbill can not be more than you charged the patient. if they had reached their out of pocket max, the insurance company would refund all of it. (as long as charges are reasonable and customary) charging more on your superbill than what u charged thebpatient, esp. in this scenario, would constitute insurance fraud. second point, documentarion is a state board requirement. whether u are in or OON.(assuming care is skilled)..board requirementsdo not change for skilled care", "I have my rates for all CPTs codes. So for an eval I charge $250 and the patient pays that at the time of service. I provide a superbill with the code, rate, what the patient paid. Then patient submits that to their insurance. If they have an OON Deductible it will get applied to that. Once that is met the insurance will reimburse them based on their fee schedule. Let’s say the insurance fee schedule for 97163 is $150. Each visit only $150 is applied to the deductible (even though the patient is paying me $250). Once met the patient has a 30% coinsurance. Insurance will reimburse the patient 70% of $150, so the total cost for the patient is 30% of $150 PLUS the $100 difference between the fee schedules. As the ONN provider is doesn’t matter because they already paid you $250. They should expect to only be reimbursed $105 (70% of $150) once deductible is met. I have the patient contact their insurance to ask about their ONN benefits. I tried to do it and they would always give me the wrong info so I stopped. If you tell patients you will give them a superbill for possible reimbursement you should make sure your documentation is detailed enough for insurances. Because they may require the patient to submit documentation. Also some plans require you to get prior auth even as OON. You don’t have to but then the patient won’t be reimbursed. Again I have the patient find all of that out first. I will also give the patient a W9 form to submit with the superbill if I’ve never had a patient with their insurance in the past."], "why_selected": "Matched keywords: eval, charge, price, rate, out of pocket; Relevance score: 26.0"}
{"thread_id": "thread_1555373535233873", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1555373535233873/", "createdAt_iso": "2024-09-17T20:47:11Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 23}, "post_text": "Hi everyone - asking a bit of broad question, but I definitely need input. I've been approached to provide PT services for a local home hospice company as an Independent Contractor, and I am interested. They've asked me to send them my rates - including for evaluations, follow-ups, and mileage. I've been a PT (DPT) for 11 years, 6 of which I spent working for a home health and hospice company. I also own an LLC providing mobile/concierge pelvic health privately, so the only comparison I have so far is what I charge for that, which is $145 for 90-minute evaluations and $95 for 60-minute follow ups. The home health co I PRN for pays $110 for a SOC (which I wouldn't do in this hospice setting), $70 for evals, and $60 for follow ups, and I live in South Mississippi. Thanks in advance!", "comments_text": ["I would tell them your rates are higher and then begin negotiations. Will you be a 1099 or are you billing them ?", "I don’t think that your rates are outrageous. Further, I don’t think that they are out of the ballpark. It would seem that the worst thing that could happen is they would want to negotiate. “Here are my rates for the clients I’m serving in this area presently:” If you were going to offer them any sort of discount (if they ask) you might consider it just because you wouldn’t have to necessarily work as hard for the referrals? I don’t think it’s necessary, though."], "why_selected": "Matched keywords: follow, charge, rate, evaluation, billing; High engagement (50); Relevance score: 26.0"}
{"thread_id": "thread_1361253467979215", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1361253467979215/", "createdAt_iso": "2023-11-24T21:58:45Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 18}, "post_text": "What’s the going rate for cash based pelvic PT in Los Angeles? Someone I know is being charged $250 per visit. Is that reasonable?", "comments_text": ["The only person who can deem it reasonable or not is the patient/client. Does he/she feel that what they are receiving is worth the rate they're paying? Because we all value things differently, and see that value from different points of view. My rates are well above the rates of anyone else in my area. But every one of my clients are convinced that what they receive is well worth every penny they spent. Does the fact that my rates are higher than anyone else around me mean that my rates are unreasonable? People who choose not to work with me probably think so. People who do choose to work with me often feel I am undervaluing my services. The eye of the beholder is a powerful thing.", "That’s within average rates for pelvic PTs in this area. But I also think this post has an undertone of judgment about someone else’s rates. As Joe said above, the only person who can deem it reasonable is the patient/client. If they feel the service is valuable at that rate, they will pay it. If they don’t, they won’t. There’s room in the market for different levels of service priced at different rates."], "why_selected": "Matched keywords: charge, price, rate, per visit, fee; High engagement (40); Relevance score: 25.9"}
{"thread_id": "thread_1000220237415875", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1000220237415875/", "createdAt_iso": "2022-06-30T17:49:17Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 15}, "post_text": "Hi everyone. I am about to become a private practice cash based owner. Having some difficulty setting rates for PT service. Can anyone suggest rates for IE and follow up visits?? Package rate and what a package may consist of?? Live in Savannah. Ga Thanks.", "comments_text": ["Hi Lisa, we spoke earlier 😊 we are also in GA. My husband was doing $150 eval and $120 per visit but changing to $150 for all visits now. We tried packages but it didn’t work as great as per visit since we work with older population and often they have changes in their conditions, required hospitalizations for other reasons, etc. I hope it helps 😊", "I strongly encourage you to reverse engineer your rates. How much do you want to gross per year? Divide that by 48 weeks, then by how many treatment hours you want to complete per week, and you'll have your per session anchor."], "why_selected": "Matched keywords: packages, eval, follow, package, rate; High engagement (31); Relevance score: 25.7"}
{"thread_id": "thread_1333482557422973", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1333482557422973/", "createdAt_iso": "2023-10-10T13:32:18Z", "metrics": {"reactionCount": 12, "shareCount": 0, "commentCount": 21}, "post_text": "Need some thoughts on an opportunity. I currently treat both MCR and cash pts with my fully mobile practice . I charge $150/visit. I was approached by a local country club with a large membership. They would like me to treat their members at the club. They would take 20% of monies. I told them $175/ visit (the idea is to recoup the 20%). I would be there for maybe 4-5 hrs at a clip. Am I being greedy to ask for the $175/visit? Thoughts on $175 for eval and then $150 return visits? Thanks, everyone!!!", "comments_text": ["Someone in a pelvic floor group I follow put it this way: “I just paid $200 to have a clown at my kids bday party for an hour”. Consider that when setting your rates.", "I’ve actually have done this in the past. Worked well but the must earn their 20% , I believe it was 20% for me as well 1. You cannot treat Medicare there unless you get that site blessed by Medicare 2. The country club better have all the equipment you need to effectively do your job 3. The country club likely will be handling all the money up front ie drawing from their members accounts on a monthly basis So you need to ensure your books are accurate so they pay you correctly 4. The country club should assist you on scheduling their members with their front desk/spa staff. 5. They should also market on your behalf as 20% of 10 clients vs 100 clients is much more advantageous to them. 6 your rates seem low but all of that is area dependent, and what you are comfortable charging. We aee 275 eval 175 follow up 350 ultrasound diagnostics. Commonly an eval will pull in $625 in an hour and the members love it."], "why_selected": "Matched keywords: membership, eval, follow, charge, rate; High engagement (54); Relevance score: 25.0"}
{"thread_id": "thread_1593560618081831", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1593560618081831/", "createdAt_iso": "2024-11-06T01:49:59Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 7}, "post_text": "I have an independent contractor who will be doing home visits only. I've incorporated an increased rate per hour to reflect the travel charge. She will get a percentage of what is charged. Obviously her price per unit or charge code is higher than mine in clinic. Can I ethically do that or do I need to charge the same, and then add a travel fee? I offer people superbills, is it unethical to charge more per unit (technically) bc of it's in the home or does that matter? Hope this is clear, thank you!", "comments_text": ["So, if Medicare, you cannot charge a travel fee. If private pay, I'd bake a travel fee into my session cost say In clinic is $x/hr In home is $x+20/hr For superbills, you could have your fee schedule set for the more expensive rate, and give a facility discount for those in clinic. I know \"time of service\" discounts are often used for cash rates that are lower than insurance billed rates.", "If she's a 1099, she can write off the mileage herself on her taxes, so I would stick with a higher percentage of net. For example, if MCR reimburses $100 for a daily visit you could pay her $65-70/visit. Obviously, you need to cover all your expenses. But, once those are covered, then you can decide how aggressive you want to do it. I think Luna pays $65-70/visit (1099) in my area. I would also make sure she is educated on the differences in reimbursements for the various codes so she can charge appropriately. Let her see how those differences affect the bottom line, and ultimately her bottom line."], "why_selected": "Matched keywords: /hr, per hour, charge, price, rate; High engagement (16); Relevance score: 24.4"}
{"thread_id": "thread_1351466102291285", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1351466102291285/", "createdAt_iso": "2023-11-08T11:00:39Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 4}, "post_text": "Hellonote users- When you are doing a re-certification and are planning to bill a re-eval do you use the \"re=certification\" note type and just bill part of it as a re-eval; or do you use the \"re-evaluation\" note type?? Thanks in advance! Cross posted.", "comments_text": ["Hey friend! So if you are doing a re-cert to extend the plan of care past the original expiration date (because I'm assuming they are making progress), then you do not bill for a re-evaluation. You can bill for ther act or self care or whatever you think the session would fall under. A re-eval should only be billed if you are re-doing the whole plan of care because there has been a significant change in status, such as a new diagnosis or a hospitalization for something. Re-eval charges are hardly ever billed. Hope that makes sense!", "I've always done recertification note then billed for whatever I did. I guess depends why you're doing a re-eval. But the recert should work. Idk what the re-eval note type looks like as I've never used it"], "why_selected": "Matched keywords: eval, charge, evaluation; Relevance score: 24.1"}
{"thread_id": "thread_1662333344537891", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1662333344537891/", "createdAt_iso": "2025-02-08T17:22:16Z", "metrics": {"reactionCount": 16, "shareCount": 0, "commentCount": 181}, "post_text": "Hi there! Are you a member of APTA? Why or why not? Thanks! (Full disclosure, I am on the MN APTA board and talking to national APTA to learn why people are not members and how APTA can support the independent PTs. I have always said APTA doesn’t bring value to people like us but I wanted to hear from you). Thanks!", "comments_text": ["Not any more. I had payed APTA dues and multiple section dues every year since I started PT school in 1997. I budgeted to pay over $1000 a year to APTA to cover state and national dues, Ortho section, Sports Section, Private Practice section, and Women’s Health section when my employers didn’t cover it. I attended numerous APTA annual conferences and CSM and paid for employees to attend those conferences too. I donated $$ to the Political Action Committee. I volunteered my time to serve on the House of Delegates in my state and assisted with State Chapter Task Force initiatives to fight to protect our ability to perform joint manipulation and dry needling. When I opened my own private practice in 2012 I paid in full for all my clinicians to have an APTA and state PT association membership and 1 section membership. This year I made the decision for the first time in 25+ years to cancel my APTA membership - their ongoing lack of support for those of us who are independent private practice clinicians and the true issues we are facing daily is utterly disappointing and I don’t feel hopeful it will improve. Over my career I have only seen and experienced; *increasing administrative & documentation burdens *Inadequate & declining reimbursement rates *flat lining of salaries for experienced clinicians not commiserate to their skill, training, advanced certification * reduced PT insurance benefits for beneficiaries *increasing productivity demands due to falling reimbursement and rising operational costs * plummeting morale from those of us that have been in our profession for any time working thru these challenges and burdens *lack of action from APTA to do anything about these PT mill clinics that unethically schedule/bill in clear violation of payer contracts", "There’s not much value…the “advocacy” has not been a priority. And because it has not been a priority,PT is becoming an unsustainable profession. How do you keep serving your community when business costs keep rising and reimbursements keep dropping? The amount of education, continuing education, time and volume needed to succeed are not reflected in the what you bring home at the end of the day and it’s almost like the APTA has never fully addressed this growing concern. And this is why so many of us have turned to cash based services which quite honestly makes the APTA largely irrelevant."], "why_selected": "Matched keywords: membership, rate, fee, cash based, cost; High engagement (378); Relevance score: 24.0"}
{"thread_id": "thread_1794678651303359", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1794678651303359/", "createdAt_iso": "2025-07-20T16:12:03Z", "metrics": {"reactionCount": 8, "shareCount": 0, "commentCount": 20}, "post_text": "Hi all, I am in the process of starting a concierge cash mobile PT business. I know pricing on visits is a common question and I keep going back and forth on what to charge. My plan is to offer packages with the main one being basically unlimited visits until they meet their goals for $5000. Obviously there is going to be some stipulations for that to avoid people taking advantage. Otherwise, the goal will be to charge about $285 a visit. I am located in the Prescott/Prescott Valley area in Arizona. Looking for thoughts and opinions on this and what other mobile cash PTs have charged.", "comments_text": ["We are hybrid so I have two styles Cash only I’ve done this. We do 10k for the year. Unlimited treatment plans 2k per month unlimited or 5500 for 3 months. For say like ACL R or TKA type thing. Also have an annual membership for the insurance side 1500/year annual wellness stuff plus discounts on cash services 4500/year basically large discounts on cash services. Fitness. Exercise programming nutrition shockwaves ultrasound imaging etc We do have a B&M so that helps with more services to offer vs just the mobile providers. To add. We’ve never had a single membership person overuse their membership. They actually understood the value and probably used it much less than say your typical insurance patient who expects the moon", "Love seeing you building a concierge PT model that puts patients first! Curious what specific stipulations you’re including to protect your time with the $5K unlimited package. Also, what are other mobile cash PTs in the area charging per hour?"], "why_selected": "Matched keywords: pricing, packages, membership, per hour, charge; High engagement (48); Relevance score: 22.9"}
{"thread_id": "thread_1197601734344390", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1197601734344390/", "createdAt_iso": "2023-03-26T13:31:58Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 22}, "post_text": "So made a few calls for a billing company and I'm truly feeling overwhelmed. - company 1: charged for everything- credentialing, contracting with insurances, benefit checks and billing. Everyone of those above categories had a fee of at least $200 or percentage of 6.5% to 7% depending on what they would be doing for me and how much I made monthly. I know this is standard but I legit felt ky hair falling off with how much I'd be paying them to work for me. - company 2 sounds to good to be true. They charge based on how much I make monthly. This includes benefit checks and billing. Adding to this if I make under a certain amount every month they collect nothing. So in other words, they'd work for free? They are also willing to do some upfront with as well such as finding out what insurances maybe best suited to take if any at no cost. Credentialing and contracting would be a different price based on how many insurances I'd like to take. But I just can't understand why they'd work so hard for me if I make less than a particular amount which going in, I know I will based on how many patient visits I'd like to start with. Is this truly to good? While I'd like to ideally have billing done in house down the road, at this moment I'm just feeling like I understand nothing of how to run a business. What are some things you took into consideration when hiring a billing company? Are there billing companies you can recommend as well. I'd like to compare a few more. I know I can't be the only one that feels lost 😅", "comments_text": ["Are you just now starting your business as a solo provider? If so, I highly recommend learning how to bill yourself initially until you have a caseload to justify someone else doing it. Also, once you understand it yourself, then you will know if the billing company is actually doing what you need them to do. If you have an EMR that does integrated billing it’s actually fairly simple once it’s set up. I do my own billing for me and my 2 PTs with no problem using HENO.", "I agree with this. Also depending on your insurances accepted/patient volume it is very simple to verify benefits as well. It takes me about 1 minute to verify BCBS benefits."], "why_selected": "Matched keywords: charge, price, rate, how much, fee; High engagement (47); Relevance score: 22.9"}
{"thread_id": "thread_1284674722303757", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1284674722303757/", "createdAt_iso": "2023-07-20T15:38:38Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 15}, "post_text": "Superbill question. I'm a PT working in home with infants, fully OON. I charge a flat rate regardless of session length. I use Jane and don't have many families wanting superbills, but when I do I had initially been inputting codes without itemized costs and it generally worked. Now I have my second case asking for itemized cost by code. My visits are most often around an hour so I just divided my flat rate that way and it worked for the previous baby that always worked out to 4 units, but this baby's visits have fluctuated more, so I'm not sure what I'm supposed to do. If I say it's 31.25 per unit that works for most sessions but there have been some with only 2 or 3 units but I still charged 125... so there is a gap. Doesn't seem correct to keep changing the itemized code cost. I keep seeing people say to use prompt pay discount to arrive at their flat rate fee, but that would require me to falsely jack up my itemized cost and always then discount it (by varied amounts)? ... But that also doesn't seem right Sorry for the overexplain, hopefully it made sense. Thanks for reading! 😅", "comments_text": ["I’ve been there too… I unfortunately just charged a lesser rate (2-3 units instead of 4) for those sessions. It doesn’t happen often.", "I would make your itemized cost equal per unit and equal the lesser unit amount and then apply discounts if the unit amounts were higher than anticipated. E.g. $125 cash typically gets 30 minutes or 2 units, but I went for 38 minutes this visit and per 8 minute rule I could charge 3 units, but I gave a discount for the third unit, so no charge for patient Ed, but charge for neuroreed 1 unit at 62.50 and therex at 1 unit 62.50 rates. Pretty sure you can have void units on activities you don't want to bill a full unit on Jane e.g. 7 minute activity is 0 units, but still doc the activities and cite it as no charge 😉 just follow 8 minute rule, match number if units to total time (60 minute session is typically 4 units), err on side if caution. People are usual pleased with discounts or write off, but frown in session to session breakdown discrepancies like there 1 unit was this amount and now it is more expensive... hope this helps"], "why_selected": "Matched keywords: follow, charge, rate, fee, cost; High engagement (31); Relevance score: 22.7"}
{"thread_id": "thread_1252186232219273", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1252186232219273/", "createdAt_iso": "2023-05-31T03:49:38Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 19}, "post_text": "I currently do PT contract work through my mobile PT LLC for a home health agency to round out my schedule, maintain predictable income, and through whom I often get a lot of referrals when people are not home health appropriate etc. the company recently sold and is going from hourly contracted rate to per visit contracted rate. I will obviously need to re negotiate my contract but would like to have an idea of a pay range for per visit home health rate so that I can negotiate proactively. Anyone have experience with this? Thank you", "comments_text": ["I’m in North Texas… rates directly to agency for me are $100 for eval/reeval/dc and $80 for routine. I don’t do SOC for the one agency I work with directly but I do them for 2 contract groups. Ranges from $110-140 depending on which group and where the patient is. Nice to have flexibility to simply say no when I want. If they are desperate for help, they have no choice but to pay. I wouldn’t take less than $140 for SOCs in your situation. I know of one PT getting $180 for an SOC in rural Mississippi. You have to account for your non billed time driving which is going to be higher in rural automatically.", "I do the same and am paid per visit. Where do you live? I’m in Texas, and it will greatly vary from state to state (I.e. California rates are way higher), but I get paid 80-90 a visit on average for all visits. I do not do SOC visits. Just eval, RE, treat, DC! Been considering asking for a slight pay bump here recently to 90+ per visit. I’ll see if that goes over well lol! Greatly helps me do all of the above you mention being a PRN home health PT."], "why_selected": "Matched keywords: eval, rate, hourly, per visit, rates; High engagement (39); Relevance score: 21.8"}
{"thread_id": "thread_1013106916127207", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1013106916127207/", "createdAt_iso": "2022-07-18T21:39:52Z", "metrics": {"reactionCount": 139, "shareCount": 0, "commentCount": 18}, "post_text": "Man, I hope this ends up being a trend, but people seem to be quite alright with doing my 1-on-1 private pay $170 per 1-hr eval and $130 or less for 45-min follow-up sessions depending on whether they got a package after the evaluation. Another couple new private pay evals lined up, one being a referral from the physiatrist. Evidently if you give people great care some don’t care what you charge and are willing to pay for it. I know this is less than many of y’all charge, but in my area people are charging $115-175/hr for evals so me being at $170 already places me at the top vs in the middle of the area market when I was located much farther away from home. 🤞 This WOM fire keeps spreading! Also I got one lead from auto-scheduler from my website that converted recently as well which was exciting. It’s been a slow build up process, but I think I can finally see the light. I‘m glad because rent is going to be much more burdensome soon enough.", "comments_text": ["Congratulations what state are you in. Here people find it difficult to even pay their co-pays", "You find what works in your area and grow from that. Congrats"], "why_selected": "Matched keywords: eval, follow, /hr, charge, package; High engagement (175); Relevance score: 21.6"}
{"thread_id": "thread_1391236734980888", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1391236734980888/", "createdAt_iso": "2024-01-12T19:11:40Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 32}, "post_text": "Question about cancelation fees -- I run a mobile practice. We charge $50 per cancelation. I've been having staff as if they get a \"cut\" of this fee. I've always been on the 'hard no' side of this debate because I feel like that scenario is rife for abuse. But now I don't know... Staff satisfaction is hugely important to me, and if it matters to them then I'd consider it. What do you all normally do and what's your experience? Thank you!", "comments_text": ["Yes, we always paid staff for cancellations whether % of fee or hourly rate no matter if they were contract, 1099, or reg emp. That fee is to cover their time and expected pay just as much as yours.", "If I was the one who wasted my time and gas driving to the patient’s house, but you got the cancellation fee, I would not feel appreciated. If I was the one who had to rearrange my schedule at the last minute because of the cancellation, but you got the cancellation fee, I would not feel appreciated. If I had to sit around and waste my time because I couldn’t find someone to fill the opening created by the cancellation, but you got the cancellation fee, I would not feel appreciated. If you feel that you have a trustworthy and conscientious staff that you want to keep, share the fee. If anyone abuses it, deal with them. But I feel that companies that appreciate therapists are rare, so when we are lucky enough to get hired by one we take care of that company and don’t abuse their appreciation. Is it worth $25-50 to you to make your employees feel like you value their time the way you would value your own?"], "why_selected": "Matched keywords: charge, rate, hourly, fee, fees; High engagement (68); Relevance score: 21.1"}
{"thread_id": "thread_1199331210838109", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1199331210838109/", "createdAt_iso": "2023-03-09T19:30:09Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 3}, "post_text": "When y’all are figuring out package pricing is there a rule of thumb you use or how do you determine how much to take off when someone does a 4 session, 6 session, 8, etc?", "comments_text": ["I decided what I wanted my “minimum” rate to be, and calculated the math up from there. For my six visit package, I offer 5% off if they commit to 6 but choose to pay as they go, or 10% if they pay for all in advance. If they choose a 10 visit package, they get a 10% discount to pay as they go, or 15% to pay up front. I have a policy for how long they have to redeem those visits, and what happens if they don’t use all the visits in the allotted time.", "Lots of ways to go about this. Just make sure that your \"best price\" is not lower than the session rate you need to stay viable. (I.e., if everyone bought sessions at your best rate, you would still be able to pay your business bills and pay yourself a living wage.) I don't do packages, per se. If they buy the full POC that I propose at eval, they get my POC discount. Anything other than that is a percentage upcharge, based on my personal \"minimum\" rate."], "why_selected": "Matched keywords: pricing, packages, eval, charge, price; Relevance score: 21.0"}
{"thread_id": "thread_1013113436126555", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1013113436126555/", "createdAt_iso": "2022-07-18T21:58:31Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 6}, "post_text": "Looking for some insight… Working towards opening a mobile neuro PT practice. For those of you who also treat under this umbrella… 1.) How much do you charge your clients for your evals and how much for subsequent treatment sessions? 2.) Is your current rate the rate at which you started your practice under? If not, at what point did you increase your rate? 3.) If you offer treatment packages, what do those look like?", "comments_text": ["I have my NCS and am PWR! certified and have my own mobile neuro focused practice. Being that majority of my patients have Medicare, I decided to enroll in Medicare as we are unable to charge cash for formal physical therapy services. I do offer cash based physical therapy for those with private insurance and have a few that I bill as an out-of-network provider. I have not changed my rate yet as I feel those who have neurologic dx their income is typically fixed and I will most likely be seeing them over the course of a long period of time. I also offer cash based wellness services after I discharge patients from formal PT services. I'm happy to speak more regarding my practice if you'd like.", "I know this isn’t what you asked but I will say I haven’t talked to a successful cash mobile provider who didn’t wish they started at a higher rate. There is no benefit to filling your schedule with low price treatments. Your goal isn’t being busy. Your goal is helping people. $200 or more for any home visit might be a reasonable minimum. It is always easier to start high and discount than to start low and raise."], "why_selected": "Matched keywords: packages, charge, price, package, rate; High engagement (15); Relevance score: 20.4"}
{"thread_id": "thread_980951839342715", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/980951839342715/", "createdAt_iso": "2022-06-03T12:21:18Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 31}, "post_text": "Help needed: I have a cash based business where I specialize working with runners and triathletes. I do a lot of wellness visits /running evaluations. I had someone reach out to me who lives over an hour away and asked if I have a surcharge fee for going that far and I wanted to get everybody’s opinion on how much you’d recommend charging. With gas being so expensive and extra time driving that far wanted to be fair. I charge $130 for a basic evaluation and typically $150 for a separate running evaluation with fully analysis. Thank you!", "comments_text": ["$130-150/hr normal rate Driving to/from will be two hours of your time not including business expense of mileage on vehicle and gas. Definitely charge for time and expenses. Something like 20% of normal service charge for out of radius visits plus $.05/mile? Or just a flat rate that changes with the market if you want simplicity", "I wouldn't charge extra. Think of it as an extra marketing and extra word of mouth. Another person changed. Good luck my friend!"], "why_selected": "Matched keywords: /hr, charge, rate, evaluation, how much; High engagement (65); Relevance score: 20.1"}
{"thread_id": "thread_1512996346138259", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1512996346138259/", "createdAt_iso": "2024-07-18T00:55:11Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 24}, "post_text": "What is your favorite tactic for increasing prices? some are on a package and others are pay per visit and others are continued per visit at the package price discounted rate for a coke more follow ups - what do you tell them? My brains too tired to find the right words. Aug 1 is my goal and I’m trying to figure out what’s “fair” time wise to get info out.", "comments_text": ["I recommend personally telling your current clients face to face. Offer them the opportunity to purchase more sessions at their current rate, or give them a heads up on when you’ll be raising the price. Treat them like VIP. Then send an email to your list - give them a chance to buy at ur old rate (if ur looking for a cash injection) and then start charging to new patients (who will be the first to pay the new price). You don’t have to tell them why. In fact don’t justify. Just say you have a price increase. They don’t need to know the details.", "Raise prices on new clients only.. Start AUG 1.... And tell current clients prices are going up, yet you value them so much and as a thank you you will keep them on the original price WIN - WIN Good luck"], "why_selected": "Matched keywords: follow, price, package, rate, per visit; High engagement (52); Relevance score: 20.0"}
{"thread_id": "thread_1691932041578021", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1691932041578021/", "createdAt_iso": "2025-03-17T18:23:20Z", "metrics": {"reactionCount": 6, "shareCount": 0, "commentCount": 17}, "post_text": "Okay help me brainstorm…. What keeps a PT clinic from billing for skilled PT, and also charging for a gym membership and fitness training to address fitness goals that aren’t skilled? It seems like as long as the patient is 100% informed about what is PT and what’s covered by their insurance, and what services are NOT PT and what the costs are, that we should be allowed to do this? I’m just thinking about all the non-covered, “nice” perks that we provide under the banner of providing “high quality care”, which could more appropriately be charged for cash on an ala-cart menu of options. I imagine the cleanest legal way to do this would be separate business/LLC’s, separate spaces, separate billing systems, and of course some crystal-clear communication to the patient. Anyone doing things like this? My reason for asking is actually that I am a professor teaching global fitness exercise to students, and they probably shouldn’t prescribe push ups and overhead press for plantar fasciitis patients, but I want to encourage them to maximize their value and skills even beyond the rehab goal. Of course this model also makes a strong case for cash-based services that simply provide for ALL goals regardless of insurance coverage…. But I’ve never done it! Thoughts?", "comments_text": ["I own a semi private training facility and PT clinic all under one roof, one LLC, one set of books. There is no issue. It’s a whole different service and insurance is not being billed for it. They sign a membership contract for those services. This is also almost no different than someone being cut off by insurance and becoming a self pay patient, minus the fact that you aren’t doing skilled evaluations or follow ups that would require documentation."], "why_selected": "Matched keywords: membership, follow, charge, rate, evaluation; High engagement (40); Relevance score: 19.9"}
{"thread_id": "thread_1928557237915499", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1928557237915499/", "createdAt_iso": "2025-12-22T13:32:14Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 11}, "post_text": "Question about charging an extra fee for appointments outside of business hours: I am cash based (and accept HSA/FSA) and am toying with the idea of going into the office on a day off, upon request, outside of normal hours in exchange for an additional fee. Right now I am just saying no (it’s a challenge to go in as I need childcare), but at times I could finagle it but it’s still a lot of trouble to see one client. For those who charge an extra fee for this instance: 1) how much do you charge? 2) what do you call it (extended hours fee?) 3) can you charge HSA/FSA for the additional cost (or would you charge these accounts for the base price and require cash/ check/ personal credit card for the remainder).", "comments_text": ["I literally am implementing a small fee for similar starting 2026- i am just doing $25 in addition to visit cost if pt wants me on a holiday or same day last min (i am mobile and cash)", "Our HVAC broke and I had to pay what they called a Saturday fee for a technician to come out on a Saturday to fix it. I think you could 100% offer a convenience fee for evening or weekend hours as long as you’re very upfront about it, but I don’t know that HSA fees would cover it. I don’t do that and I’ve never looked into it. ￼"], "why_selected": "Matched keywords: charge, price, how much, fee, cash based; High engagement (24); Relevance score: 19.6"}
{"thread_id": "thread_1195784311192799", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1195784311192799/", "createdAt_iso": "2023-03-04T21:22:23Z", "metrics": {"reactionCount": 30, "shareCount": 0, "commentCount": 58}, "post_text": "I’ve been a cash based therapist and personal trainer for a year now working out of my home studio. I’m still really struggling with my fees. My therapy clients are my easiest. I see them, they leave, and I’m done. My personal training clients require significant more work. I see them, they leave, then I’m busy making exercise programs for them, finding an inspiring podcast or article for them to read, analyzing their nutrition logs for them, etc. It seems as if I should be charging more for using the skills of my therapy/masters degree, however so much more work is involved with my personal training clients. 1/2 my clients get a combo of both services. So how would you break down fees for services? Just have a flat fee for all my services regardless of what they are receiving? My other problem is 50-75% of people that email me inquiring my service rates don’t respond after I tell them. In comparison to all the other local gyms (I did my research) I’m on the lower side. Thoughts? (Latest social media post photo for the hell of it.)", "comments_text": ["Same rate you offer your rehab patients. You are practicing at your highest degree and your admin time should be considered.", "Personally I’d charge a higher price point because although I may wear many hats, what’s underneath the hat is always the same. You’re always going to be thinking at your highest skill level and you’re a good PT who cares about motivating your clients, know your value. The clients who pay for having a good PT who also trains (because it’s not as common as you may think) are the ones you want to keep anyway. Charge more so you can provide a better product and ultimately work less"], "why_selected": "Matched keywords: charge, price, rate, fee, cash based; High engagement (146); Relevance score: 19.5"}
{"thread_id": "thread_1615777062526853", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1615777062526853/", "createdAt_iso": "2024-12-06T12:25:05Z", "metrics": {"reactionCount": 20, "shareCount": 0, "commentCount": 49}, "post_text": "Update: thank you everyone for the feedback. After your feedback I sent an invoice via certified mail (so they couldn’t say they didn’t receive it). I also sent them a message letting them know I was cancelling their next appointment as I hadn’t heard from them, that the equipment needed to be returned by the end of this coming week (they could just leave it in a bag by the office door) and that if it wasn’t returned and the outstanding balance wasn’t paid I would be going to the PD for theft of the equipment and moving forward with filing against them in small claims court. That was enough for them to resume communications. They’ve agreed in writing to return the equipment. I’m hopeful I’ll get paid too. They did send a vague threat of negative review which will suck if that happens. I’m still glad I took actions to hold my boundary instead of just letting it go. Any 100% private pay providers ever have a patient steal a session? Does anyone know what channels I have for recourse? I’m in NH if that makes a difference. This is a first for me in 11 years. I usually make sure people have a credit card on file. In fact my system requires one to book an appointment online but every now and then I’ll schedule a new patient over the phone and forget to get a card. Still nothing like this has ever happened to me before. The patient in question came in for an eval. I verbally told them on the phone when they scheduled that I don’t take insurance and my price. They also got an email with the appointment confirmation stating that I don’t take insurance. They signed 2 forms before the appointment stating that I don’t take insurance and they are responsible for payment at the time of service. We get to the end of a 2.5 hour eval (I specialize in PTSD and chronic/complex issues) and when I asked what card they’d like to use they told me to bill insurance. When I reminded them I don’t take insurance they told me they lost their wallet. I asked about Venmo, PayPal, Apple Pay, etc and they said they don’t have any of those. I sent them an invoice through email hoping they would pay it. We actually communicated by text for about 4 days after the appointment so I was hopeful that maybe they would actually pay. It’s been over 2 weeks now and I’m being ghosted. No response via phone, email, or text anymore. If it makes a difference I also loaned them a piece of my equipment to use and then bring back at their next session. I’m kicking myself for not getting my equipment back once they asked me to bill insurance and said they lost their wallet. I just got so flustered and was late for my next patient that I couldn’t get the words out. So I also need to either get my equipment back or charge them to replace it.", "comments_text": ["Honestly for one time I'd eat the cost to avoid the stress and cost of the collections/court. I had one patient that acknowledged the cost of a 20% coinsurance, signed papers, then refused to pay and it carried on. It was around the holidays last year and was somewhere between $100-200 due. She was very chronic and had some mental involvement with ptsd and a lot of ups and downs. Treatment was going great and then it was like she snapped about all kinds of things and said her psychiatrist wrote off her private due charges. I said it was illegal for me to write off insurance agreements. In agreement with my insurance assistant, I ultimately wrote it off that one time as \"uncollectable\" instead of taking her to small claims after trying many times to collect payment. I called the referring doctor and discussed the situation as well. I was upset about it for a little while but the continuation of pressing further wasn't worth it. With the equipment...it depends. Sorry you had that experience. Patient avoidance behavior is really tough. I agree on pay before.", "I had this happen once. The eval was 1.5 hours and super complicated guy and he kept complaining that my table wasn’t padded enough. Then-said to invoice him-which I did and he didn’t pay. When I reached out he was angry about the table and the fact that I asked him questions about what he wanted to do but could not do due to his injury (a subjective interview!!) and threatened to report me to the board. While the board report wouldn’t have mattered since I didn’t do anything wrong-it was still something I really didn’t want to go thru. I just let the payment go. I try to reflect back and see if I missed red flags w him 🚩 Hope karma does its job!"], "why_selected": "Matched keywords: eval, charge, price, fee, cost; High engagement (118); Relevance score: 19.4"}
{"thread_id": "thread_1485203768917517", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1485203768917517/", "createdAt_iso": "2024-06-06T01:12:26Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 5}, "post_text": "Update on lawyer post: So originally the kawyer had reduced our amount to $2500 and $1500 for husband and wife. Which we emailed back saying we accepted those amounts. Then the husband came to our office and asked for reduction in our fee. I spoke with the husband and told him there’s nothing we could do and it would be fraud if we reduced our amount for him to get more money back. Well a few days later the lawyers office send us a check for $500 for the husband and $900 for the wife….. I emailed the lawyer and asked what happened to our original amount. Here’s what they said: After speaking with my clients looking at the medical billing, you billed Medicare for all of Mr (husband) visits and some of Ms. (Wife’s) visits. Under Medicare rules, providers are not allowed to balance bill patients. The payment of $500 represents Mr. (Husbands) copays. There should have been a separate check for Ms. (Wife’s) in the amount of $900 for the visits that were not willed to Medicare.” I have no idea what to even say. I’m so pissed. We charged the wife our self pay rate because she was not on Medicare. So I don’t understand how the lawyers office can reimburse us Medicare rate…. And for the husband, they only covered his copay and NONE of the dry needling…. “ Here’s the old post for people to read: “I saw a husband/wife post MVA, and I treated them for a few weeks. We just received payment for their settlement. And it’s a good amount. Now the husband came into our office today and asked to lower our amount. The lawyer showed them what we were getting from the settlement and the husband came to us and asked to lower so they can get more from the settlement. Kind of sucks. And I’m not sure what to even say or do. I don’t mind lowering the amount. And I did treat them together and not separately because that’s how they would want it. Wife was very sensitive so wasn’t able to do much as for treatment. But husband I did a lot of dry needling and manual on. Husband was saying we didn’t do much on his wife so we Shouldnt charge much. Etc etc. This is also ironic because I know them to be very well off. Any advice?”", "comments_text": ["Balance Billing does not apply to 3rd party payers like auto/personal Injury. Once the case is settled, MC or private pay is supposed to be reimbursed, but u are do your full fee. I would get your own attorney or take these patients to small claims court. From now on, for these auto/P.I., I strongly recommend collecting your fee upfront and let the patient and attorney deal with all of the above mentioned B.S. This will effectively weed out those clients who are just gunning for a settlement.", "Also, I’m only billing for my dry needling which is not a covered service. I’m not billing our self pay rate or anything like that for the husband. And the wife didn’t even have insurance. So we billed our self pay rates. She got on Medicare towards the end of treatment so we didn’t charge our self pay rate for that."], "why_selected": "Matched keywords: charge, rate, fee, billing, rates; High engagement (12); Relevance score: 19.3"}
{"thread_id": "thread_1485848708853023", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1485848708853023/", "createdAt_iso": "2024-06-06T23:07:06Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 29}, "post_text": "I have my mobile based LLC and have a home health agency reach out to contract some of their patients to me, they want to pay $75 for follow up and $100 for eval. I feel like this is very low but wanted to see what you all think. Thank you", "comments_text": ["Way too low. I would not go below 100 for tx and 150 for eval, and that is still low. One of our Therapists in our program on the east coast just negotiated 110 for tx and 165 for eval. No oasis.", "This was and still is my business model. Sometimes I negotiate depending on if the HH patient is Medicare or Medicaid and trying to be respectful to the agency who is getting paid peanuts by the state for Medicaid patients. Also can negotiate if a PT vs PTA will be seeing them. Average is PT visit/eval $95 and then I add $30 for SOC/OASIS document. I occasionally lose $ on the PT visits but make it up on the margin of a PTA visit vs pay rate"], "why_selected": "Matched keywords: eval, follow, rate, fee, follow up; High engagement (59); Relevance score: 19.0"}
{"thread_id": "thread_1918533988917824", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1918533988917824/", "createdAt_iso": "2025-12-09T17:14:41Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 17}, "post_text": "I’ve been connecting with a local DPC/concierge doc, and we want to formally collaborate. She’d like to be able to pipeline her patients to me, but include my service as part of the fee they’re already paying her (so not just a referral, and then they pay for my service). We are trying to figure out how to make this work so that I am also getting paid what I am due. Could this be as simple as the physician paying me out of petty cash from her practice when I see one of her clients, or do we need to go through credenting and billing as if a traditional clinic? Or something else?? Open to ideas … I have been totally solo an fully cash-based practice for several years, so this is new territory!!", "comments_text": ["I love that you’re thinking through this before you jump in, because the way you structure it now is what’s going to make this collaboration actually work long term. There are a few clean ways to look at it. First option: treat it like you’re getting free leads. If she wants to keep her pricing exactly the same and not rearrange anything, that can still work. The big thing is you cannot let people just show up at your door expecting free ongoing PT. You need a 15 minute phone call with them first so you can set expectations clearly… “Here’s what the eval normally costs, here’s what this first session looks like inside your DPC membership, and here’s what people with your issue typically need in terms of sessions.” Basically give it the full discovery call feel so they understand where the free part ends and where your actual plan of care begins. That protects you and makes the whole thing way smoother. Second option: if she’s planning to raise her prices, then your service can just be baked into that increase. It becomes a value add for her members and she stays whole financially. My guess is she’s probably not looking to raise prices, but it’s still worth mentioning because it’s the most straightforward version of the model. Third option: she pays you directly per person she sends over. If you go this route, compare it to what you’d normally spend on acquiring a patient. If you’re running paid ads, depending on your city you might be paying anywhere from $80 to $150 just to get someone on a phone call. These aren’t cold traffic leads though. These are warm, already-sold referrals coming from someone they trust. That’s worth a lot. Your conversion rate on those will typically be double what you get from ads. If you frame it that way, you can structure a win-win so every patient who needs PT goes straight to you as the default, not “one of several options.” She sells it as part of the experience. You take it from the first call onward. So you’ve got a few models here. Just make sure whatever you choose sets expectations properly and positions you as the consistent PT solution for her people. That’s where this kind of relationship becomes genuinely fruitful instead of chaotic.", "You have to be careful with these laws -the easiest way is to just accept referrals from the doc : Federal Anti-Kickback Statute (AKS): Prohibits knowingly offering, paying, soliciting, or receiving any remuneration (cash, gifts, discounts) to induce referrals for services paid by federal programs (Medicare/Medicaid). Violations are felonies with severe penalties (prison, fines, exclusion from programs). Stark Law (Physician Self-Referral Law): Prohibits physicians from referring patients for certain services (like lab work, PT, imaging) to entities they or their family have a financial relationship with (ownership or compensation), unless an exception applies. State Laws: Many states (e.g., Texas) have independent anti-solicitation or anti-kickback laws that can be stricter. Professional Ethics: The APA and other organizations specify that payments should be for services rendered, not based on the referral."], "why_selected": "Matched keywords: pricing, membership, eval, price, rate; High engagement (38); Relevance score: 18.8"}
{"thread_id": "thread_1039858006785431", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1039858006785431/", "createdAt_iso": "2022-08-25T14:09:31Z", "metrics": {"reactionCount": 180, "shareCount": 0, "commentCount": 40}, "post_text": "How to properly set your “cash” price to reach your practice goals! This was a comment made on a post that seemed to be helpful to others so I will share in more detail here: I don’t think it’s helpful to set your price based on competition in the area, I think it makes a lot more sense to set your price based on the goals you have for yourself individually and in the practice. So, let’s look at this together: Step 1: What so you want to bring home per year after taxes? In this example I will use $100,000 (that’s take home after taxes, that would be pretty awesome right?! Well, it’s totally possible, let’s keep going…) Step 2: Figure out how much you would need to bring in TOTAL (gross revenue for the year) using this calculation: 7/10 $100,000/x (picture below) Example: $142,857 Step 3: Divide by 48 weeks (because you should absolutely be taking 4 weeks off per year as a business owner to make this thing sustainable 👊🏻) Example= $2,976 per week Step 4: What is your “sweet spot” for number of visits per week that you could maintain as a solo preneur (for now, until you hire if that’s a goal of yours) Example= $2976/18 visits per week = $165/visit So, that means that you cannot charge anything less than $165 per visit (even with packages) in order to hit your personal goals. Remember: If your cup is full, then you will be able to overflow into the lives of others and make the impact you are looking for. Hope this is helpful for you 👊🏻. Keep going. Don’t stop. Embrace the unknown.", "comments_text": ["I now use 44 weeks per year in my equations. My awesome boss thought I needed more PTO 🤣", "The key: Don’t set your price based on competition."], "why_selected": "Matched keywords: packages, charge, price, package, how much; High engagement (260); Relevance score: 18.8"}
{"thread_id": "thread_1639332240171335", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1639332240171335/", "createdAt_iso": "2025-01-08T01:24:48Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 8}, "post_text": "I’m trying to figure out the best way to offer services. I feel like I should have a 1 hour option and a 30 or 45 option but all initial visits need to be an hour to give plenty of time for a good assessment. I will be offering hands on services such as dry needling, IASTM, cupping-I don’t love the idea of offering these as stand alone “a la carte” options though. General strength/mobility is also offered without hands on intervention. SO- is it best to just have an hour rate (your time is your time) with the goal being that you’ll provide whatever is needed within that hour? Do you have a base rate and then the other manual treatments as “add ons” (which sounds hella confusing for all parties). What works best for y’all?", "comments_text": ["Same as above. Your time is your value ultimately. Your expertise, applicable knowledge, guidance, and skills come within that.", "Hi! I have 1 set rate for my hour appointments and a set rate for 30 minute sessions, no additional fees for anything we do within those time frames. The first session is always an hour. My evals and hour follow-ups are the same price, though I know a lot of therapists charge more for the eval. Like you said, and hour of my time is an hour. The only manual I offer a la carte is dry needling and it is also 1 rate whether it takes 10 minutes or 30 minutes."], "why_selected": "Matched keywords: eval, follow, charge, price, rate; High engagement (17); Relevance score: 18.4"}
{"thread_id": "thread_1453743315396896", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1453743315396896/", "createdAt_iso": "2024-04-19T14:20:45Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 6}, "post_text": "Is anyone willing to message me your fee structures? I’m struggling to decide on single visits vs packages (monthly/punchcard style). I’m wanting to keep things relatively simple but also have a few options for different types of buyers.", "comments_text": ["I went with single visits. I used to have lots of options for patients (eval only, eval and treat, 60 min treat, 30 min treat, etc). I've streamlined it to 2 options: 2 hour eval and treat for $459 and a follow up worded \"up to 60 minutes\" for $289"], "why_selected": "Matched keywords: packages, eval, follow, package, fee; High engagement (13); Relevance score: 18.3"}
{"thread_id": "thread_1605070900264136", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1605070900264136/", "createdAt_iso": "2024-11-21T16:03:49Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 5}, "post_text": "FUNCTIONAL CAPACITY EXAM (FCE) Question: Does anyone here do FCEs? Looking for a form (I've done them at a previous employer & prefer not to have to re-create!) and a ballpark of cost.", "comments_text": ["We use WebFCE. It’s all neatly laid out for you and generates a nice form letter and everything. I’m not sure of the cost of use for the software since I don’t own the clinic, but I know we charge $1200 for a 4 hour FCE and I think $200 for a basic 1 hour pre-work screen. Discounts for cash pay clients and some contracted rates with workers comp and lawyers offices. But our price starts at $1200. I’m in Florida if that makes a difference for you.", "We use Occupro. You can buy online packages single or in bulk. Depending on how many you use the price varies per use. One time setup fee. No reoccurring fees."], "why_selected": "Matched keywords: packages, charge, price, package, rate; Relevance score: 18.2"}
{"thread_id": "thread_1438441720260389", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1438441720260389/", "createdAt_iso": "2024-03-27T01:08:14Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 5}, "post_text": "Hello! I'm opening my cash based practice next month and am very excited. I've learned a lot from this group but do have a question on how people document transitions to wellness. I already have some clients lined up and one of them wants to be treated for \"posture\" since they work a desk job and are having pains. Now in my mind posture likely isn't medically necessary and will fall in wellness depending on impairments found, so if you do an eval under PT but determine wellness is more appropriate if any follow ups are necessary, how do you document that transition? Then let's say you're treating a patient with any diagnosis that went to wellness but their symptoms returned, how would you document the transition back to PT? Or am I over thinking this and you just set up 2 separate cases? Thanks in advance!", "comments_text": ["I use Jane for all documentation, even wellness visits. You can create any type of form you want. Patients have one chart but you can see PT eval, PT follow up, PT discharge and then Wellness visit. I do billing and payment through the app as well so its all in one place. (I am cash based)", "Posture isn’t the icd 10. The pain is. The posture is a likely soutce of the pain. People don’t go to the ER with heart attack. They go with chest pain. So if there is affiliated pain it would be considered medically necessary …. Right??"], "why_selected": "Matched keywords: eval, follow, charge, rate, cash based; Relevance score: 18.2"}
{"thread_id": "thread_1092129748224923", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1092129748224923/", "createdAt_iso": "2022-10-26T21:13:17Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 28}, "post_text": "Hello fellow clinicians. Can you guys give me a ball park of what you're charging cash based clients for evaluations and treatments. A ball park because I know there's different circumstances. Thanks in advance", "comments_text": ["I am mobile I charge 150 for an eval 125 a visit. I typically stay in a small area. I know two other therapists in my area who do clinic based cash PT, one charges 160 an hour, with an intro price on the eval of 87 to get people in the door, the other one 225 for an eval or visit. She has a very specific niche… runners. Both own their own clinic with a second or third PT working with them. I realize my prices are lower and I am mobile, but some of my patients actually see me more than 1 times a week whereas with their business model they often will see someone and then have them come back maybe once a week, every 10 days, or every other week, etc.", "Thank you all so much. I live in FL. I wanted to make sure I'm fair across the board but also making a realistic business decision."], "why_selected": "Matched keywords: eval, charge, price, evaluation, cash based; High engagement (61); Relevance score: 18.1"}
{"thread_id": "thread_1073009550136943", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1073009550136943/", "createdAt_iso": "2022-12-03T17:26:49Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 20}, "post_text": "Has anyone done PT record reviews for an attorney for a legal case? What do you charge per hour? An ortho surgeon friend of mine referred me to a lawyer he does reviews for and the lawyer is asking me what my fee schedule is, I have no idea!", "comments_text": ["I would personally charge whatever your hourly cash rate is. Time is time regardless of what you're doing.", "What I do is have a rate for the 1st 4 hours of document review with a 4 hour minimum I receive a check in advance for the initial review. 2) 2nd rate for remaining review of documents, written report 3) 3rd rate - 1/2 day deposition rate 8hr day deposition 4) 4th rate trial testimony. (1/2 day rate and full day rate) All of this should be in an email entitled legal fee. I ask the attorney to return signed legal fee letter"], "why_selected": "Matched keywords: per hour, charge, rate, hourly, what do you charge; High engagement (45); Relevance score: 17.9"}
{"thread_id": "thread_1135452827225948", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1135452827225948/", "createdAt_iso": "2022-12-16T14:40:51Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 19}, "post_text": "Question- I have an individual who just wants cupping done. Am I able to JUST do a cupping treatment session and give her that superbill or does she NEED an evaluation prior to get reimbursed? Or do I require the entire evaluation for the first visit and can do only cupping after that?", "comments_text": ["That’s an “a la carte” service. If cupping is the only thing they want, you can just charge cash for a wellness/recovery visit. PT is a full eval and YOU decide whether cupping is the most effective tool to use. I do PT and also provide DN and recovery massage as a la carte services….although i will mention that some PTs prefer not to do this bc what ends up happening is that patients JUST come for those services and don’t actually make the huge improvements like they could. Right now, providing a la carte services align with my business goals but i can definitely see people prefer not to provide it. Make sure you’re charging for your time appropriately!! Massage therapists make at LEAST $1/minute and that’s excluding tip, mobile services, and additional modalities. My rates are $2.5-3/minute. I know you didn’t ask….but I figured I’d just put it out there. Hope that helps!! 😊", "If you’re wanting to submit for reimbursement it needs to be a physical therapy visit, meaning you would need to follow your practice act, which I would assume means evaluation. I perform evaluations and treat the same day every time. If you’re not performing “physical therapy” and are doing “wellness” then you would not use CPT codes and not submit any sort of super bill."], "why_selected": "Matched keywords: eval, follow, charge, rate, evaluation; High engagement (39); Relevance score: 17.8"}
{"thread_id": "thread_1313967306041165", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1313967306041165/", "createdAt_iso": "2023-09-08T22:52:45Z", "metrics": {"reactionCount": 79, "shareCount": 0, "commentCount": 71}, "post_text": "Curious what others think…I believe that timed billing codes is one of the worst things for our profession, and we are basically the only profession that has them. It diminishes our value, and dictates how we treat if we want to make any money. If I have a post op shoulder patient, I can do very effective joint mobilization and PROM in 15 minutes, but why should I get paid less for that visit, than if I make someone do a bunch of exercises with some supervision. Times codes are forcing PTs to do fillers to waste time so that they can get decent reimbursement, even if it isn’t necessary, or even if it isn’t in patients best interest. I think this is the number one thing the APTA should focus on, if anyone here is active in it. Very curious what others think please! Thanks, I’ll get off my soap box now…", "comments_text": ["Sounds like you are a business owner. Assuming you are, you are in the best position to create what you want. ... Reading through the comments and your responses it sounds like 1.) you want to earn more money, 2.) you want to deliver a better patient care experience, and 3.) you want to do it at a price point that you would pay if you were the patient. ... Does that sound about right? ... Rather than focusing on someone else changing a system that won't likely change in our lifetime, why not put that energy into something you can control more easily. ... Create the business that solves the problems you want to solve. ... Look at business models outside of healthcare that are already achieving these goals. ... Starbucks is a bank that sells overpriced coffee. A standard coffee shop can't compete because they are trying to operate in a failing business model. ... Facebook and Google make hundreds of billions on selling what people give them for free. ... Barnes and Nobel survived and is opening 30 new stores despite Amazon's attack on book sales because of their are a real estate holdings business. ... I can run a profitable therapy business because it is secretly a media company and billing company that also delivers therapy services. I can profitably deliver services at far lower costs while still paying my staff higher than average rates because I understand the objective of my business model.", "One of the thousand reasons why I'm a cash provider!"], "why_selected": "Matched keywords: price, rate, fee, billing, cost; High engagement (221); Relevance score: 17.7"}
{"thread_id": "thread_1913720379399185", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1913720379399185/", "createdAt_iso": "2025-12-03T15:38:58Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 8}, "post_text": "Private practice while working for insurance based company. I have a cash-based private practice that I work weekends and some evenings. I still have a full time job at a larger insurance based practice. This week at my full-time job, I evaluated a patient and scheduled follow ups. I spoke her her the next day and she told me that she was surprised that her eval was $400. She was never told the expected outcome of pocket by the authorizations team or her insurance. She found out she is covered for PT at 50% AFTER a $3500 deductible. So each session will likely be $400 which is not doable for her and she said she will have to cancel all follow ups. I suggested that she could find a practice that is cash based so that she can continue treatment at an affordable rate. She asked me for suggestions multiple times. I told her she could probably Google pelvic PTs. I am the only one in the town I work in. The closest town (which is also across state lines) is about 45 minutes -1 hour away. That is where I live and have a cash based practice. I don’t want to conflict of interest or look like I am soliciting. So should I just tell her to Google and let her figure it out… Or since she asked for specific practices, provide her with a list of several to choose from and include my practice on the list? Again, she decided to cancel with my insurance based company due to the high cost. Then specifically asked for recommendations in the next closest town which is about an hour away and in a different state. So are there any issues with giving her options including my cash-based practice? At this point, my practice is not public knowledge with my current employer since I practice in a different state an hour away and do not directly compete since I am cash-based. Advice?", "comments_text": ["I think it is definitely a conflict of interest to take a client from your employer and move them to your cash based practice. I never ever see a client privately who i met at my employer without disclosing that to (and getting permission from) my employer. Agree that $400 for a PT visit is insane. If you can't disclose to your employer, I would probably just stop communicating with her. If she finds you on Google and reaches out to your personal contact then you have to decide if you feel ethically OK to accept her as a client.", "I would provide her a list but not include my own as it’s a conflict of interest. If she finds you on her own then no problem."], "why_selected": "Matched keywords: eval, follow, rate, fee, cash based; High engagement (17); Relevance score: 17.4"}
{"thread_id": "thread_989935675110998", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/989935675110998/", "createdAt_iso": "2022-06-16T12:09:15Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 7}, "post_text": "Quick question about Medicare self pay with ABN: I’m transitioning a patient to self pay in the next several weeks. As far as self pay rates for Medicare beneficiaries, is there a requirement that I charge the Medicare allowable rate for whatever CPT code I would be performing? For example, I plan on just doing exercising and kinesiotaping, and I’ll probably be there 30-40 min. Do I have to bill the equivalent of 2 or 3 units of the Medicare allowable for therex?", "comments_text": ["#Compliance #ABN \"transitioning\" - what does this mean? Is the beneficiary completing their medically necessary POC? If so discharge patient and setup a \"wellness\" or \"exercise\" program. A mandatory ABN is not necessary, an optional ABN is recommended (read instructions relative to therapy). Are you \"stepping down\" the frequency, w/beneficiary requesting to maintain frequency? If so, issue Mandatory ABN (coded to claim) to transfer liability to beneficiary. My strong suggestion - review ABN instructions (both ABN general instructions and ABN therapy specific guidance). As for billing for Mandatory ABN - guidance in the instructions - Medicare does not dictate price, only HOW price is stated. Setting rates best practice....?? As for billing Optional ABN - Medicare does not dictate rates. For ABN - always use #GoToSource information - for both ABN and therapy application of ABN. Best of luck.", "If you are seeing a Medicare beneficiary and doing something that is skilled you cannot charge cash for that service. If it’s a non skilled service you can and charge whatever you want. If you have no relationship with Medicare - ie they don’t know you exist, then there is no way for you to bill Medicare in which case charge whatever you want."], "why_selected": "Matched keywords: charge, price, rate, billing, rates; High engagement (14); Relevance score: 17.4"}
{"thread_id": "thread_1406378090133419", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1406378090133419/", "createdAt_iso": "2024-02-04T19:42:36Z", "metrics": {"reactionCount": 11, "shareCount": 0, "commentCount": 44}, "post_text": "Who is doing a membership plan with clients and what are you doing?", "comments_text": ["Fitness membership with women mtn bikers", "Our clinic has been providing what I call an MMM for over 20 years. MMM stands for monthly maintenance membership, and our MMM is called the Diamond Club ￼ In our case, it’s structured as a discount benefit to maintain their state of wellness after they’ve completed active care. ￼we used to also have a premium membership. ￼ Ive taught the membership concept to other practice owners and happy to share if there’s enough people to do a quick zoom training ￼💎"], "why_selected": "Matched keywords: membership; High engagement (99); Relevance score: 17.3"}
{"thread_id": "thread_1014390995998799", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1014390995998799/", "createdAt_iso": "2022-07-20T14:55:43Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 3}, "post_text": "Insurance Question: I have a patient with Aetna Medicare and Medicaid dual plan. On availity it says she needs a prior Authorization. So I evaluate the patient and send the prior authorization request on availity and it says Further Medical Review Required. What are my chance to get the Authorization prior to my second visit? Also, if it requires Authorization will I get paid for the evaluation or not? Please guide.", "comments_text": ["My experience- eval doesn’t need prior authorization and they will pay. We don’t go out on the second visit or any further visits until we receive authorization. You can follow up with them via phone.", "From my experience obtaining authorizations, they may not retro authorize. Unless your Eval date is stated as the effective date (first day of the auth period) they may reject it But you need to have evaluated them before you can request the auth so that you can accurately provide the diagnosis and CPT codes and projected number of visits/sessions I have started charging the self pay rate for the Initial assessment then I call to request the auth and include the date from when I call so that the followup sessions are covered, then I balance bill the patient after the sessions process through the insurance"], "why_selected": "Matched keywords: eval, follow, followup, rate, evaluation; Relevance score: 17.0"}
{"thread_id": "thread_1296230347814861", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1296230347814861/", "createdAt_iso": "2023-08-09T11:30:14Z", "metrics": {"reactionCount": 20, "shareCount": 0, "commentCount": 119}, "post_text": "For those charging over $200, do you have like, a special niche or group that you market to or would you say you do traditional PT? I'm just starting and I'm having trouble even saying I charge $175 for an eval, much less get people to sign up. I don't want to undersell myself, and I've heard starting low and going up isn't a good idea, but I need to start getting patients....any amount of money would be nice at this point....", "comments_text": ["My husband put it a good way- you can see 10 patients for $50 each or 5 patients for $100 each (just an example, not actual pricing). So sometimes it’s more worth it to sell to/book one client vs 2-3 at a lower price. I looked at what people in my area are charging for similar services and what my goal income per month would be with how many hours I’m willing to work. That gave me a number I was happy about! Excited for you!!!! 😀😀😀", "VALUE >>PRICE .... I'd figure out what I was selling first (hint: they can get the result/outcome anywhere... ). godspeed"], "why_selected": "Matched keywords: pricing, eval, charge, price; High engagement (258); Relevance score: 16.8"}
{"thread_id": "thread_1165830380854859", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1165830380854859/", "createdAt_iso": "2023-01-24T00:57:24Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 15}, "post_text": "Any great tips on converting clients from events to full session paying customers. We have a gym event coming up next Saturday that’s booked full, clients are getting 20 minute spot treatments (stretch and manual). I have names and emails for follow up, but would love to hear ideas on what has worked best to convert those clients to full service. Like offer booking right then and there? Follow up with a coupon, a survey about their experience, offer the next workshop etc. Can’t wait to hear what has worked for others!", "comments_text": ["What I’ve done… when they finish… let them know that they will most likely need follow up to make sure their issue doesn’t continue to bother them and tell them you’ll be following up in 24-48 hours to check in and give next steps. Then on follow up, book for next session 🙂", "Fortune is in the follow up"], "why_selected": "Matched keywords: follow, follow up; High engagement (34); Relevance score: 16.8"}
{"thread_id": "thread_1285326542238575", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1285326542238575/", "createdAt_iso": "2023-07-21T15:54:05Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 12}, "post_text": "Does anyone here do functional medicine as a PT? 1. How does your pricing model work? Membership, session to session, or..? *If you have memebership pricing, but don’t do functional medicine, still please feel free to comment! I would love to know what you include in your membership and at what price!* 2. How to you manage ordering/requesting lab values? I am just finishing up with AFMCP through IFM and just starting to play with different ideas on how to make some adjustments to my practice. Thanks! ☺️", "comments_text": ["Be sure to check your state practice act on if you can recommend supplements and how much nutrition education you can give. It varies sooooo much state to state", "Look up Austin Lake with The Active Life Program. He is a PT primarily practicing FM virtually"], "why_selected": "Matched keywords: pricing, membership, price, how much, fee; High engagement (28); Relevance score: 16.7"}
{"thread_id": "thread_1434287290675832", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1434287290675832/", "createdAt_iso": "2024-03-20T18:05:04Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 1}, "post_text": "If we are doing a Wheelchair eval only for a Medicare patient, do we just do a regular eval and discharge? Then do a medical necessity letter? We've been doing WC eval for patients we see for a bit and decide they would benefit from a chair, but not just a wheelchair eval only.", "comments_text": ["I typically do 2 different documents. Eval and then LMN. I also bring folks in for 2 visits with an ATP joining 2nd visit, but if it's not complex seating you could probably wrap it all into one document."], "why_selected": "Matched keywords: eval, charge; Relevance score: 16.5"}
{"thread_id": "thread_985293308908568", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/985293308908568/", "createdAt_iso": "2022-06-09T19:09:06Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 10}, "post_text": "I have a billing question for anyone who does both mobile and in-clinic visits. I recently expanded my in-clinic availability with new space, and so decided to increase my mobile rate by $20 - partly to cover gas, partly for the lost time with driving compared to in-clinic visits, and partly to encourage more scheduling of in-clinic visits versus mobile. My question is - I'm not sure how to change this/how this should look in my documentation, specifically on my superbills/invoices. My thought was that I should keep my per-unit rate the same, and just add the $20 as an additional fee - however, there doesn't seem to be any way to do this across the board in my documentation (PT Everywhere), I think I would have to go into each visit invoice and add the fee, which I don't really want to do because (a) it seems less transparent - I want to make sure patients see that additional fee from the beginning if they're scheduling online, and (b) time-consuming. Has anyone else run into a similar issue? How did you set yours up? Thanks all!", "comments_text": ["I use PtE as well. Question: Why are you trying to make your per unit rate equal you total visit rate? PtE let's you set whatever price you want. Ignore your per unit rate unless you are billing OON insurance. PtE let's you set the flat rate at whatever you want. Create a \"Mobile PT Visit\" service and add the $20 to the service price. You don't even to notify the patient you are charging more. When they go to book they will see the mobile visit is more expensive than the in clinic visit. They might not care or they might decide to come in clinic. I'd recommend setting up a new appointment type and charging more for it", "My population is mainly Medicare so I cannot charge a fee for mobile versus clinic"], "why_selected": "Matched keywords: charge, price, rate, fee, billing; High engagement (21); Relevance score: 16.5"}
{"thread_id": "thread_1063286441109254", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1063286441109254/", "createdAt_iso": "2022-09-24T18:53:55Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 10}, "post_text": "Hey all! For those of you who are cash based providers and provide super-bills for out-of-network reimbursement... riddle me this situation described below. Let's say you charge $100 per visit for your cash based services over the course of a 60-min session (unrealistic i know... but simplistic math). If i have a CPT Code based fee schedule of $25/unit and I typically bill 4 units to reach my cash based per visit rate... but i only see that patient for 3 units worth of treatment, and the patient payed the full $100 going rate for my treatment at the point of service. What will reimbursement from their insurance look like when the patient submits a superbill where the services performed don't align with total amount paid by the patient? Total cost paid by patient would be $100... total units billed to insurance for reimbursement would be $75 because of 3 units charged. Would this be a problem? Side note... do a lot of cash based PT's bill off of a CPT code based fee schedule? Also do you bill units from AMA or 8-min rule guidelines? Any information and recommendations would be helpful for myself as a new owner! Thanks all! I look forward to some great discussion below in the comments!", "comments_text": ["But how does it work for patient reimbursement if your PP rate us $100, your billable are $300, check goes to the patient. They might be getting $200 reimbursement", "Also, if your PP rate is $100, you opt to have the check to you, $300 is applied to the deductible?"], "why_selected": "Matched keywords: charge, rate, per visit, fee, cash based; High engagement (20); Relevance score: 16.5"}
{"thread_id": "thread_1723654938405731", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1723654938405731/", "createdAt_iso": "2025-04-22T11:39:35Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 8}, "post_text": "I have a brick and mortar practice AND work a part time job. I have enough private patients on my waitlist to quit my job now, but I’d be working more and making less than working my job (I’ve been doing it 20 years and am very well compensated). To make sense I’d have to charge $157 vs the $135 I charge now. I am thinking of raising the price to $160 to all new patients (the current ones will eventually phase out), and wait until I am fully booked at new price before I quit. (Mainly because I am on the scared side, and think I will be too scared of changing prices and not having a caseload AFTER leaving my “safety”. At the same time I see everyone on my waitlist and feel I need to get out and see them. Thoughts? Ps: I did quit my job once already a year ago, to realize insurance pays would not meet my financial needs and have to return to my job to be able to ease off insurances.", "comments_text": ["Or…you could be treating half as much and making double (still working a lot at first for sure though) Not sure where you are but here around Boston most clinics are charging around 250/hr including my practice. Unless you’re somewhere that cost of living is extremely cheap I would put my money on it the local plumber might be charging more than you right now.", "A few questions: 1.) what made you start your part-time gig? 2.) how long is your waitlist at present? Time in for eval/visit? 3.) have you raised prices before? 4.) is your goal to move completely to your part-time gig and ditch insurance? 5.) how much more work would you be taking on by making the switch? There’s a lot of things that can be taken care of through automation of processes that take a lot off your plate. These are all questions I ask ppl that I mentor or are on the fence. The initial fear of not having a “consistent” paycheck is real, but you can end up making more in the end with far greater flexibility. In my area, $157 is far below market value for a cash-pay visit. So I would do a little research and see how your prices compare to other providers in the area. Then make your decision 😊"], "why_selected": "Matched keywords: eval, /hr, charge, price, cash-pay; High engagement (16); Relevance score: 16.4"}
{"thread_id": "thread_1433645554073339", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1433645554073339/", "createdAt_iso": "2024-03-19T16:35:03Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 6}, "post_text": "Hello! I have a mobile therapy practice and have brought on ATP specialist to do wheelchair and seating assessments in the home. We are negotiating pay. She is contract and my intention was to pay per units billed, like my other staff, but she mentioned being paid for documentation since it takes significantly longer than a typical eval/treat. I have no problem with this, but I want it to be fair while also ensuring that the practice still makes some sort of profit. This is a new venture, so I'm wondering: * Do other practices pay for doc time after wheelchair assessments, and if so, how much? (Not necessarily a number, but is it at 100% of their hourly treatment rate? I'm considering a percentage of her hourly rate since if it not revenue-generating time). * If you pay for documentation time, do you cap it at, say, one hour, or do you have the clinician tell you how long it took? * Speaking of, how long is a reasonable amount of time to spend documenting a standard wheelchair assessment? (We plan to use a version of the Houston Methodist Hospital fillable form). Thank you in advance!! -", "comments_text": ["I have done custom seating myself at part of my practice and I charge the patient more (cash pay) for these sessions because of the documentation and time to set up demos and coordinate with vendors. It does take time and effort to put all these pieces together. But also an experienced therapist who has their APT should not take long to do documentation. One hour tops even for a complex eval. Straightforward evals take much less time, like 20-30 minutes.", "IMO if you’re paying per unit, documentation of those units should be included in that pay. I.e agree on price per unit/visit/whatever and make it all inclusive and save the hassle."], "why_selected": "Matched keywords: eval, charge, price, rate, hourly; High engagement (12); Relevance score: 16.3"}
{"thread_id": "thread_1680390066065552", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1680390066065552/", "createdAt_iso": "2025-03-03T17:34:48Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 4}, "post_text": "What would you charge for exercise programming? I also see personal training clients (typically non-medicare or Medicare patients who are well beyond therapy discharge) and I'm trying to navigate how much to charge. I'm seeing a client today for an assessment and then he would like exercise programming for a few months. I will likely program a month at a time with the opportunity for weekly check-ins, and for him to message me with his feedback on the workouts, etc. I'm really stumped with how much to charge. I know there are personal trainers out there charging $500 a month for a service like this. I'm still struggling with this as I continue to navigate into the cash only space. I've clearly been conditioned by our crappy health care system to accept crap pay for my skill set and trying to break free of that mindset. Any input appreciated!", "comments_text": ["Depends on your time with them. Whether it is exercise or teaching won’t matter. . Go by 30 min intervals", "I would echo all the above. What are YOU worth and what would make YOU happy from a charge standpoint? Then, estimate approximate hours to serve the individual and you're set. Don't look at anyone else or feel like you missed out on potential pay/feel like you're charging too much. Personally, I feel as though I am worth $200-$250 per hour. Sometimes I feel like it's a lot until I see others charge $350-$500. I got $250 because that's what my lawyer charges. They are the best in their field and so am I."], "why_selected": "Matched keywords: per hour, charge, how much, fee; High engagement (11); Relevance score: 16.2"}
{"thread_id": "thread_1600859794018580", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1600859794018580/", "createdAt_iso": "2024-11-15T18:39:22Z", "metrics": {"reactionCount": 17, "shareCount": 0, "commentCount": 27}, "post_text": "I started a small private Pilates rehab practice out of my home. Im private pay but when asked, will provide a superbill to a patient/client if they want to submit it to their insurance company. I started to see a number of older patients (over 65) for Pilates but also incorporated some balance work, falls prevention and PWRmoves (Im certified in that for Parkinson’s). Im still cash-based but after reading some of the posts online, Im wondering if I can still be a cashed-based business if they are on Medicare. As a PT, If Im providing prevention/wellness services can I bypass Medicare altogether? Im not even a Medicare provider, but thinking I ought to be (not sure of what that entails but thats a separate question ). I would appreciate some guidance on this. Im certain the topic has been covered however there are definitely gray areas so wanted to get some clarification and direction. I’ve just been charging an hourly rate or do bundled packages.", "comments_text": ["I really appreciate the insight. I feel like I can make a clearer distinction for wellness when Im seeing my healthy general geriatric pop. I feel like I run into a problem when I see patients who actually have a diagnosis, for example, my Parkinson’s clientele. Can I stilll provide PWR/dual task, therapeutic exercises (some Pilates based/some not) all out of pocket? I have a handful of people now who want to come specifically for all of these things. Can I still deem it wellness? They all understand Im private pay and are happy to see me regardless. Going forward however, like you suggested, I should be clearer on my intake form and billing. Im currently giving a bill for services the way I would a PT patient. I give them a bill on my letterhead, diagnosis code and treatment codes. I think Ive just done it that way out of habit, not realizing that my 65+ clientele really should have just a wellness bill without codes etc. because I dont want them trying to submit it to Medicare.", "For anyone wondering about how to handle Medicare... I highly suggest taking Anthony Maritato Zero to Paid course. Worth the money. I have a much better idea of what is considered a Medicare covered service and can say that I have successfully incorporated Medicare into my mostly cash based practice."], "why_selected": "Matched keywords: packages, package, rate, hourly, out of pocket; High engagement (71); Relevance score: 16.1"}
{"thread_id": "thread_1516141219157105", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1516141219157105/", "createdAt_iso": "2024-07-22T22:02:06Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 4}, "post_text": "For clients that are traveling from out of state to see you, what is your intake process? I know we have to be licensed in the state we see clients, but with a virtual session…. am I allowed to screen and do a mini-eval to make sure they’re a candidate before they travel? Cash based services for week - long intensives with PT/OT. Thank you! *missouri", "comments_text": ["You have to follow your state regulations so if you can’t treat across state lines, your can’t virtually eval across state lines. A conversation to screen if they would be appropriate to travel to you for an eval would be ok though", "Screen-yes. Mini eval-NO. State licensure laws apply to everyone--regardless of practice set up."], "why_selected": "Matched keywords: eval, follow, cash based; Relevance score: 16.1"}
{"thread_id": "thread_1366566640781231", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1366566640781231/", "createdAt_iso": "2023-12-03T21:57:41Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 0}, "post_text": "I am considering a slight price increase going into the new year to cover an increase in rent and processing fees. Does anyone have a professional sample letter to explain this to my patients or ways to navigate this? I also currently sell packages and as great as they are for the patients based on the discount, I am losing out on per visit revenue. Looking for any insight on pros and cons of keeping the packages! If I did forego the packages, do I still offer it for pre-existing patients that regularly buy them? Thank you! T", "comments_text": [], "why_selected": "Matched keywords: packages, price, package, per visit, fee; Relevance score: 16.0"}
