{"thread_id": "thread_1370718103699418", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1370718103699418/", "createdAt_iso": "2023-12-10T21:15:48Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 3}, "post_text": "Advice appreciated cause I don’t know who to ask! This group is an absolute blessing.… Background info first: I’m a DPT, CSCS with an LLC. Main gig is independent contractor at an ortho clinic and then I see private clients/athletes under my LLC with home visits. I also work for a gym 0-10 hours/week. Clients see me for personal training, recovery sessions, and physical therapy. The gym pays me as their highest level trainer. I do not operate out of the gym as my business, they pay me W2. Clients pay the gym, gym pays me as employee. So this is where all my questions come from with this setup. Most important question: - I offer my home visit LLC clients a superbill obviously since that is my business but a gym client is asking, I said no since she pays the gym and not me (my personal info & medical credentials is not on her bills, she pays for a level X trainer). Is this the right assumption? Is there a better explanation to give her? I said, “I don’t think so but I’ll do some research.” They then asked/suggested if I could write a letter with my info, medical reasons they are being seen and attach a gym bill… I’m not sure how to proceed 🙏 any advice?🙏 Two other questions if anyone has read this far: - Trainers want me to assess their Medicare age clients for minor injuries, HEP, and program advice/modifications. The goals are for in the gym & wellness is not covered by Medicare. Even so do I need to have them sign something strictly because they are consulting with a PT and no cash PT with Medicare eligible? Or should i just be extra clear in my personal documenting? Consent form: - I assume I’m covered by the gym since I’m hired as a trainer but they don’t have anything to help regarding my license (I’m assuming). Because of this should I have those seeing me because I’m a PT sign a consent from my LLC? I have liability insurance under my LLC with the gyms name in the policy. Would a form even be valid in case something happened since the client never paid the LLC but only the gym? In order to be a business you must act like a business but this pay setup makes that quite confusing 🫠. This is my fun job that I’m using to learn from, it’s not permanent but I’d rather not give it up because having a PT license is over complicating it lol", "comments_text": ["I would not provide the gym client a superbill. You are seeing her as a trainer, not a PT. Though you are held to your highest license, if you start providing superbills at the gym you are essentially saying you are performing PT services which is not the intended job there and could get very muddy. If she wants to see you for reimbursable services she would have to see you through your LLC, in my opinion. Please note that all of this is just how I would operate things and is not intended as legal advice. Hope that helps.", "If a gym client wants Physical Therapy give her option of home based or office based treatments not at the gym. Jumping back and forth as a trainer the a PT doing injury assessments and education is creating confusion for you so imagine how confused clients and patients will be. As far as liability in the event something happens and a law suit is filed typically Everyone gets pulled into the suit. Who ever pays the premium is the sole responsibility of that insurance company. Always protect yourself with your own policies even if employers has a policy with your name on it also."], "why_selected": "Matched keywords: first, clients, gym, do , personal training; Relevance score: 72.1"}
{"thread_id": "thread_1183399285764635", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1183399285764635/", "createdAt_iso": "2023-02-15T21:54:11Z", "metrics": {"reactionCount": 14, "shareCount": 0, "commentCount": 0}, "post_text": "Just for fun I thought I'd ask ChatGPT to come up with a sales pitch and a marketing plan for cash services. These are the results I got: \"Invest in your health today and experience the benefits of physical therapy with cash payment. By paying with cash, you save time and money as there's no need to go through insurance claim processes. This means you can get started on your physical therapy journey right away without any delays. Moreover, cash payment gives you more control over your physical therapy sessions as you can choose the frequency and length of each session. So, why wait? Invest in your well-being and make the most of your physical therapy experience by paying with cash.\" Marketing Plan for Cash-Pay Physical Therapy Services Target Market: Our target market is individuals who are seeking physical therapy services and have the financial resources to pay out of pocket. This could include individuals who do not have insurance, have high deductibles or out of pocket maximums, or do not want to go through the hassle of insurance claim submissions and pre-authorizations. Unique Selling Proposition: Our unique selling proposition is that by paying cash, clients will have access to more personalized and comprehensive physical therapy services without the restrictions and limitations imposed by insurance. This includes a personalized treatment plan, longer appointment times, and a more hands-on approach to treatment. Marketing Channel: Our marketing channels will include social media platforms, email marketing, and direct mail. We will also reach out to local gyms and fitness studios to build partnerships and offer promotions for their members. Social Media Marketing: We will utilize social media platforms such as Facebook, Instagram, and Twitter to reach our target market and showcase our physical therapy services. We will post informative articles and videos about physical therapy, share testimonials from satisfied clients, and offer promotions for cash-pay services. Email Marketing: We will create an email marketing campaign to reach out to past and current clients who have expressed interest in our physical therapy services. The email will highlight the benefits of cash-pay services, including personalized treatment plans, longer appointment times, and a more hands-on approach to treatment. Direct Mail: We will create a direct mail campaign that targets individuals who live in the area and have recently been diagnosed with a condition that would benefit from physical therapy. The direct mail will highlight the benefits of cash-pay services and offer a special promotion for new clients. Partnership with Local Gyms and Fitness Studios: We will reach out to local gyms and fitness studios to build partnerships and offer promotions for their members. We will provide informational flyers and posters to be displayed in the gym or studio, and offer a discount on cash-pay services for members who sign up. Promotion: We will offer a special promotion for new clients who choose cash-pay services. This could include a discount on their first appointment or a complimentary consultation. Measuring Success: We will measure the success of our marketing plan by tracking the number of new cash-pay clients, the growth of our email marketing list, and the number of social media followers. We will also track the success of our partnerships with local gyms and fitness studios by tracking the number of members who take advantage of our promotions. Adjustments: Based on the results of our marketing plan, we will make adjustments as needed to ensure the success of our cash-pay physical therapy services. This could include adjusting our marketing channels, refining our promotions, or expanding our partnerships with local gyms and fitness studios.", "comments_text": [], "why_selected": "Matched keywords: first, clients, marketing, gym, fitness; High engagement (14); Relevance score: 71.4"}
{"thread_id": "thread_1363485131089382", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1363485131089382/", "createdAt_iso": "2023-11-28T18:37:22Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 5}, "post_text": "I rent space out of a gym currently for my PT practice and specialize in working with athletes. Referrals from in house have been steady, but not enough to keep my schedule full. (It’s a small private gym.) No surprise that while other gyms and fitness facilities don’t offer PT in house, referring clients to me because I am located in a gym is a barrier. Any advice on how to best approach outside trainers or gym facilities in this situation?", "comments_text": ["Gyms are territorial. It's easiest when they've been your patients and \"get it\" or get the type of client you are looking for. Like anything these relationships take time to nurture, and knowing how much energy to put into the \"right\" relationships. It's like dating, they won't say yes on the first date. Keep showing up if you think it's worth the energy.", "I was located in a CrossFit gym, and got referrals from all the other CrossFit gyms. For me it came down to knowing the individual trainers/coaches at the gyms, not the owners. Owners will be overprotective of their business (which is probably hurting them). The trainers and coaches will just do whatever they need to, to help their clients. If you have contact with the owners, you just need to make sure they know that your goal is to get their members healthy and back into their own gyms as quickly as you can so they don’t cancel their memberships or feel like they are wasting them."], "why_selected": "Matched keywords: first, clients, referrals, gym, fitness; High engagement (11); Relevance score: 45.2"}
{"thread_id": "thread_1669698203801405", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1669698203801405/", "createdAt_iso": "2025-02-18T13:01:27Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 16}, "post_text": "I'm a physical therapist looking to connect with others who have partnered with gyms. I'm interested in learning more about how these relationships work, especially in regards to using gym equipment and bringing in non-member clients. Questions: How do you typically structure your partnership with the gym? Are you allowed to bring in clients who are not members? If so, are there any restrictions or limitations? Do you have to prioritize the gym's members over your own clients? What are the benefits and challenges of partnering with a gym?", "comments_text": ["I do not have a private practice but have been researching here and there for a few years. These are great questions, but unfortunately, the answer is not one-size-fits-all. In terms of amenities and business practices, things may differ between gyms, so it’s essential to know what you want for both your patients and your business. Not allowing non-members would be a major red flag. Everything else can and should be negotiated. If they want member priority, this could be harmful for growth, but you can counter with offering designated member-only times, discounted member rates, asking for lower rent, or requesting marketing support. There is so much ambiguity in this aspect that it will be beneficial to know where you will excel and where you may struggle, so that you ensure the partnership is mutually beneficial and unlikely to lead to future tension. Protect your brand and your values (this is your motivation and drive), ensure a contract is formed (with plenty of reflection and revision), have an exit strategy in writing, and build in a re-negotiation date at a certain checkpoint. As for structure, the most common that you will see are flat rate rent, percentage of revenue, or a hybrid. If you expect very fast growth, then a flat rate may be optimal. If you expect slow growth, a percentage of revenue may be better. A hybrid offers them a guarantee while giving you protection if growth is slow. You could offer a revenue cap where you pay a percentage of revenue up to a certain threshold, followed by a reduction in percentage — possibly even to zero. Another option is a tiered split, where the percentage decreases as your revenue increases.", "Depends on your agreement/contract with gym. I like percent per visit (can be anywhere 10-30% depending on how everything is set up) rather than flat fee, this gives the gym incentive to send people your way."], "why_selected": "Matched keywords: clients, marketing, gym, do , relationship; High engagement (37); Relevance score: 34.8"}
{"thread_id": "thread_1918533988917824", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1918533988917824/", "createdAt_iso": "2025-12-09T17:14:41Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 17}, "post_text": "I’ve been connecting with a local DPC/concierge doc, and we want to formally collaborate. She’d like to be able to pipeline her patients to me, but include my service as part of the fee they’re already paying her (so not just a referral, and then they pay for my service). We are trying to figure out how to make this work so that I am also getting paid what I am due. Could this be as simple as the physician paying me out of petty cash from her practice when I see one of her clients, or do we need to go through credenting and billing as if a traditional clinic? Or something else?? Open to ideas … I have been totally solo an fully cash-based practice for several years, so this is new territory!!", "comments_text": ["I love that you’re thinking through this before you jump in, because the way you structure it now is what’s going to make this collaboration actually work long term. There are a few clean ways to look at it. First option: treat it like you’re getting free leads. If she wants to keep her pricing exactly the same and not rearrange anything, that can still work. The big thing is you cannot let people just show up at your door expecting free ongoing PT. You need a 15 minute phone call with them first so you can set expectations clearly… “Here’s what the eval normally costs, here’s what this first session looks like inside your DPC membership, and here’s what people with your issue typically need in terms of sessions.” Basically give it the full discovery call feel so they understand where the free part ends and where your actual plan of care begins. That protects you and makes the whole thing way smoother. Second option: if she’s planning to raise her prices, then your service can just be baked into that increase. It becomes a value add for her members and she stays whole financially. My guess is she’s probably not looking to raise prices, but it’s still worth mentioning because it’s the most straightforward version of the model. Third option: she pays you directly per person she sends over. If you go this route, compare it to what you’d normally spend on acquiring a patient. If you’re running paid ads, depending on your city you might be paying anywhere from $80 to $150 just to get someone on a phone call. These aren’t cold traffic leads though. These are warm, already-sold referrals coming from someone they trust. That’s worth a lot. Your conversion rate on those will typically be double what you get from ads. If you frame it that way, you can structure a win-win so every patient who needs PT goes straight to you as the default, not “one of several options.” She sells it as part of the experience. You take it from the first call onward. So you’ve got a few models here. Just make sure whatever you choose sets expectations properly and positions you as the consistent PT solution for her people. That’s where this kind of relationship becomes genuinely fruitful instead of chaotic.", "You have to be careful with these laws -the easiest way is to just accept referrals from the doc : Federal Anti-Kickback Statute (AKS): Prohibits knowingly offering, paying, soliciting, or receiving any remuneration (cash, gifts, discounts) to induce referrals for services paid by federal programs (Medicare/Medicaid). Violations are felonies with severe penalties (prison, fines, exclusion from programs). Stark Law (Physician Self-Referral Law): Prohibits physicians from referring patients for certain services (like lab work, PT, imaging) to entities they or their family have a financial relationship with (ownership or compensation), unless an exception applies. State Laws: Many states (e.g., Texas) have independent anti-solicitation or anti-kickback laws that can be stricter. Professional Ethics: The APA and other organizations specify that payments should be for services rendered, not based on the referral."], "why_selected": "Matched keywords: first, clients, referrals, do , relationship; High engagement (38); Relevance score: 33.8"}
{"thread_id": "thread_1445461089558452", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1445461089558452/", "createdAt_iso": "2024-04-06T15:53:41Z", "metrics": {"reactionCount": 124, "shareCount": 0, "commentCount": 24}, "post_text": "This post is for those who are nervous about networking with local businesses. I met with six different businesses over the last two weeks - two small gyms, a running shoe store, a massage therapist, and two Pilates studios. Of those six businesses and WITHOUT ME ASKING: - three offered to host a pop-up for me - one offered to host a workshop “because I have so many clients I know will benefit from this” - the shoe store wants me at local runs they organize as medical coverage “and so you can get free advertising” - one offered to rent me a room should I want a home base - two offered to feature my business as part of their monthly newsletters with their email lists - one Pilates studio walked me down the street to introduce me to a local acupuncturist “because they need to know about your business” Will all of these pan out perfectly? No. But people are far more encouraging than I anticipated. All I did was: 1. Tell these businesses that I want to know where to send my clients (so their biz will benefit from meeting with me) 2. Speak about how I want to fill a need in my community that other PT clinics don’t 3. I was honest in telling these businesses that I just started advertising my services and hope to make it a full time venture. I’ve reached out to about 20 businesses so far and I anticipate many won’t return my messages or be interested in meeting - and that’s okay! So many of you have been encouraging and I really appreciate this community ❤️ I hope this can be a boost for others like me who dislike networking or have been intimidated by reaching out to local businesses.", "comments_text": ["That’s awesome! What did that look like from the start? -did you contact them ahead of time to schedule a meeting, or just drop in on them? -who did you ask to speak with or meet with? -what did you lead with as your first introduction? And how did you talk about your business? -were these businesses that your friends/family already go to or own, or were these “cold” meetings? -at what point did you offer to help them, and how did you word it?", "For those asking, here is a cold email I sent to one of the gyms and feel free to steal: Hi Gabe, I’m happy to see a gym in Gig Harbor that focuses on well-rounded strength training for clients. I have a new business in Gig Harbor as a mobile physical therapist and am looking for the best places to send my patients to build strength and fitness during or after injury, or for my patients who are focusing on performance. From your website, I get the sense that your business is geared towards a wide variety of people! Are there certain types of clients who benefit most from your services? Particular areas of interest for your trainers? If possible, I’d love to come in and say hi or at least talk over the phone. This would allow me to better understand what you offer clients. I hope to meet you soon, and thanks!"], "why_selected": "Matched keywords: first, clients, gym, fitness, networking; High engagement (172); Relevance score: 33.6"}
{"thread_id": "thread_1430445317726696", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1430445317726696/", "createdAt_iso": "2024-03-14T15:54:36Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 8}, "post_text": "Hey y'all, mobile PT here trying to get myself established in my community. I'm reaching out to all the local gyms to introduce myself, say hello, and ask if they're cool with me coming in and working with people who may happen to have memberships at their gyms already. Do you offer to help gym owners/employees with treatment for themselves? What else do you recommend asking gyms when meeting with them? This is all new to me and I feel like I'm horrible at selling myself, but I know I need to put in the work and get out in the community. Any advice is greatly appreciated! I'm meeting with two tomorrow!", "comments_text": ["You should be trying to fill a need that the gym has (people pausing memberships, canceling, etc due to injury). You're selling a solution to a problem they have. Try to find out what their problems are and go from there. Partnership goes both ways.", "I had a few gym owners ask me to look at a client or their own pain as sort of a test to make sure I was good. One uses me if she has clients in my area, the other I actually have a revenue share agreement with so I can hold classes and see patients using his equipment. Other gym owners just brushed me off (one of those just asked if I could work with her gym now lol). It’s been helpful for me starting out because they have the clients and I don’t. Once I get a following then I’ll re evaluate, but never count on more than 30% of business coming from a gym you work with."], "why_selected": "Matched keywords: clients, gym, do , gym owner, starting out; High engagement (20); Relevance score: 32.5"}
{"thread_id": "thread_1040148843423014", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1040148843423014/", "createdAt_iso": "2022-08-26T00:08:16Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 6}, "post_text": "What should I expect to pay for rent? I'm in a 300 sq. ft. space inside a CrossFit-style (not CF branded) gym. I'm good friends with the guy that owns the building and the gym, and he has let me build out the space and get my cash business started rent free thus far. He approached me tonight about starting to pay rent, but left the amount up to me. Obviously as a business owner, I want to tell him $1/month (ha!), but he's a good friend and is also a great referral source, as he's pretty popular in our small town, so I want to come up with a fair price. Pros: Free utilities, internet Gym has almost zero attendance until a bout 5pm everyday Access to lots of general gym/workout equipment Cons: Location on a side street, no frontage on a main road Limited signage Front door is always locked and gym members have a swipe card Gym area has only limited climate control (I do have AC/heat in my clinic area) The owner does not make a profit off the gym, and prefers to keep membership low. It's basically his large friend group, so there isn't a substantial built-in referral base. For those who rent space in a gym, or sublease space in any other facility, what would a 300sq ft room cost? For reference, this is a relatively low income town and low cost of living area.", "comments_text": ["Whatever you decide do research and find an average. Present him the research/average and round up to a nice number. He deserves that respect. Example: average for your square foot is $429/month. I'd round up to $475 or $500 per month. Don't round up too much but whatever you think is enough for him to feel appreciated", "You could start out offering him a percentage like 25 percent of each visit not to exceed a certain total amount per month.That may work while still building and that way your not stressed about always coming up with that set amount each month."], "why_selected": "Matched keywords: gym, do , rent space, crossfit, referral; High engagement (12); Relevance score: 32.3"}
{"thread_id": "thread_1181665415938022", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1181665415938022/", "createdAt_iso": "2023-02-13T23:03:34Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 13}, "post_text": "What are ways have you partnered your mobile PT practice with local gyms ? I’m meeting w an owner and practicing my sales pitch. I want to find his pain points and see how I can fit in. How can I add value by improving their customer retention and new client conversion ? Ultimately another goal is get my practice name into the community so I can get more word of mouth referrals. Unfortunately I am not comfortable marketing myself on social media, I’m better w one to one promotion. My ideas: — Offering onsite 15 min PT screens to existing clients —Offer post or pre work out manual work and stretching — Give individual HEPs to their clients who have a history of injury, and have been discharged from PT —Design different combinations of post workout stretches that could pair up with their small group training programming. Say he agrees, and I do these things— how can I measure if my services are helping his bottom line and to prove my worth ? How do I come up with a fair value to be paid for the time I’m spending doing these things? Or what other ideas do you have 💡 Do I offer discounts on my mobile PT services to their clients ? Do I just ask them to refer injured clients to me? TIA. Pls ask any questions for clarification. I love the expertise of this group and I’m admittedly all over-the- place.", "comments_text": ["My practice is inside a performance gym and it’s wayyyyy simpler to just pay rent. If you’re friendly with the coaches and owners, they’ll refer you people naturally so I definitely wouldn’t mix their bottom line and yours.", "You should pay monthly rent and not give them any piece of your ideas. Just keep in mind, the gym may have competition within such as massage, chiro, trainers, etc. if this is the case, they have no incentive to refer to you bc they are collecting from you regardless and yet can filter the income onto their own resources. So it depends ok the situation"], "why_selected": "Matched keywords: clients, marketing, referrals, gym, do ; High engagement (27); Relevance score: 31.7"}
{"thread_id": "thread_1019776725460226", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1019776725460226/", "createdAt_iso": "2022-07-28T01:04:26Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 5}, "post_text": "Alright y’all. I am ready to at least take the first few steps. I currently work home health but I’m not getting the hours I need/was told I would get. I need to start out small and local because I’m also due with my third kid in 2 months, but ideally this would help support my maternity leave as well. I’m thinking through a couple options 1. Concierge Orthopedics. They do a good amount of the office work, I schedule my clients, develop my POC etc. it appears I can even set my own rates. They help with the business license, mentoring, marketing, social media. 2. Doing my own LLC (anybody have any recommendations for a website to obtain this, thoroughly, quickly, for good price), and getting liability ins (also taking recs) and using the NextDoor App and neighborhood moms Facebook groups to advertise PT and or wellness. One niche would be a bit more wellness but helping moms get back into fitness post partum and/or maintaining during pregnancy safely etc (I have done CrossFit for 10 years and at one point was a coach but have let that lapse) with some baseline knowledge of womens health and willing to learn more. The other niche is stroke and (I’m a certified stroke rehab therapist) with a passion for chronic stroke impairments that have now been “written off” as they can’t get better. They very well may have a ceiling but if we can look at some orthopedic limitations that have developed because of bad habits from prior weakness we can improve some quality of life, muscular efficiency, tolerance, pain, a bunch of stuff. At first glance concierge ortho is appealing because you have help with some of that stuff, especially for someone who has always worked for a company, so the grass roots marketing for myself feels daunting, but also with an upcoming kiddo on the way, having them help with some of that stuff sounds convenient for this season of life. Thoughts?", "comments_text": ["Yeah, unless you're in one of the states that requires a PLLC, just go to your Secretary of State website and file there. You don't need any other resources. I use CM&F for insurance. With the life phase you're in, honestly I'd go the easy route first and then transition after. There's no wrong way, and I love your niches, and you could totally go all in right now and make it work! (Strongly recommend hopping in on the next Bootcamp Josh Payne does, if you jump on the LLC train.) But it would certainly be *easier* to do the \"Concierge Ortho\" option.", "I cannot help you make a decision but depending on the state filing an LLC might be as easy as going to your state's Secretary of State website (it's much cheaper that way)"], "why_selected": "Matched keywords: first, clients, marketing, fitness, do ; Relevance score: 31.2"}
{"thread_id": "thread_1500354407402453", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1500354407402453/", "createdAt_iso": "2024-06-29T02:29:00Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 12}, "post_text": "Question(s) about a cash-based gym opportunity. This would be my first foray into such a practice model so I’m really relying on others’ experience with this. There is a new gym opening in my area. They are offering 10x12 clinic rooms as contracted space. They will provide a scheduling and payment platform/EMR, supplies (including table, needles, IASTM tools, cups, etc). Referrals would likely be easy, because it’ll be gym members and their personal training clients. I would still operate under my own LLC and liability insurance. Their offer is a 50/50 split on whatever income my appointments make. Given the conditions above, does this seem like good terms? If not, what would you say is “standard” in the industry with this type of set up? When we met, I suggested 30 minute appointments at a flat rate of $75 per client, which would include any manual therapy, needling, etc, with the impression these would be the services most clients in the gym would be looking for. Does this seem like reasonable pricing? Sorry if these are questions that get asked a million times. Thanks in advance for any insight!", "comments_text": ["I agree with the above. 37.50 is just what your business gets, not even what you need to pay taxes on, what you pay yourself, and general business expenses which will be taken out of what. That offer would be a big no go for me.", "I think readers misread the post. $37.50 per half hour, $75 per hour isn’t bad if you aren’t paying rent, you aren’t paying for supplies, and you aren’t paying for marketing. That’s not bad. Then you could negotiate a higher rate for clients you bring in that aren’t members."], "why_selected": "Matched keywords: first, clients, marketing, referrals, gym; High engagement (25); Relevance score: 30.6"}
{"thread_id": "thread_969701223801110", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/969701223801110/", "createdAt_iso": "2022-05-18T12:24:57Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 6}, "post_text": "What’s up everyone. I am relatively new in the group. Don’t comment much/post but really value everyone’s expertise and following everyone’s stories. I am in beginning stages of my side hustle. Still work full time for an outpatient hospital based system. Got my LLC and am currently operating out of my home. Have 1 client at this time. Goal is to work up to 4-5hrs/week starting out and scale from there. Reason I was reaching out to everyone is I am meeting with a local gym owner this Friday about possibly renting some space there. Does anyone currently practice out of a gym setting and if so do you have any recommendations/insight on the process of negotiating. I’ve watched some videos/podcasts but was interested in hearing from you all and if you don’t mind sharing what you paid starting out especially if you didn’t have much clientele built up. Price/month, /patient, etc. or whatever you did. Thanks so much! Any and all feedback would be appreciated very much! Have a great day!", "comments_text": ["Hey Joe! I practiced out of a gym for a while, ended up shifting to another location because the accessibility/parking at that gym really limited patient's ability to get there. A few things I'd recommend...if you're keeping your volume small for a while like you mentioned, commission-based pricing is okay but in the long term you want a fixed rate. Even $10/patient may seem small but if you're up to 30 patients a week suddenly you're paying $1200/month so that will backfire unless you make it clear from the get go that you'll do commission short-erm up until you start seeing X patients then switch to a monthly fee. Remember that you're a big asset to the gym...you are helping them be more marketable and that should reflect in a relatively low rent - I paid $700/month which included full access to the equipment and a private treatment room. They also gave me the first 2 months free to get myself set up and get clientele in the door which was a massive help. Make sure there is adequate parking and it's easy to get to. Due to my experience, that would be a deal breaker for me. Do workshops at the gym. Volunteer your time 1 night a week (or charge a small fee for the workshop, either way) while you're getting going...present on things they want to hear...how to improve your overhead stability...how to lift and strengthen your back...how to improve X mobility for X lifts...how to strengthen your rotator cuff to avoid shoulder pain etc etc etc..."], "why_selected": "Matched keywords: first, gym, do , gym owner, starting out; High engagement (17); Relevance score: 29.4"}
{"thread_id": "thread_1189567475147816", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1189567475147816/", "createdAt_iso": "2023-02-24T04:45:09Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 29}, "post_text": "Big question for ones who are practice with a gym and is hybrid: A new gym opened, offering a PT room to solely just one PT. They’re charging a rate of $2,000/mo and do not take any percentages and have only on PT on site for the gym. Still being a new practice and currently mobile, the gym itself is an ideal set-up, but I’m still trying to build clientele. I believe the gym is 18,000sq ft and trainers would refer their clients to me. I’m just anxious of having that big of a monthly payment with low clientele. Wanting to build it up first. Thoughts?", "comments_text": ["I have this exact set up. But in my opinion $2000 is way too high. I would try to negotiate a lesser amount. $1200 max. Or try to negotiate a cost per visit so the gym is incentivized to send you clients.", "Maybe explain your concerns and negotiate an “on ramp” period where you might pay like $1000 the 1st month, then $1500 the 2nd month, then the full amount to give your time to build up your clientele and income?"], "why_selected": "Matched keywords: first, clients, gym, do , new practice; High engagement (60); Relevance score: 29.1"}
{"thread_id": "thread_1029750301129535", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1029750301129535/", "createdAt_iso": "2022-08-21T14:11:12Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 3}, "post_text": "For all you uncaged folks who work out of gyms… What’s your arrangement look like? At a small impasse with one of the gym owners I work with. He wants me to be there for set hours (takes up my entire day one day a week- I can’t fit patients before or after my gym arrangement on that day) Essentially- wants a PT on retainer. He wants me there even if I have no patients scheduled for the relationship building aspect. Initially- totally fine, I had nowhere else to be, happy to give my time. Now as things in my mobile business get busier, I’m finding myself reducing available hours to paying patients to essentially go burn time. Sounds like he’s not too interested in continuing the relationship with me if I’m showing up only when there’s work to be done. He doesn’t pay me, and I don’t give him kickback or pay rent. Been there a few months consistently so I feel that at this point, his gym members know I’m there for them if they need me. I’m great about responding to texts and calls. I don’t want to disappoint anyone or burn bridges/ throw away an opportunity, but from a business standpoint the current setup doesn’t make good fiscal sense, and it sounds like he’s pretty inflexible with the idea of change. Any advice or input appreciated. As PTs would y’all just continue on and keep set hours on days you don’t actively have patients to see? Is that nuts, or is that sort of thing just the necessary sacrifices of early business ownership?", "comments_text": ["I don’t have my own PT clinic or practice but just speaking out of business experience: if you’re not paying rent or have any obligation to the gym, why does the owner insist you have regular hours? What’s the benefit to the owner? Does the owner want clients to drop in and see you for advise, without an evaluation? Clients are expected to make an appointment for which you get paid. if the gym isn’t paying you, you’re not available for “FReE”advise. Or was the arrangement that you’re available to all gym clients unless you have a paying client?", "I would recommend moving on. There are other people out there to network with. Not all may be a good fit. This certainly sounds like one of them"], "why_selected": "Matched keywords: clients, gym, gym owner, relationship; Relevance score: 29.0"}
{"thread_id": "thread_1507056220065605", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1507056220065605/", "createdAt_iso": "2024-07-09T02:07:19Z", "metrics": {"reactionCount": 9, "shareCount": 0, "commentCount": 29}, "post_text": "I am currently a PTA working full time in home health but I have experience in almost every setting. I consider myself a pretty good PTA. Before I was a PTA I was a personal trainer for almost 10 years, and the top trainer at my gym for a while. I’ve been working out all my life pretty much. I’ve had multiple patients ask me to work with/train them after being dc d. I want to help more people, but get paid more. I’m considering going down to PRN and starting my own thing. I would advertise as a personal trainer but also use corrective exercises, posture exercises, etc. I have a really nice home gym, I could go to there home and I have things to take to there house, or I could do online training if they needed that. I feel like this could be a good small business for myself? What do you all think? Any past personal trainers turned into therapist ever thought about this?", "comments_text": ["David Bayliff who in the group is the PTA that is totally crushing it right now at his gym?", "Physical therapist turned trainer. Do it as a side gig, LLC, insured, out of my house. Less paperwork and my clients WANT to work. Win win!! Do it!"], "why_selected": "Matched keywords: clients, gym, do , trainer, advertis; High engagement (67); Relevance score: 28.1"}
{"thread_id": "thread_1784979808939910", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1784979808939910/", "createdAt_iso": "2025-07-08T15:00:50Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 1}, "post_text": "🔥 Still chasing algorithms and ad hacks to grow your practice? Here’s the truth: Your *clients* can be your best marketers — if you help them know what to say and who to say it to. 💬👥 In our newest blog, we walk you through how to turn casual conversations into powerful referrals using a few simple shifts: ✔️ Paint a clear picture of WHO they should refer ✔️ Celebrate their wins and give them a story to share ✔️ Build genuine relationships ✔️ Use clear, powerful directives that stick 👏 This isn’t “just be nice and hope they tell someone.” This is strategy. That *works.* 🧠 Read: *“Building Word of Mouth Marketing”* 📲 [https://www.uncagedclinician.com/post/building-word-of-mouth-marketing] Let your clients become your most valuable marketing team — and pay you to do it. #UncagedClinician #WordOfMouthMarketing #ClientReferrals #PracticeGrowth #PTBusinessCoach #OTMarketing #HealthcareEntrepreneur", "comments_text": ["WORD OF MOUTH = Marketing that doesn’t take any of your Time, and it doesn’t cost you Dime!!"], "why_selected": "Matched keywords: clients, marketing, referrals, blog, do ; Relevance score: 28.0"}
{"thread_id": "thread_1014784455959453", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1014784455959453/", "createdAt_iso": "2022-07-21T02:01:37Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 8}, "post_text": "Was asked to do a training on injury prevention for personal trainers who work at my local gym. How do I price this? This is a small gym and the owners (who are trainers) already refer to me. This would add referrals as their new trainers would get to know me, so it’s a great thing for me to do for outreach, but I also don’t want to undervalue my time. It’ll be an hour presentation and about 2 hours prep.", "comments_text": ["I think it’s important to understand that the largest payoff one could have from a workshop is clients signing up. If you get good at this, you can convert up to 40-60% of attendees into evaluations. The point is definitely not to make money on the front end, but to invest your time to serve the community with a much larger financial return on the backend. IMHO I think it’s very poor advice above to charge a high dollar amount for a workshop that is designed to: a) serve the community and b) convert clients to paid clients (which is where you can truly help someone and change their life). Remember: No one’s life truly gets changed from attending one workshop. When they decide to take action and take care of their problem for good is where the magic happens. Free or a nominal fee per person. And if you charge a nominal fee per person ($15-$50 per person), I even recommend giving 100% to the gym or the location that let you do the workshop. Givers gain.", "There has to be some type of price so they understand your worth. And then if they want to barter some thing else, I would go for what they offer in the negotiation￼"], "why_selected": "Matched keywords: clients, referrals, gym, do , trainer; High engagement (17); Relevance score: 27.4"}
{"thread_id": "thread_1303520480419181", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1303520480419181/", "createdAt_iso": "2023-08-21T19:14:38Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 19}, "post_text": "Hello! Looking to start my own practice within the next 5-6 months and have the option to rent a space at a local CrossFit gym. Curious what pros/cons you have experienced when having an office at a gym! I searched the group and didn’t find exactly what I was looking for. We discussed paying a lower monthly rent with an additional fee based on hourly gym equipment usage. Approximately 400 sq ft. Thanks!", "comments_text": ["I’ve built my entire business out of CrossFit gyms. Depends on the population you want to treat. My ideal client is a CrossFitter, so nobody has minded the music or noise. I’ve had a lot non-CrossFit clients go on to join the gym afterwards even. I just pay hourly with a cap. Use of equipment is included. I’ve never had an issue with CrossFit gyms not wanting their members to go to other gyms for rehab. I get sent people from most of the gyms in the area without any issue. They want their members healthy and back in class.", "I know many people including myself that have started and grown very successful practices inside of CrossFit gyms. A sliding scale initially is a great idea if they are up to it. Basically assume the “full time” price and work backwards form there If I was working here full time it would be this price then adjust for 30 hrs or 20 hrs or 10 hrs etc."], "why_selected": "Matched keywords: clients, gym, crossfit; High engagement (38); Relevance score: 26.8"}
{"thread_id": "thread_1252083442229552", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1252083442229552/", "createdAt_iso": "2023-05-30T23:31:21Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 10}, "post_text": "HELP! I need some advice! I’m currently in a crossfit gym and they are most likely going to close down. I have the opportunity to move in a 2000 sq foot office however cost for that space ranges from 2600-2750 per month. In my area, 2000 sq ft goes for 4K a month. I had a great month of March but things have been slowing down the last two months. I don’t know if I should take the leap and get the space. I did get an offer from another crossfit gym in another town to lease out 850 sq ft for $800. However, that is only making a lateral move not a progressive one. Curious if anyone would take the leap despite things being slow or going for a cheaper and safer bet and moving into another crossfit gym in another town?? Any advice would be appreciated. 🙏🏻🙏🏻", "comments_text": ["How does the 2000’ space fit into your long term plan? Do you plan to hire and grow? How many therapists/ visits per month could that space accommodate and does that align with your goals?", "This is my perspective coming as someone who does CrossFit and is a fan of it. CrossFit seems somewhat shaky as leadership continues to change and they don’t provide adequate or the best support to affiliate owners (this may be localized to where I’m located, but I see it a lot on comments on their online platforms as well). More gyms are starting to close. Taking that into consideration, you really need to evaluate the new CrossFit gym you are looking at if that’s really the move you want. How are they marketing? Are they attracting the clientele you want to treat? How many new members are joining on average monthly? All of that considering if you are trying to use them as a referral source."], "why_selected": "Matched keywords: marketing, gym, do , crossfit, referral; High engagement (22); Relevance score: 25.6"}
{"thread_id": "thread_1225030881601475", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1225030881601475/", "createdAt_iso": "2023-04-19T11:29:31Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 51}, "post_text": "Is anyone using red light therapy beds in their practice? We’ve had multiple inquires about it recently as there is no one in our geographical area offering it so we’ve star￼ted to research it more. What are you marketing it for: pain/inflammation relief, neuropathy, sports recovery, body contouring & weight loss? What kind of results are your patients/clients achieving with it?", "comments_text": ["As a Pelvic Health PT, I use an inter-vaginal red light device to promote increased self-lubrication and decreased pain. This is really important during peri-menopause and while breastfeeding since estrogen levels decrease (this can lead to a lot of dryness in the vaginal canal). Usually topical estrogen creams are the go-to intervention for vaginal dryness, but many of my clients prefer the red light because there is no risk of chemical SE and they like the idea of not using synthetic hormones. My clients are huge fans and see results within a few weeks using red light! Other than using red light inter-vaginally, I don’t currently have any panels or beds in my clinic. I personally use a Joov red light panel every morning that I meditate in front of. My dad become very curious about red light therapy for athletic recovery after hearing that many collegiate football teams have installed red light rooms in their locker rooms! This was a big selling point for him and he now purchased his own red light panels to use at home. Since red light targets the mitochondria of the cells it contacts and increased cellular output/function, it helps to optimize most body systems. Because it can be so broadly used, I would inquire into what exact uses your clients are looking to use it for and perhaps design your marketing around that!", "I don’t have a bed, but I have several pads that I use. I advertise it for pain control and tissue mobilization at a cellular level. My clients really like it. My mom used a pad for 10 min after having knee pain for weeks and walked away with zero pain, and I did nothing else to her knee."], "why_selected": "Matched keywords: clients, marketing, athletic, advertis; High engagement (105); Relevance score: 25.3"}
{"thread_id": "thread_1104142727023625", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1104142727023625/", "createdAt_iso": "2022-11-09T18:40:08Z", "metrics": {"reactionCount": 8, "shareCount": 0, "commentCount": 37}, "post_text": "Hi guys, How do you guys contact gyms, yoga studios, or any facilities that you want to build a relationship with? What type of marketing do you do? I am starting a cash based mobile PT practice but unsure how to get started on marketing. I am in the process of completing my website right now. I would appreciate any insight!", "comments_text": ["I just started my cash based mobile PT business about month ago. I stopped by some local gyms/studios that had a similar mission. When speaking to the owner, I told them how I could benefit them by keeping their members healthy or help them recover quickly from an injury. Now they are putting my info cards in all of their new member bags. I'm also providing inservices to their trainers.", "Give more than you take. That’s super important when starting relationships. I highly discourage going in to meetings/emails just touting what you do and how you can help their clients. I suggest trying their services out, taking some of their classes, collaborate on a workshop/event, build a relationship—this takes time."], "why_selected": "Matched keywords: clients, marketing, do , gym, relationship; High engagement (82); Relevance score: 25.2"}
{"thread_id": "thread_974898513281381", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/974898513281381/", "createdAt_iso": "2022-05-25T20:20:46Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 16}, "post_text": "Rental space dilemma: After one person commented that being in the CrossFit gym could quickly stifle my growth I decided to see what else was out there. So I stumbled onto a 1000 sq ft commercial office space with pretty easy access to the freeway. This space would offer me two 11.5 ft x 7.5 f (90 sq ft) treatment rooms, access to a shared kitchenette room, and a main room with private entrance to it that is 20 ft x 40 ft (800 square ft). The price for this listing would be $1000 which includes all utilities, WiFi which they said they would have a WiFi hub added to my end of the building, and no CAM fees. The place is also only 15-20 minutes from the house plus a good fairly central location in Utah County. Oh it would also be a 1 min drive to another one of RxFit’s CrossFit gym which is the gym I’m a member of. I would be sharing the building with a Real estate company whom is the owner of the building. He seemed really interested in getting me into the space and talked about having a couple other offers, most likely a sales tactic, but said he didn’t want them and thought I would be a good fit for the place. Once again probably a sales tactic, but he definitely seemed interested like they would modify whatever I needed to help make the space more suitable. So weighing in this space against the CrossFit gym space I feel like I would be an absolute idiot to not seriously consider it as an option. Thoughts?", "comments_text": ["Prior to becoming a PT, an old Crossfit gym of mine had a PT and massage therapist rent a space inside. All I could ever think of was how it would be difficult to communicate with clients (or to relax when getting a massage) with music always cranked up and blasting really loud during your business hours and having no control over that.", "What is your 3 or 5 year plan? We can fill 2,000 sq ft really easily with 2 clinicians. I have owned and relocated over 10-clinics and my first was 800 sq ft, but 2K sq ft is about the best size for us. ..."], "why_selected": "Matched keywords: first, clients, gym, crossfit; High engagement (34); Relevance score: 24.8"}
{"thread_id": "thread_1786773515427206", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1786773515427206/", "createdAt_iso": "2025-07-10T21:22:26Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 10}, "post_text": "I was able to schedule a meeting with the owner of anytime fitness near me for a possible Physical therapy collab. For reference, I am a mobile physical therapist. What are some pros I can highlight to show the benefit of physical therapy 😊 what is beneficial for them? This is my first time doing this so I am a bit nervous. And also how do I maximize my personal benefit of having a gym that I am able to work through? Thanks!", "comments_text": ["Don't talk about you. Ask them what their problems are and solve those. When talking with gym owners, I tell them that I want to help their members stay healthy and fit so they can KEEP going to their gym which ultimately means less cancelled memberships for their gym.", "Tell them you will increase memberships as you will help those that wouldn’t feel comfortable at the gym, stay at the gym once you discharge them. They want paying members!"], "why_selected": "Matched keywords: first, gym, fitness, do , gym owner; High engagement (22); Relevance score: 24.6"}
{"thread_id": "thread_1183912139046683", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1183912139046683/", "createdAt_iso": "2023-02-16T15:42:29Z", "metrics": {"reactionCount": 5, "shareCount": 0, "commentCount": 7}, "post_text": "How are you getting your referrals? Marketing ideas? i’ve gone to different Primary MDs, Home Health agencies? Maybe i’m missing something because we’re struggling with getting referrals. I have a hybrid business model offering PT and OT with specialty for wound care and lymphedema. We take cash, Medicare, and BCBS. Located in Chicago.", "comments_text": ["Think outside your typical referral sources. Go straight to the consumers. Offer free workshops with support groups, libraries, gyms, etc. Teach basic anatomy and give them a taste of why they would want to work with you. Just ask for name and email to start your own distribution list.", "I tried marketing to the same for awhile my 1st year in practice and got no where. But keep at it. Within the last 6 months I've had 2 doctors start referring to me regularly. It helped that the patients I saw from them gave me raving reviews during their followups, so they started sending more to me. My business coach also says it takes 12+ 'touches' to make someone interested and purchase from you, so just have to keep consistent with it. Most of my referrals come from word of mouth, previous patients, friends and family. Just starting to get some more from Google and my website."], "why_selected": "Matched keywords: marketing, referrals, gym, doctor, referral; High engagement (19); Relevance score: 24.5"}
{"thread_id": "thread_1195784311192799", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1195784311192799/", "createdAt_iso": "2023-03-04T21:22:23Z", "metrics": {"reactionCount": 30, "shareCount": 0, "commentCount": 58}, "post_text": "I’ve been a cash based therapist and personal trainer for a year now working out of my home studio. I’m still really struggling with my fees. My therapy clients are my easiest. I see them, they leave, and I’m done. My personal training clients require significant more work. I see them, they leave, then I’m busy making exercise programs for them, finding an inspiring podcast or article for them to read, analyzing their nutrition logs for them, etc. It seems as if I should be charging more for using the skills of my therapy/masters degree, however so much more work is involved with my personal training clients. 1/2 my clients get a combo of both services. So how would you break down fees for services? Just have a flat fee for all my services regardless of what they are receiving? My other problem is 50-75% of people that email me inquiring my service rates don’t respond after I tell them. In comparison to all the other local gyms (I did my research) I’m on the lower side. Thoughts? (Latest social media post photo for the hell of it.)", "comments_text": ["Same rate you offer your rehab patients. You are practicing at your highest degree and your admin time should be considered.", "Personally I’d charge a higher price point because although I may wear many hats, what’s underneath the hat is always the same. You’re always going to be thinking at your highest skill level and you’re a good PT who cares about motivating your clients, know your value. The clients who pay for having a good PT who also trains (because it’s not as common as you may think) are the ones you want to keep anyway. Charge more so you can provide a better product and ultimately work less"], "why_selected": "Matched keywords: clients, personal training, gym, trainer, social media; High engagement (146); Relevance score: 24.5"}
{"thread_id": "thread_1660169954754230", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1660169954754230/", "createdAt_iso": "2025-02-05T15:42:56Z", "metrics": {"reactionCount": 6, "shareCount": 0, "commentCount": 3}, "post_text": "🤔 How can clinicians break free from the cycle of heavy marketing and temporary client surges to achieve a more sustainable flow of business? 🤔 What are the four key pillars of business success, and how do they contribute to long-term stability and growth for clinicians? Today, we’re focusing on how to secure long-term success for your business. Many clinicians experience a cycle of heavy marketing, getting fully booked, and then facing a slowdown as new clients stop coming. It's a tiring pattern. This episode is for those who want to break free from this cycle. We'll explore strategies to streamline your marketing, sales, and operations to maintain a steady flow of clients without burnout. Join us to learn how to keep your business thriving consistently. In this episode, we'll cover the following topics with you: ✅ How to break free from the client acquisition rollercoaster ✅ The four key pillars of business success: Marketing, Sales, Service, and Operations ✅ Questions to ask when auditing your marketing efforts ✅ The importance of ethical sales and effective client recommendation Listen Now 👉 (Spotify and Apple links in the comments below) 👋 We invite you to schedule a 30-minute growth strategy call with us Here! 👇https://uncagedclinician.com/schedule #uncaged #uncagedclinician #2025 #marketing #sales #service #operations", "comments_text": [], "why_selected": "Matched keywords: clients, marketing, do ; High engagement (12); Relevance score: 24.3"}
{"thread_id": "thread_1007798503324715", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1007798503324715/", "createdAt_iso": "2022-07-11T15:28:55Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 2}, "post_text": "Hi all I’m new here and first time posting a question, but I’m starting a cash pay PT clinic within a CrossFit gym. It’ll actually be a service offered by the CrossFit gym — so it’ll be part of the umbrella company that the gym is under… I’m located in TN and was wondering the following: What are the laws in TN surrounding practicing in a gym setting as it relates to advertising? Also as it relates to you being a W2 employee. Owner questions regarding PT practice setup: Do we (Magnistrength LLC/DBA Full Steam CrossFit) need some kind of license as a business to allow you to practice and advertise your services? Do I need specific insurance to add or is there insurance you can pick up to practice independently? Thank you 🙏", "comments_text": ["TN state practice act outlines Advertisement regulations. https://publications.tnsosfiles.com/rules/1150/1150-01.20180709.pdf"], "why_selected": "Matched keywords: first, gym, do , crossfit, strength; Relevance score: 23.8"}
{"thread_id": "thread_1224521811652382", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1224521811652382/", "createdAt_iso": "2023-04-18T13:51:34Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 14}, "post_text": "Hey everyone! 3 questions I am starting my own ortho/sport practice and partnering with a small gym/training center that tailors to golfers. I will be working more into that community but, I'd like to bring in outside sources too because it's fun to switch up what you treat 🙂 -Starting out, what were your most productive forms of generating leads? -For those who did tabling events/ortho screens what marketing materials and pt equipment did you bring to your setup? -For reaching out to MDs for referrals, what have you found is the best approach? Thank you all for any advice! Its a scary but fun time starting out", "comments_text": ["Just remember when you’re starting out the easiest way to generate leads is doing a great job with each client and “word of mouth” spreads! With each proof of concept client in the early part of your practice, your confidence grows and so do your referrals. 😉 I’m 7 years in and still haven’t looked back. It’s hard work, but very rewarding.", "Hi Lindsey– Congrats on starting! We started a running-focussed practice in the past. What worked pretty well is becoming part of several niche athletic communities, schools and providing value there sporadically (advice, prevention, etc)– For example offer free injury screens at events or training sessions. And also listing on Google maps with a physical location! That's where people look for when they are looking for a PT. They Google 'Physical Therapy in XYZ', or 'PT Near Me'."], "why_selected": "Matched keywords: marketing, referrals, gym, do , ortho; High engagement (32); Relevance score: 23.7"}
{"thread_id": "thread_1877358229702067", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1877358229702067/", "createdAt_iso": "2025-10-22T16:13:13Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 9}, "post_text": "I am starting my llc, and will be a 1099 employee/sole PT at a boutique personal training gym. I have zero experience with owning my own business, and feel like I have a steep learning curve as I'm still a fairly new PT, with my only experience being in hospital OP. The owner of the gym is an ATC, and I am happy with our agreement, where I am not leasing my space for a set rate, but we have a 30/70 split for each patient I see. With having access to a beautiful and well equipped gym, treatment room, showers, marketing assistance, etc, I am happy with taking home 70%. This will also be 100% cash based. Someone mentioned that fee splitting may be an issue, but I'm not seeing anything specific to cash based services. This isn't a kickback situation from physician referrals, and I am not dealing with Medicare. Am I missing anything? I don't know what I don't know at this point.", "comments_text": ["I know you are happy taking 70%, but want to throw out some numbers for you to think about. If you make $10,000 a month, you owe the gym owner $3000 which is a lot of money for your rent set up. You take $7000 but also need to pay taxes out of that $7000. I would run some more numbers to make sure you are ok with that income", "Fee splitting allows them access to your books. Have u thought of a flat fee per patient?"], "why_selected": "Matched keywords: marketing, referrals, gym, personal training, gym owner; High engagement (18); Relevance score: 23.5"}
{"thread_id": "thread_1235635113874385", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1235635113874385/", "createdAt_iso": "2023-05-05T18:10:09Z", "metrics": {"reactionCount": 97, "shareCount": 0, "commentCount": 13}, "post_text": "\"$500k/year\" That's what someone just told me they had sitting there unbilled or clients that are being turned away because they can't find qualified therapists. First- it's amazing what our clients are accomplishing in their practices that this is what's waiting in referrals and being turned away. But more importantly than that, it gave me an opportunity to talk about something I've been noticing a lot recently. Many people and potential clients of Uncaged only want to talk about how to grow a business and how to make $$$$ in a practice. They LOVE talking about the ENGINE of a business but very rarely talk about the BRAKES of a business. Are brakes sexy? no. It's way cooler to talk about how many horsepower a car has But one of the quickest way to derail your practice/business is to sacrifice the quality of care, delivery, and boundaries. Don't build a business that is all horsepower and no stopping power.", "comments_text": ["Amen! I’ve found my business really flourishes when I say no to the opportunities that don’t feel right but have $$$ potential and yes to the opportunities that resonate with how I want to practice as a clinician. Takes guts and faith to trust the process.", "Turning business away is hard. Often we hold on to it too closely and when we tell people \"no\" we feel that we're letting them down. I still have to untangle from this in a non-clinical role... and I was REALLY wound up in it while working clinically. (Mostly because if I said no, they had to drive for hours to find another OT... which sucks.) But you're SO RIGHT that when we focus on our areas of strength and pass on the opportunities that are outside of our zone -- we do more good and impact more lives in the long run. I've been leaning into this more this year and every time I say \"I need to pass this project to someone else\" I cringe, but it allows me to stay in my zone and find the best fit clients. 🙂"], "why_selected": "Matched keywords: first, clients, referrals, do , referral; High engagement (123); Relevance score: 23.4"}
{"thread_id": "thread_1550320069072553", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1550320069072553/", "createdAt_iso": "2024-09-10T23:24:49Z", "metrics": {"reactionCount": 10, "shareCount": 0, "commentCount": 2}, "post_text": "You've probably seen emails and posts regarding the ***UNCAGED CLINICIAN Launchpad*** program. If so, we know that we've given a general overview of what the 10-week program entails. Over the next few days we want to break it down for you even more to help you decide if Launchpad is right for you. Week 1 is an introduction into leadership and business. We want to help you to establish the building blocks that create a solid foundation for your marketing. In other words, the little things that help to make marketing simpler. Week 2 expands upon week 1 for creating a solid marketing foundation. Here's the good news: you will hear more about marketing throughout the course. Why? Because a solid marketing strategy is a whole lot more than stopping by doctor's offices or running a Facebook ad. Those things are side dishes. We want to give you the meat to marketing. If you already know that our Launchpad is the right choice for you, sign up and get started today! (Link in Comments) Have questions? Schedule a call with us. (Link in Comments) Be a part of a community that is *Uncaging Clinicians & Revitalizing Healthcare!* **The UNCAGED Team **", "comments_text": [], "why_selected": "Matched keywords: marketing, doctor, launch; High engagement (14); Relevance score: 23.4"}
{"thread_id": "thread_1322702725167623", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1322702725167623/", "createdAt_iso": "2023-09-23T00:19:34Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 5}, "post_text": "Hi uncaged crew, I’m going to talk to a CrossFit gym and discuss ways we can partner. I’m curious what recommended partnerships may look like. What should I avoid? Any recommended ways to make it mutually beneficial as a business? Any feedback would be great.", "comments_text": ["I have my practice out of a crossfit gym and I have been hosting clinics each month focusing on specific body regions and am collaborating with the head coach on a 5 week clinic focusing on the oh squat and snatch. I joined the gym and am immersed in the community so I see what people need and then I find a way to help with that.", "Agree with Scott Hopson. One of the best things you can do is immerse yourself in the community (the gym). Look for opportunities to SERVE the gym first. Resist the urge to immediately look to “take”. Also, build the relationship based on authenticity vs “referral fees”"], "why_selected": "Matched keywords: first, gym, do , relationship, crossfit; High engagement (13); Relevance score: 23.3"}
{"thread_id": "thread_1183066749131222", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1183066749131222/", "createdAt_iso": "2023-02-15T12:43:39Z", "metrics": {"reactionCount": 6, "shareCount": 0, "commentCount": 47}, "post_text": "Can we talk social media? Have you found social media presence to be a big boost to your business, and if so, which platform has worked best for you? I'm toying with the idea of really increasing my presence on Instagram. Honestly I love the platform so it would be more for fun, with minimal expectation, more as a hobby, and to learn. But I know it's a time consuming venture so was curious if over time you had true benefits to your business doing this? Or did you find it to be a total time suck?", "comments_text": ["This is such a great conversation because I recently hired a virtual assistant/marketing firm to help me grow (and serve) my presence on social media. ￼At the end of the day it’s the last thing I gave energy to do. We see geriatrics, PD, vestibular a post op primarily. It’s been helpful for clients and their families two see us in action and get a little bit of community. ￼We’ve had no direct client growth but have “secured” clients as they reported “we saw your legit.” 😊", "I think it would depend on your demographic. My patients are mostly older and I get most referrals from word of mouth and home care therapists. The only patients I received from social media were family members of friends who saw I had started a business. If you are treating younger people I would think it might be helpful. Personally I prefer making connections in real life especially being mobile and going into peoples homes."], "why_selected": "Matched keywords: clients, marketing, referrals, instagram, referral; High engagement (100); Relevance score: 23.3"}
{"thread_id": "thread_1371315296973032", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1371315296973032/", "createdAt_iso": "2023-12-11T22:00:08Z", "metrics": {"reactionCount": 6, "shareCount": 0, "commentCount": 32}, "post_text": "I have a former patient who wants to hire me for wellness to help him to work on overall strength. I’m driving to him and told him that my rate is $150/session. He’s agreeable but doesn’t think he can afford to see me often. Am I pricing myself out or just setting my value? Considering offering him a lower rate to see him more often too.", "comments_text": ["I was always taught that if you don't value your time, nobody else is going to do it for you 🙏", "If they want strength- they can find a trainer for $50/hour at the local gym. If they want a doctor of PT with unlimited expertise in healthcare as well as being the top specialist in strength and conditioning, who also travels as concierge, $150 is a steal. Do not change that price. Sometimes I’ll consult with their trainer as a courtesy. So they’ll see me for PT and they can get adjunct strengthening from the trainer. I do the same for massage therapists, chiropractors, etc. If they truly want your time and your expertise, they just have to pay for it. You can give them that option and I guarantee they’ll choose you."], "why_selected": "Matched keywords: gym, do , doctor, trainer, strength; High engagement (70); Relevance score: 23.1"}
{"thread_id": "thread_1371764746928087", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1371764746928087/", "createdAt_iso": "2023-12-12T16:56:16Z", "metrics": {"reactionCount": 7, "shareCount": 0, "commentCount": 18}, "post_text": "Does anyone have recommendations/advice on how to do better marketing? Specifically via social media/Instagram to gain folllowers? I now have online fitness programs up on Everfit app and trying to find ideas on how to better market the programs and gain clients. Marketing to my womens mountain bike club of 3,500+ ladies hasn’t been enough so far. 😒", "comments_text": ["Be consistent, pool your audience to know what they want to know, create content around what they want to know and not what you think they want to know, be consistent and post daily.", "Don’t overcomplicate it. Just provide value. Post simple videos or text posts answering a common question or issue your clients run into. Do NOT get caught into the trap of trying over explain yourself in your caption (we all do it). Because then it will take you like 45 minutes to make 1 post. Keep things as simple as you can and try to make each post just 1 main thing you are trying to get across. Don’t worry about editing posts or anything. Just post. Show your personality (people work with people they like). See what works and what doesn’t. Go from there. Why would somebody want your program? What are they going to get out of it? And I don’t mean “get stronger, more fit, etc etc” because every program ever says that. What actual problem will your program help solve for mountain bikers? What are the things people complain about most often? Stay on the bike longer? No longer need long rest breaks once you get to the top? Don’t try to just post stuff on the mountain biking group to market, just be in there a lot and answer questions and show them you are knowledgeable and eventually people will reach out to you. Think of social media marketing as farming. Just keep planting seeds, and then eventually you’ll be able to harvest them."], "why_selected": "Matched keywords: clients, marketing, fitness, do , content; High engagement (43); Relevance score: 22.9"}
{"thread_id": "thread_1880572939380596", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1880572939380596/", "createdAt_iso": "2025-10-26T02:25:24Z", "metrics": {"reactionCount": 29, "shareCount": 0, "commentCount": 97}, "post_text": "I have an employee who is planning to start her own clinic and take some of our patients with her. I was trying to be chill about it as it is a neuro caseload and our bread and butter is hand therapy. I have, though, put a ton of money and effort into building that caseload. Over the last couple of weeks, she has given her new card to people and has even said to me that she’s getting credentialed with such and such insurance so she can take patient x. It has felt very triggering and stressful so I have decided to let her go now rather than letting her work a few more weeks for me. She is acting like I am being very unreasonable. Am I being unreasonable?", "comments_text": ["That is not ok of that therapist. Whenever I’m leaving a position, I’ll only tell them where I’m going if they ask and I stay vague without offering any information. If they persist, I’ll take their number and if they reach out, they have a right to stay with someone they’re comfortable with. Soliciting for a direct competitor at your workplace is really not ok", "While a non compete is hard to enforce, you can’t prevent people from working. Poaching clients is different. That is a non solicitation agreement. Here are some options: Potential legal claims without a non-compete Even if a non-compete agreement is invalid, an employer can pursue legal action against a former employee for \"poaching\" clients under other legal principles. 1. Breach of fiduciary duty or duty of loyalty During employment: An employee owes a duty of loyalty to their employer. If an employee tries to steal clients while they are still on the company payroll, they can be sued for a breach of this duty. \"Corporate opportunity\" doctrine: Some courts may view soliciting clients for a competing business during employment as taking an opportunity that rightfully belonged to the employer. 2. Misappropriation of trade secrets Confidential information: If an employee uses confidential or proprietary information, such as a client list, pricing strategy, or internal data, to solicit clients, they can be sued for trade secret misappropriation. Misappropriation laws: The Uniform Trade Secrets Act (UTSA), adopted by most U.S. states, protects companies from employees using trade secrets for their own benefit. 3. Tortious interference Interfering with a contract: An employer can file a claim for tortious interference if a former employee intentionally and improperly disrupts the company's contractual relationships with its clients, causing financial damage. Interfering with a business relationship: This claim is similar to tortious interference with a contract but applies when no formal contract exists. It involves improperly interfering with the company's prospective business relationships."], "why_selected": "Matched keywords: clients, relationship; High engagement (223); Relevance score: 22.7"}
{"thread_id": "thread_1617928495645043", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1617928495645043/", "createdAt_iso": "2024-12-09T12:41:34Z", "metrics": {"reactionCount": 31, "shareCount": 0, "commentCount": 73}, "post_text": "I’m struggling to get patients. I feel like I’ve tried everything. I’ve advertised, marketed, sponsored events, bought dinners for doctors, spoke with every gym in the county, talked to chiropractors, massage therapists etc. I have no idea what to do anymore", "comments_text": ["Personal referrals from previous clients are the best source of new clients. Their words matter so much!", "Google Ads"], "why_selected": "Matched keywords: clients, referrals, gym, do , doctor; High engagement (177); Relevance score: 22.6"}
{"thread_id": "thread_1737555197015705", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1737555197015705/", "createdAt_iso": "2025-05-10T02:49:32Z", "metrics": {"reactionCount": 13, "shareCount": 0, "commentCount": 51}, "post_text": "Hi everyone! I started my mobile cash based pelvic floor PT practice about 2 months ago. After going to countless doctors, I'm realizing this is not the best way to market. However, I haven't been successful yet and was wondering what people did for marketing/battling the \"if I have insurance why should I pay cash\" ideology. I have posted on some moms groups in the area and made an Instagram account that I post in a couple times a week. Any insight would be super helpful! TIA!!!", "comments_text": ["Dont brand or sell yourself as PT to customers bc they may associate that with insurance Just call yourself the Vagina Wizard or something and watch the clients roll in Im half kidding half serious about the name, but you might get my gist", "I have the same business model as well. I helped organize a local \"women's health providers/fitness instructors\" lunch meet up where we had doulas, midwives, Pilates instructors, personal trainers. stroller fitness teachers, etc. we have a great referral network with eachother . I also have a working relationship with the local OBs and pediatricians. Also- other concierge medicine providers are great referral sources. I also have a small instagram account I started just as my virtual business card and friended only local moms and local business owners instead of trying to market to the masses on social media (I rarely post but it's just so people can get some visuals)"], "why_selected": "Matched keywords: clients, marketing, fitness, doctor, relationship; High engagement (115); Relevance score: 22.4"}
{"thread_id": "thread_1698867720884453", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1698867720884453/", "createdAt_iso": "2025-03-26T03:23:59Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 6}, "post_text": "So I have an opportunity to go from being a woman show to working in a gym with personal trainers and lots of modalities such as hyperbaric chamber, red light therapy, cold plunge, and saunas. I would be providing PT services along with wellness such as dry needling and cupping. Has anyone gone down this route and is there anything I am missing? TIA Pros: we both benefit from each other's clients. I have more access to gym equipment, modalities and space. Cons: I would be working for them, further drive from my client population. I am so torn", "comments_text": ["I agree not to work for them. U work for yourself. Maybe agree to collaborate at their gym space 1or 2x a wk. Then u can stay avail to your local already established clients. You could buy a ref light laser for your own mobile practice use and charge for it", "I would ask to rent the space with a short term initially to test the waters. We rented space from a gym and it went really well. We did eventually open a space with those modalities and that’s the only reason we left. We now rent out our extra rooms to a DPC and masseuse. We do still have people from that gym come see us."], "why_selected": "Matched keywords: clients, gym, do , trainer; High engagement (12); Relevance score: 22.3"}
{"thread_id": "thread_1093609664743598", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1093609664743598/", "createdAt_iso": "2022-10-28T11:45:22Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 34}, "post_text": "Hey guys….just curious about those of you having someone doing your social media marketing. Wondering when you typically saw an ROI. I’m just having someone do IG/FB with some FB boosts and 3 emails a month to my email list. IG followers have doubled, biz page fb interaction has gone up but no new clients. Getting a little tired of spending so much money. But maybe I just need to be more patient or switch tactics. What have u guys found to work best?", "comments_text": ["Social media marketing is the hard way to get new patients. Focus on you past patient list. Next to 0 money and will get you way more new patients than cold lead marketing on social media", "Lead gen is, as Ray said, most profitable through past patients. Do your have a digital app that connects you quickly with all of your discharged patients? Even sending a Thinking of You note can re engage them and /or get referrals to their friends and family."], "why_selected": "Matched keywords: clients, marketing, referrals, do , referral; High engagement (72); Relevance score: 22.1"}
{"thread_id": "thread_1453326298771931", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1453326298771931/", "createdAt_iso": "2024-04-18T22:27:11Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 4}, "post_text": "Hello Everyone. I have been seeing clients privately for 25 years. I have a good referral source in place and am ready to expand a bit. I have 3 therapists, who I know very well and are ready to take any referrals I can’t handle time-wise. My plan is to do the marketing, get the referrals, see the client for the initial evaluation/consultation, get payment for a Package of sessions, and then assign them to an appropriate therapist. My questions: 1. What’s the best way to set up this relationship (I’m in California)? 2. I will have them sign the document declaring they are a separate business (I forgot the name of it). 3. How should I pay them (Venmo, Zelle vs check etc)? 4. What % of the total fee that I collect should I pay them? 5. Do I 1099 my payments to them? And there’s probably some considerations/ legal items I’m not thinking about as well. I’m open to suggestions! Thank you!", "comments_text": ["I would definitely pay by check & hopefully they will understand they would be independent contractors since they will be 1099’d at the end of the year. (I think I read that Venmo was going to start reporting when someone received more than $600/year from one source to the government & that might create a nightmare for the IC). The % of the total fee would depend on how much “extra work” you’re needing to do ie billing, marketing, accounting etc. I pay my IC’s 80% of what I (my company) receives as payment. Make sure they carry their own liability insurance also. In some states, it was mandatory to have to carry workers comp insurance also."], "why_selected": "Matched keywords: clients, marketing, referrals, do , relationship; Relevance score: 22.1"}
{"thread_id": "thread_1911518072952749", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1911518072952749/", "createdAt_iso": "2025-11-30T18:37:22Z", "metrics": {"reactionCount": 3, "shareCount": 0, "commentCount": 24}, "post_text": "Looking for some feedback on this situation: I've been subletting from a private gym for a while now and it's been great-- until another PT owner tried to plant themselves in the space too. The gym put them off for a few months, but now they are going back on their word to me and told the other business they could see a client there. Is this a \"tough ish, that's business\" situation? Is this the market now? While I understand it's not personal, it's business...I guess I had more faith in professionals respecting each other's spaces. Tell me I'm wrong and I will get over it 🤣", "comments_text": ["I signed a lease and the lease has exclusivity rights to avoid competition. Not sure if theres a way you could talk to them and see if you could get something like that? But end of the day, it unfortunately is business. I would either leave or just make sure you have clear marketing and start establishing who your clear ideal client is.", "My business mentor had a similar issue and ended up leaving due to the personal relationship falling apart. I’ve worked out of 2 gyms and each time the expectation was that I was the “exclusive” physical therapist at the space. I give preference to clients at the space with either financial discounts or priority scheduling. If you have already been doing that and this still happened, my recommendation is to see if the relationship really benefits you or if you’re just using the space. Do they refer to you regularly? Are they using your presence at the gym to market and generate revenue? Are you regularly working with the personal trainers in the space to ensure their clientele doesn’t fall off due to injury? If the space is benefiting more than you, I’d consider leaving. If not and it’s fairly even, try having a more direct conversation about the logistics of your business relationship and get things in writing. Good luck 👍🏻"], "why_selected": "Matched keywords: clients, marketing, gym, do , relationship; High engagement (51); Relevance score: 22.0"}
{"thread_id": "thread_1461295407975020", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1461295407975020/", "createdAt_iso": "2024-05-01T03:22:25Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 2}, "post_text": "I've been thinking about branching out recently as I've noticed a need for mobile Parkinson's style programming like RockSteady or LSVT in my area. What would be first steps for this outside of gaining the certification/clearance to use the programming systems? Also, if it's the programming/groups that's being provided would it HAVE to be called OT and require an order/be billed as OT? Or is there a way around the referral process to make it more accessible? I live in Illinois and am fairly certain it's a direct access state per the state practice act but I could have misread. Ideally, I imagine running it like a gym model - offering groups and 1:1 at a specific \"class rate\" or \"membership rate.\" Thanks for any and all insight!!", "comments_text": ["Honestly I’d look into PWR instead of LSVT- it’s more adaptable and modifiable to patients. I know a lot of personal trainers teach PWR classes…community word of mouth, no formal referrals", "In order to officially offer PWR, LSVT BIG, or Rock Steady, you would need to take the respective courses to get certified. To offer PWR as a non-therapist, you could get certified as an instructor. That track is geared toward the various fitness instructor roles, and can of course also be taken by clinicians. Rock Steady is by default a wellness/exercise based certification. You can get certified as a therapist and could use the ideas in your practice, but you would not be providing the skills of your discipline. It would be a Rock Steady class. As far as I know, there are only clinician certifications for LSVT BIG. There is BIG for Life, though, which may be something other fitness instructors qualify to get certified in. I frankly haven't seen many of those classes, and there's a prerequisite for the patient/client to have already gone through and graduated from a full round of LSVT BIG. ... I am certified in both PWR and LSVT BIG as a clinician. I have a mobile therapy model and rarely use LSVT BIG because it's exhausting to me personally, and because most of my clients would struggle with the intensity due to age, anxiety, orthopedic concerns, etc. I plan to get certified as a PWR Moves Instructor, which is way more focused on building an exercise class. As a therapist, I highly value both PWR certification tracks. (I might also get a personal training cert.) Keep in mind that if you do mobile THERAPY visits, most of these folks have Medicare or a Medicare replacement plan with out of network benefits. Unless you only want to work with YOPD or only want to do exercise classes, I strongly recommend you examine the rules for Medicare billing. The Medicare Billing for (Mostly) Cash Based PT, OT, SLP Providers Group can help with that area."], "why_selected": "Matched keywords: first, clients, referrals, gym, fitness; Relevance score: 21.9"}
{"thread_id": "thread_1896738404430716", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1896738404430716/", "createdAt_iso": "2025-11-12T16:54:37Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 14}, "post_text": "I'm winging it here and at a point where I don't really know what to do next. My dream job fell into my lap in May when my husband and I decided to move to Las Vegas. I was in a comfy hospital OP ortho job in Alaska, loved my coworkers, my patients, the structure, everything. He retired and we needed more for our family, so I left that behind. I met an ATC in Vegas who owns a beautiful gym in a very affluent area, and was looking to add a PT to his space. I always felt like being a cash based therapist in a gym setting was my ideal setting, but also wanted a few more years of practice under my belt first, since I just graduated in 2023. It felt very meant to be though to do this now, so over the last few months, I have been getting all licensing done, and building my business. Finally, I'm ready to start seeing patients. I've got word of mouth and several leads from the gym owner, I've set up a Facebook page and am posting in local groups, and I paid for Facebook ads. Messages I'm getting though are from people in Boston, Michigan... I'm not sure why, and I can't figure out how to target my ads better. I've also gotten a message from a Physician trying to get me to work at his local clinic one day a week to take insurance. Marketing is not my thing at all. I've tried and failed in the past. I can't give up now, I've invested a lot of money into this endeavor, but I just don't know where to go from here.", "comments_text": ["Came here to say, having some support will definitely help address some of those doubts, and would recommend the Uncaged Team! Good luck!", "Highly recommend business coaching. If you don’t know how to market or about business (majority of us) learning those skills are key to success. I started 8 months into my business and it was game changer wish I would have started earlier"], "why_selected": "Matched keywords: first, marketing, gym, do , ortho; High engagement (30); Relevance score: 21.7"}
{"thread_id": "thread_1167865580651339", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1167865580651339/", "createdAt_iso": "2023-01-26T18:07:39Z", "metrics": {"reactionCount": 10, "shareCount": 0, "commentCount": 79}, "post_text": "I feel bad even asking this but I cannot find any posts that simply just came out and asked… How much do you earn doing this: 1. As a side hustle 2. Full time Feel free to message me privately if you don’t want to post that on here but I would truly appreciate actually seeing some numbers. It’s just tough bc I make 120k a year as a director for several out patient/ personal injury clinics (a very easy/stress free job) and have had colleagues tell me I’d be insane to leave and open my own cash based mobile clinic. I feel like I’d be successful but I don’t have an idea of what “successful” even looks like in terms of money.", "comments_text": ["2020 was my first year full time in business. I’ve brought in $100-120k revenue each year. I could have brought in more than 120k in 2022 if I wanted to prioritize it, but I did a lot of non-work things instead….. What being self-employed allowed me to do in 2022: I decided to stop focusing on the business and rather focus on my mental and physical health. I paid myself as an employee 65k. I camped and hiked 1-2 times a month April-Oct. I improved my hiking ability from 5 miles to 22 miles — hiked Mt Whitney last September! I also hiked the tallest mountains in NC & VA. Spent 2 weeks in Mexico. 1 week in California. A week in the mountains with my sister and nephews. I took up Olympic Weightlifting 8 hours/week. Learned some Spanish. Took a mentorship course and several other PT courses. I did a landscaping project and other home projects — paid for by the business (I work out of my home). I did a lot of bodywork and psychotherapy. I did almost no marketing and stayed busy with word of mouth. I saw 16-20 clients a week @ $149. This year, 2023, raised my rates to $170 so I can max out my week at 18 clients. My goal is to be an intermediate Spanish speaker by the end of the year. Continue with Olympic weightlifting, get back into Pole dancing, and learn about rappelling/Canyoneering to prepare for 3 weeks in the Azores this fall.", "Success to me is owning my own time. ￼ Do I make a little bit more than working for an employer? Yes. But that’s just the tip of the iceberg. ￼ I don’t have to ask anyone permission for ￼ anything"], "why_selected": "Matched keywords: first, clients, marketing, weightlifting, do ; High engagement (168); Relevance score: 21.6"}
{"thread_id": "thread_1109843166453581", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1109843166453581/", "createdAt_iso": "2022-11-16T15:29:16Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 10}, "post_text": "I’m trying to get an idea of pricing structures for my cash-based mobile business. Mostly I will be offering services out of my jiu jitsu gym for our athletes. The gym owner is requiring a 30% cut which is not ideal but it’s what he is already charging other professionals to use the facilities so I can’t negotiate it. I train at a “bougie gym” in a relatively affluent area (Cary, NC). I am dry needling certified and considering offering DN only packages in addition to traditional PT POC. In looking at other cash-based practices in our region I could charge anywhere from $75-225 for an eval and given that 60% of that will go to the gym owner and taxes, I’m probably going to have to go toward the higher end of that to make it worth my while. But I am unsure how to price follow ups and DN/manual therapy only packages. Someone has mentioned to me charging by the minute or by CPT code but again, not sure how to price that and make it viable for me. This is a side gig for now but I’m hoping to grow it. Any suggestions? What has worked for you all?", "comments_text": ["I believe, depending on various state practice acts, you are protected against giving away a percentage of your income. For instance, when creating a rental agreement, you may be able to negotiate a fixed price (per hour, treatment session, whatever) rather than a percentage so if you change your rates based on demand, experience, etc the person renting to you is not further “profiting” off your degree & license. I would highly reconsider… I was in a similar situation with someone renting to me for a percentage but have switched locations where I now pay an hourly rent for the space and it’s a much smoother deal.", "I would find a different place. If you are training at the gym and you already have rapport with people they will definitely come see you whether you are in the gym or not. 30-40% is not sustainable."], "why_selected": "Matched keywords: gym, gym owner; High engagement (20); Relevance score: 21.5"}
{"thread_id": "thread_1120852125352685", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1120852125352685/", "createdAt_iso": "2022-11-30T12:44:17Z", "metrics": {"reactionCount": 91, "shareCount": 0, "commentCount": 26}, "post_text": "Update. All cleaned. Got my EMR. Got my faxing service. Marketing Photoshoot today!!!! Waiting on branding, logo, website, and social media marketing but it’s all starting today!! My goal was 10 visits a week. I know it’s only been ONE week of hitting my goal, but I had 10 visits this week and I’m so excited. How does everyone market to keep evals coming in? I’ve heard some people just do social media, some only send their evaluation notes back to the patients primary care provider to keep your name in the back of their minds…stopping in and giving business cards?? My dream is coming true 🥰🥰🥰 Side note- the pictures and video are taken with iPhones “zoom out” option. Total gym space is only 221 square feet 🤪🤪😭😭", "comments_text": ["Congratulations 🎈🎊", "A perfect 221!"], "why_selected": "Matched keywords: marketing, gym, do , primary care, social media; High engagement (143); Relevance score: 21.5"}
{"thread_id": "thread_1313338989437330", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1313338989437330/", "createdAt_iso": "2023-09-07T20:55:59Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 9}, "post_text": "Those of you who run mobile companies. If you have a client wanting to do some gym work and you aren't affiliated with any gyms what is your strategy? Do gyms allow for personal training as a non affiliated independent PT?", "comments_text": ["I do this often and just pretend to be their friend. I wear gym stuff and participate 🙂", "I have asked the gym specifically if I can go in and help them build a program because they were an active patient of mine. I think it depends on the gym. Remind them that injured clients cancel their memberships. 😁"], "why_selected": "Matched keywords: clients, gym, do , personal training; High engagement (18); Relevance score: 21.5"}
{"thread_id": "thread_1731897530914805", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1731897530914805/", "createdAt_iso": "2025-05-02T15:59:03Z", "metrics": {"reactionCount": 6, "shareCount": 0, "commentCount": 5}, "post_text": "I have a concept that I'm looking to expand and wondering if anyone has ideas to help. I'm a PT and running coach and want to branch more into running. Often, runners in the traditional PT system don't get coached back to full strength due to insurance limitations, leaving them at higher risk of injury. My goal is to change that by picking them up where traditional, insurance-based PT lets off via running coaching (not PT). My goal is to market to physical therapists more than to runners, to get PTs to hand off clients to me as they end their PT. This gets the runner a better experience in return to run and makes it a smoother referral back to that PT if the runner has a problem in the future, I can hand them back to the PT if they need it, and keep them coached if they don't. What I'm wondering if y'all could help me on is the marketing to PTs, getting this idea in front of them. What kind of content, collateral, paperwork, proof, etc. would you want to see before handing off a patient to a running coach with PT expertise? And in what format would you best receive the info? In person? Cold email/call? Some type of learning format? I've already put together some helpful guides for PTs on things like running shoes, patient reported outcome measures, a good running eval, and things like that, so I have stuff to give, but I want to give it in the best way possible. I'm getting long so I'll stop, but thanks for your time!", "comments_text": ["OMG this is something I thought of as well! Are you self employed at this point or working for someone else? And to clarify, you’re trying to see the runner after they complete a return to run and are discharged, right? I feel like if patients that run know their clinic have a designated run coach, that’s huge PR for the clinic. And should you even give those PT related educational content? Because you are marketing as a run coach not PT? And the clinics likely have a cash pay service for when insurance runs out, so your best marketing would be performance coaching for runners who want the guidance of a DPT who can appropriately progress them according to injury history and also reduce recurrence. I hope that made sense, I’m also learning about all this marketing nonsense. I think I have more questions than advice 😅 just think you’re on a cool trajectory!", "I kinda do this in my area. Connections with local run coaches and HS track coaches has been a big referral source for me"], "why_selected": "Matched keywords: clients, marketing, do , content, referral; High engagement (16); Relevance score: 21.4"}
{"thread_id": "thread_1588280465276513", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1588280465276513/", "createdAt_iso": "2024-10-29T22:15:01Z", "metrics": {"reactionCount": 6, "shareCount": 0, "commentCount": 49}, "post_text": "What to do on personal trainers promoting “balance training” for people? I feel like that is not in their scope of practice. How would you all combat this? Their website is basically promoting physical therapy and saying they work with people who are “recovering from illnesses or injuries.”", "comments_text": ["As long as they are not stating that they treat illness its perfectly fine for them to do training balance etc. The difference is we treat they don't.", "You guys would be surprised at what personal trainers are capable of. They have a lot less restrictions on them than we do. A lot of them are now receiving training on \"corrective exercise\", which overlaps greatly with what we do. As someone who consumes a lot of content on Instagram and YouTube from both physical therapists and personal trainers, I will tell you that there are some amazing personal trainers out there. I've seen personal trainers provide exercises to help with balance. I do not feel that it is out of their scope. But to treat a diagnosed balance dysfunction is where the differences arise in our training . But guess what, they can do it anyway and no one can do anything about it. They can practice across state lines, they don't need a physician to sign a plan of care, they don't even need to worry about their state practice act because there is not one as far as I know. If I'm wrong correct me on this. And they can treat Medicare patients until the cows come home and charge whatever they want. PT on the other hand, a totally different story."], "why_selected": "Matched keywords: do , content, instagram, physician, trainer; High engagement (104); Relevance score: 21.3"}
{"thread_id": "thread_1422379975199897", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1422379975199897/", "createdAt_iso": "2024-03-01T11:47:49Z", "metrics": {"reactionCount": 1, "shareCount": 0, "commentCount": 6}, "post_text": "I am curious if anyone has done this business model in the uncaged clinician group. Currently there is a 1 month wait for traditional OP PT in my area with many people complaining that the it is too long of a wait. I see people here and there on the side with my full time job with the government. With so many PTs out there wanting to be their own boss has anyone done a finders fee approach? For example if my company markets to medical providers that we can get their patients in for PT in one week, the PT I hire then sees all of them as they will colllect the total amount they bill through my company but then pay rent/finders fee for all the referrals I send to them? I already have a small space in my house or garage to charge rent if anyone is treated or needs mobile PT. A big personal training gym I ran into does the same approach. They charge rent to all these personal trainers to use their facilities and they go out and hustle to get their own clients and build their business within this facility. Thanks for the advice.", "comments_text": ["I get so many referrals that I’ve been thinking about this", "One time I covered for a therapist who was on an extended vacation and she had some clients that needed an emergency session. The therapist sent her client my info. After I did the session, like a week later when she got back in town, the therapist asked me to pay her the entire service fee and then said she would give me 30%. The problem was she did this after the woman paid me. I had no idea there would be a fee or what not. So I’m sure you can imagine this model isn’t so favorable for me. I actually refer people to my colleagues for free. Everyone comes back to me but I want them to get the help if they need it. What I have been doing instead: Emergency wellness services, where it’s a walk in basis and services are 3x the price. If urgent cares can do this, so can I. I started doing this because I had multiple clients say “can you just cancel someone? I’ll pay 4x the price they were going to pay.” So now I designate a couple days a month for this. I’m still working out the logistics with my own practice. But I think this is the answer I’ve been looking for so I don’t have to turn people in need away."], "why_selected": "Matched keywords: clients, referrals, gym, do , personal training; High engagement (13); Relevance score: 21.3"}
{"thread_id": "thread_986100605494505", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/986100605494505/", "createdAt_iso": "2022-06-10T22:31:44Z", "metrics": {"reactionCount": 35, "shareCount": 0, "commentCount": 25}, "post_text": "**AW RITE! AW RITE! AW RITE!** **It's Friday!!**🥳 Time to KICK IT UP A NOTCH!! 🕺 First, WELCOME to all of our NEW MEMBERS!! 👋 Ready to kick it up a notch with the family, Steph Raih just made public that she is expecting kid #4!!!🎉 Give it up for Kayleigh Coffman. She just ran the San Diego Rock n Roll Marathon!! NICE HUSTLE!! 💪 You know who KICKED IT UP with her? David Herzberg! But it's HOW he KICKED IT UP that ***KICKS IT UP! ***He flew to San Diego to totally surprise Kayleigh Coffman AND one of their patients whose goal was to run the race - and ran with them!! THAT is how you LOVE. SERVE. CARE. LEAD!!!❤ While we are on the topic of running, let's talk about Stephanie Mundt. The woman has had physical setback after physical setback. We're talking stress fractures, hip labrum stuff, everything. She just completed her Marathon comeback by running the SD RnR in.... get this... 3:18:34!! BAMFUEGO!! 👊 Excited for Aimee Sherman! She just launched her own biz - HUNGRY HEARTS GYM-KITCHEN!!! Fitness and health under one roof!!! LOVE IT!!!❤🦁👊 Tennis, anyone? Ginger Morrissey and her partner just won their division at the Member-Guest tournament at Carmel Country Club in Charlotte, NC!! SOLID!! 🎉 Let's all say \"Hi\" to the new Grandview schools PT, Jo Givhan!!! CONGRATS!!! 🥳🎉 UNCAGED PATHWAY member, Brittney Dillman said: \"Bye, Felicia\" to the JOB and is now FULLY UNCAGED!! SADDLE UP AND LET'S GOOOOO!!! 🦁🕺 This may have been mentioned, by recent PATHWAY member, Tirsa Baker is now FULLY UNCAGED with her cash pediatric practice, RENEW!! That's right. Pediatrics and cash-based. Tirsa is going to be on the HIGHLIGHT SERIES SHOW with me SOON to share her experiences! LET'S GOOOOOO!!!! 🦁 Chelsea Petrakovitz has expanded her KNAHLEDGE. She is now a Certified Pregnancy and Postpartum Corrective Exercise Specialist!!! BOOOOM!! 🎉 You CAN NOT stop J Michelle Martin from dominating. You can only hope to contain her. It's possible that she owns the record for KIUAN. What has she done now? She is a vital part of the newly launced NBDA WORLDWIDE Doula Clinic!!! I mean, this woman is ON FIRE!!! 🔥🔥🔥 Danielle Nonn Farrell kicked life up a notch. She and NEW hubby, Kyle, got married!!! Let's all head to Rochester for the party!!! 🎉❤ There is someone else kicking the family life up a notch. Jessica Wright just announced that Baby Fotoorehchi will be making an appearance Nov of this year!!! CONGRATS!!! 🥳❤ Occasionally you just gotta give a shout out to the spouse of someone in the group. Let's all rise and put our hands together for Tyson Dukes' wife, Johnna! She was just elected at President of Opticians Association of America!! WOW!!!! CONGRATS!! 🔥👊🎉🥳 Let's don't forget about Emily Kubat's hustle. She just completed her first 13.1!! S O L I D!!!💪👊 Growing her Famousity is PATHWAY student, Kelsey Harris. She is being interviewed with JJ Mowder-Tunney! Who is that you ask? JJ is pretty much \"the Tom Brady\" of stroke rehab. WAY COOL, KELSEY!!! 💪👊 Excited for Francis Garcia! He and his wife finally were able to have a house warming party for their newly refurbished home!!🎉 Speaking of \"House Parties\", Kevin DeGroot had the Open House for his clinic's (TZeroPhysio) new location this week. He had 70 people attend !!!! BAMTASTIC, BRO!!! Kalyca Jin Zarich, his admin assistant, was part of the festivities!! 🎉🎉🎉 I wanna give it up for Reanna Frigge, PATHWAY student. She hosted her first workshop this week in which 9 ladies attended. From that, she had FOUR evals schedule with her!! THAT IS FREAKIN SOLID!!! 👊🔥🕺🦁 Lara Johnson kicked up her clinic by moving into a bigger, brighter, sunnier spot!! YELLOW BRICK PHYSICAL THERAPY is growing!!!! 🎉👊 You can't get much more famous than appearing on a NATIONAL TV SHOW!!! That's exactly what Cindy Carron Weinberger will be doing TONIGHT!!! ESPN will be airing a story about her practice, MOBILE THERAPY GROUP, LLC, doing rehab with a collegiate golfer!! BIG TIME PLAYA!! 🕺🔥💪 ALL THESE AMAZING WINS, YET I KNOW MANY WERE MISSED! Go make it a FANTAWESOME weekend, everyone!! 🕺", "comments_text": ["Grateful for the shout out my amazing friend and mentor - however it’s my purpose that drives me and those who inspire me to do what I do. Kicking it up a notch comes easy when since there is still so much to do and live for 💪🏻", "Thanks for the shout out Captain! Had some great fun at member guest! Congratulations to all of the WINNERS this week! Let’s keep kicking it up a notch!"], "why_selected": "Matched keywords: first, gym, fitness, do , launch; High engagement (85); Relevance score: 21.2"}
{"thread_id": "thread_1516568605781033", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1516568605781033/", "createdAt_iso": "2024-07-23T14:35:41Z", "metrics": {"reactionCount": 4, "shareCount": 0, "commentCount": 23}, "post_text": "This seems so basic, but how do you actually drop off marketing materials to referring clinicians/mds?", "comments_text": ["Something off beat or off the wall like a shock and awe package. Having written a book on your expertise works well, because it takes up physical space on their desk or shelf, but stays subconsciously in the mind. Mail a package of peanuts directly to the doctor with a flyer saying “You’d be nuts not to work with us” A rubber foot saying “I’ve done the hard work for you and got my foot in the door…now here’s how we can work with each other to benefit our patients” If you have a local podcast, getting them on as a guest then opening the 2 way street is a good one.", "Here's my process (I'll probably get a million comments saying I'm doing it wrong but....). When I go in, I only bring one form of marketing materials, letter, brochure, card, so I have excuses to come back and drop off more. When I go in, I ask the front desk person their name and if I can drop off materials for the doctor (s). Always respect their level of busy-ness. If they have time for small chitter-chatter while I get out the materials, then that's fine. As soon as I leave the office, I write down the name of the front desk person and any little details they said (going on vacation soon, only work in the mornings, etc). I then put in my calendar when I'll be coming back to drop off more info. On the return visit, I say hello to the front desk person by name and say something about our last conversation (how was your vacation? I came in the morning because I knew you'd be here....) While dropping off different marketing materials from the last time, I try to get some Intel from the front desk (would I be able to schedule a meeting with the doc? How does your office handle PT referrals? Etc). It's a snowball process of getting the trust of the front desk, the gatekeepers. So you can get in to see the MDs face to face."], "why_selected": "Matched keywords: marketing, referrals, do , doctor, opening; High engagement (50); Relevance score: 21.0"}
{"thread_id": "thread_1355967938507768", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1355967938507768/", "createdAt_iso": "2023-11-16T00:30:42Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 12}, "post_text": "Hello everyone, I have a few questions where I am stuck currently. Sorry for the long post. I started my business as a side hustle and planning to go all in next year. I started with my price being below average according to other practitioners. I am cash based/out of network concierge PT. 1. I want to increase my pricing starting January, with travel time, one on one hour, I do not think it is sustainable long term with the current pricing I have. Does any one have a letter format or any templates they use to send it to the clients? If I have new clients, do I tell them the new price from January, how to go forward with this? 2. I have started offering pelvic floor PT services and added that as a specialty. I have different pricing for pelvic floor patients as compared to non pelvic floor clients. I am not very sure if I should keep the pricing different or same for pelvic floor clients, if it’s higher, should I increase the time that I treat the pelvic floor patients for? Do any of you have different pricing for things you treat or do you keep it all the same. Any guidance or help here would be greatly appreciated. Thank you !", "comments_text": ["I charge the same rate for everything that I do from physical therapy to a wellness visit. This was good advice given to me a while back. The reasoning is that if you start seeing someone for wellness and charging them one rate and then they tweak their knee and they need you to take care of that, then it’s difficult to adjust the rate. So i suggest you just stick to one rate for your time…Period. As for your current clients, you could grandfather them in at their current rate, or slightly increased rate, if you’d like. However, if they take a hiatus from you for any reason, then I would suggest that they return at the current rate.", "You also have the option of grandfathering in current clients. If it's only a side hustle and you don't have a full caseload but want to honor and keep current loyal clients, you can raise your price point for new patients but keep your price point for current patients. Some of our clinicians have done this. I did it for a couple long standing patients that I had been seeing for a long time."], "why_selected": "Matched keywords: clients, do ; High engagement (26); Relevance score: 20.6"}
{"thread_id": "thread_1150790452358852", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1150790452358852/", "createdAt_iso": "2023-01-03T18:05:48Z", "metrics": {"reactionCount": 8, "shareCount": 0, "commentCount": 6}, "post_text": "Hello all! I'm finally ready to start knocking on some doors to get referrals. Anyone here care to share their experience on how to even go about setting an appointment to talk to these MDs? Also, what's a good opener? I'm usually shy, but I know that's not acceptable when trying to get your private practice off the ground😅 I'm a concierge mobile vestibular physical therapist, so my target referral sources would be neurologists, ENTs & Audiologists. TIA!", "comments_text": ["I’m just getting started with this too. I have a friend who is an MD who I asked about this. He said what works best is to call ahead and ask 1) who would be the best person to talk to for referrals in the office 2) ask what time is normally down time for them 3) make it quick and efficient. …he said meeting you face to face is nice, but he’s very busy so 5 min or less is preferred.", "Hey there! I also started mobile vestibular practice too!!! I have since transitioned to renting a space but would love to chat! ☺️ In all honesty I haven’t had too much success with going to doctors, even ENT and neurologists. I’ve done door knocking, phone calls, scheduled lunch and learns, scheduled myself as a patient (I have my own issues too! Lol) and well… I get most of my clients with direct marketing. I’m so excited for you! Would love to share what’s worked (and what hasn’t for me haha)"], "why_selected": "Matched keywords: clients, marketing, referrals, lunch and learn, doctor; High engagement (20); Relevance score: 20.5"}
{"thread_id": "thread_1046864926084739", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1046864926084739/", "createdAt_iso": "2022-09-03T18:48:10Z", "metrics": {"reactionCount": 13, "shareCount": 0, "commentCount": 51}, "post_text": "Hello there! I want to be uncaged but currently don’t have the brain power or time to do so… (mom of a 3 yo and 9 month twins). Can someone shed some light on the whole “you can’t provide therapy services under cash pay because they’re billable to Medicare” thing? Do I have that concept wrong? I see people offering “wellness” rather than therapy. If the above is how it works, aren’t you by default not providing skilled therapy covered by Medicare if you’re not documenting your services? There is no skill of a therapist if there is no documented skill of a therapist, and no physician signed POC right? What am I missing here or do I have it all wrong? Thanks for helping me out if you can. I have a few clients in home health that told me they’d hire me if I started my own practice, but there is absolutely so much I don’t know and I don’t have the time to figure it all out 😅 I’ve just been lurking in here trying to slowly glean information and wrap my head around this concept. Thanks 😊", "comments_text": ["Great question Veronica Erlenbush, and let’s get some clarity here. The reason why most PT’s say that you cannot charge cash for Medicare beneficiaries is due to the Meidcare Mandatory Claims Submission Rule. Meaning, if it is skilled PT that Medicare covers, it is mandatory that we submit a claim. Where it gets tricky, is if you have literally no relationship with Medicare, there is no way for you to submit a claim. Here is where it gets confusing: If there is no way to technically submit a claim online, but it’s still mandatory for you to do it as a non-participating provider……you can now understand why this is talked about so much lol. Here is where I can give you clarity: Medicare does define wellness as essentially skilled care for the patient. So, if it is unskilled like simple strengthening and endurance, technically that is NOT covered UNLESS a pre-qualifying injury or hospitalization takes place. See where I’m going here? So, if a Medicare aged client is seeking you out for general strengthening and well-being and they aren’t being treated for a specific injury or disorder, you can have them sign a Medicare beneficiary form decided under their own free will to pay you out-of-pocket for wellness services. I know it’s a mess. Honestly, I’m with PT’s who have battled this and called it unconstitutional. They have created a monopoly essentially. I believe the only true loophole left, is if they are truly wellness (which the funny thing is that’s about 90% of HH clients I have seen after they have been discharged from therapy). Then, as long as they are deciding under their own free will because they want to get stronger and pay you, technically they can. You just have to be okay with some physical therapists saying it’s “risky”. I believe Medicare has struck immense levels of fear into our profession to try to make sure they keep their monopoly in place. But, if a Medicare aged client who doesn’t need skilled therapy comes to me and wants to get stronger to age better, I’ll see them 10 out of 10 times.", "As a parent, I'll give you parent version. You can't take cash from medicare patient for what would be something medicare pays for. If you a rehabbing a post op knee, can't do it, but if you are keeping them from having pain while playing golf (not a covered service by Medicare) you can."], "why_selected": "Matched keywords: clients, do , relationship, physician, strength; High engagement (115); Relevance score: 20.4"}
{"thread_id": "thread_1898550057582884", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1898550057582884/", "createdAt_iso": "2025-11-14T20:18:42Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 6}, "post_text": "Hey everyone, happy Friday! I have had my own clinic (cash and private insurance) for about a year and a half now. I rent space out of a gym and am looking to move to another gym that I align with better. This new gym has a vision of having 5 locations and this is an opportunity to grow with them. I would still rent space out of the gym while being able to use their equipment. The new gym is about 15-20 min drive from my current location. With that said, has anyone moved from one location to another? What was your transition plan? What is the process of changing your address with BCBS and can you have 2 addresses during a transition phase? I appreciate all your help and insight!", "comments_text": ["Congratulations! We are moving our primary location for a third time in 3 years because we are growing so fast. And now we are also adding a second location too. For BCBS, you need to first log into CAQH and add the location. You can have two locations, so just add your new one, leave the old one as your primary location and then the next time you reattest switch the new one to the primary location and delete the old location. Step 2: log into Availity and go to payer spaces, pick your local Blue Cross, then go to provider enrollment, then choose either individual or group depending on what you are and then select change address and fill out that application. Takes up to 30 days to process", "LETS GOOO 💪"], "why_selected": "Matched keywords: first, gym, rent space; High engagement (14); Relevance score: 20.4"}
{"thread_id": "thread_1641560443281848", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1641560443281848/", "createdAt_iso": "2025-01-11T03:59:39Z", "metrics": {"reactionCount": 0, "shareCount": 0, "commentCount": 4}, "post_text": "Could use some insight into potential for kickback law violations?? Here's what's going on: I have been networking with local businesses and got connected with a small gym in the area. We did a service trade experience where I went in and did their initial consult process at the gym, and the owner's wife came to my clinic and I gave her a free eval (I'm in women's pelvic health). We basically got familiar with how we each approach things and we have very similar views on health and wellness. We both feel like working together would be a good fit and are trying to find ways to work together and support each other. They've tried workshops in the past but they feel like they fall short with their clientele so they aren't super keen on that idea. They then proposed the idea to me that if I sent people their way, they would pay me the equivalent of that person's first month membership. I've been digging into kickback laws and it seems pretty black and white that if they were another medical provider, it would be a violation. But when it's not another medical provider it seems like a gray area? It's my first time running into this and I want to make sure I'm solid on this. Not sure if this is common practice in other industries to compensate for referrals? If so I'd also like to have a better response if it ever comes up again. Any insight is greatly appreciated 🙏", "comments_text": ["This is 100% lawyer territory. I wouldn’t trust any Facebook group on this because the repercussions of a wrong choice could be severe and expensive.", "Not an attorney obviously but I think in general receiving compensation for referrals is a bad idea. That being said, I don’t think this would be much different from being an affiliate for a product that you promote to patients where you get a cut of sales. Always a good idea to disclose your interest to the patient up front but I wouldn’t think you’re out of bounds legally."], "why_selected": "Matched keywords: first, referrals, gym, networking, referral; Relevance score: 20.1"}
{"thread_id": "thread_1465773350860559", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1465773350860559/", "createdAt_iso": "2024-05-07T20:54:23Z", "metrics": {"reactionCount": 2, "shareCount": 0, "commentCount": 3}, "post_text": "I have a meeting planned with a primary care physician who is opening up a concierge practice. I would like to present the option of working with her practice. - I am thinking about annual PT assessments being offered to her clients and/or giving her practice access to my practice as some sort of a partnership. 1) Has anyone partnered with a local concierge physician? 2) If so, how did you structure the partnership? Did anything specific work or not work well? 3) is there anything that you found concierge physicians really need/want or see value in offering to their clients that a PT can assist with? Thank you so much in advance!", "comments_text": ["I’m in geriatrics and most of my referrals are from a concierge MD,but I also tell everyone about her services as most don’t know there is an option to get a physician to come to their home! It’s a win win.", "The concierge pediatrician sends me referrals. She does not take a cut and I refer to her as well."], "why_selected": "Matched keywords: clients, referrals, primary care, physician, opening; Relevance score: 20.1"}
{"thread_id": "thread_1795561754548382", "url": "https://www.facebook.com/groups/uncagedcliniciangroup/permalink/1795561754548382/", "createdAt_iso": "2025-07-21T17:11:11Z", "metrics": {"reactionCount": 8, "shareCount": 0, "commentCount": 28}, "post_text": "Hi everyone, I could really use some advice and perspective from this amazing group. I’ve been feeling a bit stuck lately—my schedule recently went from fully booked to a little quiet, and it’s starting to impact my mindset. Some of the change is positive—several patients progressed faster than expected and were discharged early (which is great!), but I also think summer schedules and vacations are playing a role. New patients are trickling in, but many are opting for visits spaced a week or more apart due to financial reasons. While I completely understand and respect that, it’s been tough from a business standpoint. I find myself spending even more time outside of sessions—checking in, following up, and prepping between visits—and it’s starting to feel draining (not burnout, but close). I’m slowly getting into social media, but it’s very time-consuming and I’m not sure I’ve found my rhythm yet. My niche is pelvic health and chronic pain across the lifespan, mostly serving women, and while my patients are committed, their own full plates with work, family, and other medical appointments make scheduling consistent care tricky. We’ve started offering some telehealth sessions, which helps, but overall, the dip is weighing on me. This is the first real slump I’ve experienced since opening. Friends and colleagues keep suggesting I contract with insurance for the short-term, then phase it out after growing my client base—but that route feels overwhelming and not aligned with how I want to work. Has anyone else navigated a slow season like this in a cash-based or hybrid pelvic health practice? What helped you stay afloat and continue growing while staying true to your values and energy? I truly love the work I do, and my patients are getting great results—it’s just the business side that feels heavy right now. Appreciate any ideas, support, or even just solidarity 💛", "comments_text": ["Been uncaged 20 years. Spring of 24' my scheduled dried up for a month or so. Ebbs and flows of a new post covid environment. Since u r uncaged, taking insurance will not change how u practice, but will change your reimbursement rate. We took most when we opened, only take 2 now.", "I have a similar practice. I’m a pelvic therapist and I do Dry Needling. I don’t take any insurance except for Medicare. I’m in Florida so summer definitely slows down seasonally. But I take advantage of it and take Fridays off in the summer. But if you have a cash based element to practice, you definitely have got to be engaged in social media on the regular. You have to have a foundation set up and then get yourself established in organic conversations through different Facebook groups that focus on your population. I have found this to be Very very helpful. I would strongly suggest against going with insurance. If you really feel like you need something temporary contract with a home health agency and do a little home health on the side. Also consider connecting with a home health agency and offering to do a Pelvic Floor program for them. Just a basic bladder training program nothing crazy because I don’t do internals in the home with the elderly. But teaching basic bladder health and having a program focused on incontinence in the elderly is fairly simple and straightforward, and it can be a good way to diverse by your practice and show up your schedule in times like this. ￼ also also connect with local outpatient physical therapist helped them identify your patient population to refer to you. I get a lot of referrals from massage therapist Chiropracter‘s other physical therapist. They’re a great source of referrals. Also look for a business women’s networking group local. The one I belong to is very supportive about referring patients and it’s also been a great resource of patience ￼￼"], "why_selected": "Matched keywords: first, referrals, do , networking, opening; High engagement (64); Relevance score: 20.1"}
